{
	"gui.nochatreport.secureChat": "Tato možnost nemůže fungovat s No Chat Reports, protože nejsou žádné digitální podpisy pro ověření.",
	"gui.nochatreport.noReporting": "Náhlašování v chatu je na to tomto serveru zakázáno, díky No Chat Reports.",
	"disconnect.nochatreports.client": "Tento server nemá No Chat Reports, ale nakonfigurovali jste jej tak, aby se na serveru vyžadoval.",
	"gui.nochatreports.status_secure": "Tento server má naninstalované No Chat Reports, nebo zabreňuje vaše aby vaše zprávy mohly být nahlašovatelné jiným známým způsobem. Můžete chatovat v bezpečí.",
	"gui.nochatreports.status_unintrusive": "Tento server nezabraňuje nahlašování zpráv ale povoluje odesílání nepodepsaných zpráv. Technicky mouhou stále být nahlášeny Mojangu ale většinou nejsou považovány jako platné důkazy Technically - they can still be reported to Mojang, but are generally not considered valid evidence, a je nepravděpodobné, že by na základě těchto zpráv byla přijata jakákoli opatření.",
	"gui.nochatreports.status_insecure": "Tento server vyžaduje aby všechny zprávy byly podepsané, a vy jste souhlasili s tímto nastavením. Všechno co odešlete do chatu je potenciálně usvědčující důkaz který může být použit proti vám v hlášení. Můžete manuálně odebrat tento server z NoChatReports.json ve vaší 'config' složce aby jste znovu dostali varováni.",
	"gui.nochatreports.status_unknown": "No Chat Reports nemůže vyhodnotit bezpečnost tohoto serveru. Toto by se nikdy nemělo stát, prosím nahlašte to jako chybu vývojáři modu.",
	"gui.nochatreports.unsafe_server.header": "Pozor: Nezabezpečený Server",
	"gui.nochatreports.unsafe_server.contents": "Tento server vyžaduje, aby všechny zprávy v chatu byly podepsané, což znamená, že je lze nahlásit Mojangu. To pravděpodobně znamená, že majitel serveru měl ve vlastnostech server.properties povolenou volbu 'enforce-secure-profile', která je od verze 1.19.1 výchozí. Můžete se rozhodnout hrát i tak, ale žádné hlášení chatu vás nebude moci ochránit.",
	"gui.nochatreports.unsafe_server.check": "Znovu neukazovat pro tento server",
	"gui.nochatrepords.reload_config_tooltip": "Reloadnout No Chat Reports config. Používejte opatrně ."
}
