{
	"modmenu.descriptionTranslation.nochatreports": "Entfernt kryptographische Signaturen von Chatnachrichten, sodass sie nicht nachverfolgt oder mit deinem Microsoft-Account in Verbindung gebracht werden können, wodurch sie nicht an Mojang gemeldet werden können.",
	"key.nochatreports.ctrl": "Strg",
	"key.nochatreports.cmd": "Cmd",
	"gui.nochatreports.secure_chat": "Diese Option kann nicht mit No Chat Reports verwendet werden, da keine Signaturen zum Verifizieren vorhanden sind.",
	"gui.nochatreports.no_reporting": "Nachrichten melden ist auf diesem Server dank No Chat Reports deaktiviert.",
	"disconnect.nochatreports.client": "Dieser Server hat No Chat Reports nicht installiert, aber du hast eingestellt, dass es auf Servern notwendig ist.",
	"gui.nochatreports.safety_status_button.controls": "Linksklick, um zwischen Signaturmodi zu wechseln.",
	"gui.nochatreports.safety_status.secure": "Dieser Server hat No Chat Reports installiert oder verhindert das Melden von Nachrichten auf eine andere bekannte Weise. Du kannst sicher chatten.",
	"gui.nochatreports.safety_status.singleplayer": "Im Einzelspieler oder in von dir geöffneten LAN-Welten kannst du immer sicher chatten.",
	"gui.nochatreports.safety_status.unintrusive": "Dieser Server erlaubt dir, unsignierte Nachrichten zu schicken, welche nicht an Mojang gemeldet werden können. Wenn kein Plugin, das dies verhindert, auf dem Server installiert ist, signieren Vanilla-Clients dennoch ihre Nachrichten und zeigen unsignierte Nachrichten als \"Unverifiziert\" an und Spieler, die die Option \"Nur sicheren Chat anzeigen\" aktivieren, sehen deine Nachrichten nicht.",
	"gui.nochatreports.safety_status.insecure": "Dieser Server verlangt, dass alle Chatnachrichten signiert sind, was bedeutet, dass sie an Mojang gemeldet werden können. Alles, was du in den Chat schreibst, ist ein potenziell belastender Beweis und kann in Meldungen gegen dich verwendet werden.",
	"gui.nochatreports.safety_status.insecure_signing": "Du hast aktiviert, dass alle Chatnachrichten signiert sind, was bedeutet, dass sie an Mojang gemeldet werden können. Alles, was du in den Chat schreibst, ist ein potenziell belastender Beweis und kann in Meldungen gegen dich verwendet werden.",
	"gui.nochatreports.safety_status.realms": "Dies ist ein Realms Server. Meldungen lassen sich hier nicht verhindern und Mojang betreibt automatisierte Chat-Überwachung, um potentielle \"Online-Gefahren\" zu erkennen und durch einen menschlichen Mitarbeiter auswerten zu lassen - ob der Besitzer des Realms das möchte oder nicht. Deine einzige Hoffnung ist Chat-Verschlüsselung.",
	"gui.nochatreports.safety_status.unknown": "No Chat Reports kann die Sicherheit dieses Servers noch nicht einschätzen. Schick eine Chatnachricht, um die Sicherheit schätzen zu lassen.",
	"gui.nochatreports.safety_status.undefined": "No Chat Reports konnte die Sicherheit dieses Servers nicht einschätzen. Dies sollte niemals vorkommen, bitte melde es dem Mod-Entwickler als einen Bug.",
	"gui.nochatreports.signing_status.allowed_realms": "Nachrichten-Signaturen sind auf Realms immer aktiviert, da sie immer benötigt werden und es keinen Vorteil bringen würde, sie zu deaktivieren.",
	"gui.nochatreports.signing_status.allowed": "Nachrichten-Signaturen sind für diese Sitzung aktiviert.",
	"gui.nochatreports.signing_status.allowed_session": "Nachrichten-Signaturen sind für diese Sitzung aktiviert, werden jedoch deaktiviert, sobald du neu beitrittst.",
	"gui.nochatreports.signing_status.disabled": "Nachrichten-Signaturen sind für diese Sitzung deaktiviert.",
	"gui.nochatreports.signing_status.disabled_allowance_pending": "Nachrichten-Signaturen sind für diese Sitzung deaktiviert, werden jedoch aktiviert, sobald du eine Nachricht schickst.",
	"gui.nochatreports.signing_status.disabled_offline": "Nachrichten-Signaturen sind deaktiviert, da dies ein Offline-Server ist.",
	"gui.nochatreports.reload_config_tooltip": "No Chat Reports Konfigurationsdatei neu laden. Nutze dies mit Bedacht.",
	"gui.nochatreports.verified_server": "§a§lSicherer Server§r\nDieser Server hat No Chat Reports installiert oder verhindert das Melden von Nachrichten auf eine andere bekannte Weise. Du kannst dort sicher chatten.",
	"gui.nochatreports.ncr_toggle_tooltip": "§lNo Chat Reports:§r %1$s\nDe- oder aktiviere die meisten der clientseitigen Funktionen dieser Mod. Dies kann notwendig sein, um sich mit einigen Paper/Velocity-Server zu verbinden, da diese dafür bekannt sind, Probleme mit NCR zu verursachen.\nBestimmte, nicht verbindungsbezogene Funktionen wie Verschlüsselung, Chat Trust Status Anpassungen und das Entfernen von Vanillas \"Chatnachrichten können nicht verifiziert werden\"-Meldung funktionieren weiterhin, können aber in der Konfigurationsdatei individuell deaktiviert werden.",
	"gui.nochatreports.ncr_state_on": "§a§lAktiviert§r",
	"gui.nochatreports.ncr_state_off": "§c§lDeaktiviert§r",
	"tag.nochatreports.encrypted": "Verschlüsselt mit: %1$s",
	"tag.nochatreports.encrypted_original": "Unverschlüsselt: %1$s",
	"gui.nochatreports.encryption_tooltip": "§lVerschlüsselung:§r %1$s\nRechtsklick zum Konfigurieren.\n\nSo lange Verschlüsselung aktiviert ist, kannst du sie für eine einzelne Nachricht aussetzen, indem du %2$s gedrückt hältst, während du sie schickst.",
	"gui.nochatreports.encryption_tooltip_invalid": "§lVerschlüsselung:§r %1$s\n§cUngültige Einstellung. Klicke, zum Konfigurieren.",
	"gui.nochatreports.encryption_state_on": "§a§lAktiviert§r",
	"gui.nochatreports.encryption_state_off": "§c§lDeaktiviert§r",
	"gui.nochatreports.encryption_warning.header": "Infos zur Verschlüsselung",
	"gui.nochatreports.encryption_warning.contents": "Du kannst deine Nachrichten mit einem Geheimschlüssel verschlüsseln. Nur Spieler, die diesen Schlüssel kennen, können sie entschlüsseln. No Chat Reports entschlüsselt automatisch alle verschlüsselten Nachrichten, wenn ein gültiger Schlüssel angegeben und die Funktion aktiviert ist.\nMerke aber, dass Verschlüsselung keine magische Lösung des Problems ist. Moderatoren auf Drittanbieter-Servern können dich stummschalten oder bannen, da deine Nachrichten für sie als ein Buchstabensalat im Chat erscheinen. Weiterhin ist zu empfehlen, dass du einen einzigartigen Verschlüsselungs-Geheimschlüssel generierst und diesen nur auf sicheren Kanälen mit anderen teilst. Klicke \"Mehr erfahren\", um mehr darüber zu erfahren, wie und wann du Verschlüsselung nutzen solltest.",
	"gui.nochatreports.encryption_warning.check": "Nicht nochmal anzeigen",
	"gui.nochatreports.encryption_warning.learn_more": "Mehr erfahren",
	"gui.nochatreports.encryption_config.header": "Verschlüsselungs-Einstellungen",
	"gui.nochatreports.encryption_config.key_desc": "§lGeheimschlüssel§r\nSchlüssel, der genutzt wird, um deine Nachrichten zu ver- und entschlüsseln. Sein Format hängt von dem verwendeten Algorithmus ab, bei AES sind es 128 Bits Base64-verschlüsselter binärer Daten.",
	"gui.nochatreports.encryption_config.passphrase_desc": "§lVerschlüsselungs-Passphrase§r\nStatt einen zufälligen Schlüssel zu generieren, kannst du einen aus einer Passphrase deiner Wahl ableiten. Wenn du dies nutzt, wähle eine starke. Nicht alle Algorithmen unterstützen Passphrases.",
	"gui.nochatreports.encryption_config.validation_ok": "Schlüsselvalidierung: §a§lErfolgreich",
	"gui.nochatreports.encryption_config.validation_failed": "Schlüsselvalidierung: §c§lGescheitert",
	"gui.nochatreports.encryption_config.dice_tooltip": "Generiere einen neuen zufälligen Schlüssel, der den ausgewählten Verschlüsselungs-Algorithmus berücksichtigt.",
	"gui.nochatreports.encryption_config.pass_not_allowed": "<nicht unterstützt>",
	"gui.nochatreports.encryption_config.algorithm": "Algorithmus: %1$s",
	"gui.nochatreports.encryption_config.default_key": "<Standard: %1$s>",
	"gui.nochatreports.encryption_config.encrypt_public": "öffentliche Nachrichten verschlüsseln",
	"algorithm.nochatreports.aes_cfb8_base64.name": "AES/CFB8+Base64R",
	"algorithm.nochatreports.aes_cfb8_base64": "§lAES/CFB8+Base64R§r\nStandard symmetrischer Verschlüsselungs-Algorithmus. Nutzt 128-Bit-Schlüssel, der Output ist in einer speziellen Version von Base64 verschlüsselt, um die Übertragung durch Minecrafts Chat zu unterbinden. Nachteil: Nachrichten sind ungefähr 30 % länger und Server könnten sie kürzen, falls sie die maximale Länge überschreiten.",
	"algorithm.nochatreports.aes_gcm_base64.name": "AES/GCM+Base64R",
	"algorithm.nochatreports.aes_gcm_base64": "§lAES/GCM+Base64R§r\nMehr Sicherheit für den Nachteil, dass Nachrichten größer sind (je 12 Bytes für den Initialization Vector und Authentication Tag, dazu Base64-Verschlüsselung). Wähle dies, wenn dir Sicherheit wichtiger als alles andere ist.",
	"algorithm.nochatreports.aes_ecb_base64.name": "AES/ECB+Base64R",
	"algorithm.nochatreports.aes_ecb_base64": "§lAES/ECB+Base64R§r\nErheblich weniger sicher als der CFB-Modus, aber spart dir einige Bytes, da kein Initialization Vector benötigt wird. Immer noch besser als Caesar.",
	"algorithm.nochatreports.caesar.name": "Caesar",
	"algorithm.nochatreports.caesar": "§lCaesar§r\nMeme-Chiffrierung. Hiermit hoffst du sozusagen, dass Leute gar nicht erst versuchen, deine Nachrichten zu entschlüsseln. Das mag in vielen Fällen stimmen, weshalb die Sinnhaftigkeit von deinem persönlichen Risiko abhängt.\nDer Schlüssel sollte ein Integer von 1 bis 1024 sein. Die Verschiebung erfolgt nach Zeichencode statt alphabetisch, um Kompatibilität mit allen Sprachen sicherzustellen.",
	"nochatreports.connect.nokey_rejected": "Der Server hat die Verbindung ohne einen Chat-Signierungs-Schlüssel abgelehnt.",
	"nochatreports.connect.await": "Auf Neuverbinden warten: %1$s Sekunden...",
	"gui.nochatreports.realms_warning.header": "Vorsicht: Realms",
	"gui.nochatreports.realms_warning.contents": "Realms Server sind nicht privat. Besitzer eines Realms können Meldungen nicht deaktivieren und Mojang betreibt automatisierte Chat-Überwachung, um potentielle \"Online-Gefahren\" zu erkennen und durch einen menschlichen Mitarbeiter auswerten zu lassen. Wenn dann entschieden wird, dass du gegen Minecrafts Community Standards verstoßen hast - selbst wenn sich niemand dadurch angegriffen fühlte - wirst du gebannt - temporär oder permanent, aus allen Mehrspieler-Diensten. Die Nutzung der Chat-Verschlüsselungs wird stark empfohlen.",
	"gui.nochatreports.realms_warning.check": "Nicht nochmal anzeigen",
	"gui.nochatreports.realms_warning.learn_more": "Mehr erfahren",
	"gui.nochatreports.signing_required.header": "Vorsicht: Chat-Signierung angefragt",
	"gui.nochatreports.signing_required.contents": "Dieser Server verlangt, dass alle Chatnachrichten signiert sind, was bedeutet, dass sie an Mojang gemeldet werden können, was zu einem Bann aus dem gesamten Mehrspieler führen kann. Wahrscheinlich hat der Server-Besitzer \"enforce-secure-profile\" in der server.properties aktiviert gelassen, was seit der 1.19.1 der Standardwert ist.\n\nKlicke \"Signierung zulassen\", um Chat-Signierung für diese Sitzung zu aktivieren. Du kannst auch den Sicherheitsstatus-Button im Chat nutzen, um einen Signaturmodus für diesen Server auszuwählen.",
	"gui.nochatreports.signing_required.allow_signing": "Signierung zulassen",
	"gui.nochatreports.signing_required.cancel": "Abbrechen",
	"gui.nochatreports.signing_required.check": "Nicht nochmal während dieser Sitzung anzeigen",
	"chat.nochatreports.disabled.signing_requested": "Der Server hat abgelehnt, eine unsignierte Nachricht zu verschicken. Du kannst Chat-Signierung aktivieren, indem du deinen Signaturmodus änderst oder der entsprechenden Prompt (Nachfrage) zustimmst.",
	"gui.nochatreports.signing_mode": "§lSignaturmodus: %1$s",
	"gui.nochatreports.signing_mode.default": "Standard (%1$s)",
	"gui.nochatreports.signing_mode.always": "Immer",
	"gui.nochatreports.signing_mode.never": "Nie",
	"gui.nochatreports.signing_mode.never_forced": "Nicht aktivierbar",
	"gui.nochatreports.signing_mode.prompt": "Prompt",
	"gui.nochatreports.signing_mode.on_demand": "Bei Bedarf",
	"gui.nochatreports.signing_mode.always.tooltip": "Dieser Modus aktiviert automatisch Signaturen, wenn du dem Server betrittst, genau wie ein Vanilla-Client es tun würde.",
	"gui.nochatreports.signing_mode.never.tooltip": "In diesem Modus sind Nachrichten nie signiert und alle Anfragen des Servers, sie zu verschlüsseln, werden ignoriert.",
	"gui.nochatreports.signing_mode.never_forced.tooltip": "Dieser Modus übermittelt, dass deine Nachrichten überhaupt nicht signiert werden können, da du entweder ein Offline-Konto nutzt oder dein Client deine Signaturschlüssel nicht von Mojangs Diensten abrufen konnte.",
	"gui.nochatreports.signing_mode.prompt.tooltip": "In diesem Modus werden Nachrichten grundsätzlich nicht signiert, aber wenn der Server es verlangt, wird dir ein Pop-up-Bildschirm angezeigt, in dem du Chat-Signierung für eine Sitzung aktivieren kannst.",
	"gui.nochatreports.signing_mode.on_demand.tooltip": "Ähnlich wie der Prompt-Modus, aber statt ein Pop-up anzuzeigen, wird Chat-Signierung automatisch aktiviert, sobald es ein Server verlangt.",

	"configuration.NoChatReports.config": "No Chat Reports",
	"configuration.NoChatReports.category.client": "Client",
	"option.NoChatReports.enableMod": "Mod aktivieren",
	"option.NoChatReports.enableMod.tooltip": "Aktiviert den Großteil der clientseitigen Funktionen der Mod. Wenn du dies umstellst, während du auf einem Server bist, musst du ihm erneut beitreten.",
	"option.NoChatReports.showNCRButton": "NCR-Button anzeigen",
	"option.NoChatReports.showNCRButton.tooltip": "Fügt einen Button zum Mehrspieler-Menü hinzu, der die meisten der clientseitigen Funktionen der Mod de- und aktiviert.",
	"option.NoChatReports.defaultSigningMode": "Standard Signaturmodus",
	"option.NoChatReports.defaultSigningMode.tooltip": "Legt den Standard Signaturmodus für Server, die Chat-Signierung erzwingen oder erlauben fest.",
	"option.NoChatReports.showReloadButton": "Neulade-Button anzeigen",
	"option.NoChatReports.showReloadButton.tooltip": "Fügt einen Button zum Neu laden der Konfigurationsdatei zum Mehrspieler-Menü hinzu.",
	"option.NoChatReports.verifiedIconEnabled": "Verifiziert-Icon anzeigen",
	"option.NoChatReports.verifiedIconEnabled.tooltip": "Erlaubt der Mod, ein spezielles Icon (Symbol) für Server, die No Chat Reports oder andere Anti-Chat-Reporting Software installiert haben, im Mehrspieler-Menü anzuzeigen.",
	"option.NoChatReports.verifiedIconOffsetX": "Verifiziert-Icon X-Offset",
	"option.NoChatReports.verifiedIconOffsetX.tooltip": "Legt das Offset auf der X-Achse für das Anzeigen des \"Sicherer Server\"-Icon fest.",
	"option.NoChatReports.verifiedIconOffsetY": "Verifiziert-Icon Y-Offset",
	"option.NoChatReports.verifiedIconOffsetY.tooltip": "Legt das Offset auf der Y-Achse für das Anzeigen des \"Sicherer Server\"-Icon fest.",
	"gui.NoChatReports.showEncryptionButtonWarning": "§cUnten deaktiviert nicht die Verschlüsselung, es versteckt nur den Button!",
	"option.NoChatReports.showEncryptionButton": "Verschlüsselungs-Button anzeigen",
	"option.NoChatReports.showEncryptionButton.tooltip": "Dies auf \"false\" zu setzen, versteckt schlicht den Verschlüsselungs-Button im Chat. Merke, dass die Verschlüsselung nicht automatisch zusammen mit dem Button deaktiviert wird.",
	"option.NoChatReports.showEncryptionIndicators": "Verschlüsselungs-Indikatoren anzeigen",
	"option.NoChatReports.showEncryptionIndicators.tooltip": "De- und aktiviert die Anzeige des \"verschlüsselte Nachricht\"-Indikators in Form einer lilanen Leiste links und §5§l(§r§5ȯ§5§l)§r beim Hovern rechts von der Chatnachricht.",
	"option.NoChatReports.showServerSafety": "Serversicherheit anzeigen",
	"option.NoChatReports.showServerSafety.tooltip": "Erlaubt der Mod, den Serversicherheits-Status in der unteren rechten Ecke des Chats anzuzeigen. Du kannst mit der Maus über das Icon hovern, um weitere Informationen zu bekommen.",
	"option.NoChatReports.showServerSafety.moreInfo": "§bKlicke hier, um mehr über Serversicherheits-Stufen zu lesen",
	"option.NoChatReports.hideInsecureMessageIndicators": "Indikatoren für unverifizierte Nachrichten verstecken",
	"option.NoChatReports.hideInsecureMessageIndicators.tooltip": "Verhindert, dass der Client Indikatoren für unverifizierte Nachrichten in Form einer grauen Leiste links von der Chatnachricht anzeigt.",
	"option.NoChatReports.hideModifiedMessageIndicators": "Indikatoren für modifizierte Nachrichten verstecken",
	"option.NoChatReports.hideModifiedMessageIndicators.tooltip": "Verhindert, dass der Client Indikatoren für modifizierte Nachrichten in Form einer grauen Leiste links und §7§l(§r§7?§7§l)§r beim Hovern rechts von der Chatnachricht enzeigt.",
	"option.NoChatReports.hideSystemMessageIndicators": "Indikatoren für Systemnachrichten verstecken",
	"option.NoChatReports.hideSystemMessageIndicators.tooltip": "Verhindert, dass der Client Indikatoren für Systemnachrichten in Form einer grauen Leiste links von der Chatnachricht anzeigt.",
	"option.NoChatReports.hideWarningToast": "Warnungs-Toast (Benachrichtigung) verstecken",
	"option.NoChatReports.hideWarningToast.tooltip": "Entfernt ein Warnungs-Toast (eine Benachrichtigung) das angezeigt wird, wenn du Servern mit deaktiviertem §oenforce-secure-profile§r beitrittst.",
	"option.NoChatReports.hideSigningRequestMessage": "Chat-Signierung Anfrage-Nachricht verstecken",
	"option.NoChatReports.hideSigningRequestMessage.tooltip": "Versteckt die Chatnachricht, die angezeigt wird, wenn der Server beim Client anfragt, Chatnachrichten zu signieren.",
	"option.NoChatReports.alwaysHideReportButton": "Melde-Button immer verstecken",
	"option.NoChatReports.alwaysHideReportButton.tooltip": "Verhindert, dass der Client den Melde-Button im Interaktionsfenster anzeigt. Dies ist standardmäßig deaktiviert und die Mod deaktiviert schlicht den Button auf Servern die No Chat Reports installiert haben und fügt einen Tooltip des Buttons mit einer Erklärung hinzu.",
	"option.NoChatReports.demandOnServer": "Auf Servern voraussetzen",
	"option.NoChatReports.demandOnServer.tooltip": "Verhindert das beitreten von Servern, die No Chat Reports nicht installiert haben.",
	"option.NoChatReports.enableDebugLog": "Debug-Log aktivieren",
	"option.NoChatReports.enableDebugLog.tooltip": "De- und aktiviert das Loggen bestimmter Debug-Informationen. Dies ist grundsätzlich nur für Entwickler sinnvoll.",
	"option.NoChatReports.disableTelemetry": "Telemetrie deaktivieren",
	"option.NoChatReports.disableTelemetry.tooltip": "Erlaubt der Mod, die eingebaute Telemetrie (Senden allgemeiner/anonymer Daten zur Erhebung von Statistiken etc. durch Mojang/Microsoft) zu deaktivieren, ähnlich wie es No Telemetry tut.",
	"configuration.NoChatReports.category.lan": "LAN",
	"option.NoChatReports.demandOnClient": "Auf Clients voraussetzen",
	"option.NoChatReports.demandOnClient.tooltip": "Sorgt dafür, dass der Server von allen beitretenden Clients verlangt, No Chat Reports installiert zu haben.",
	"option.NoChatReports.demandOnClientMessage": "Kick-Nachricht wegen Voraussetzen auf Clients",
	"option.NoChatReports.demandOnClientMessage.tooltip": "Nachricht, die dem Client angezeigt wird, wenn er versucht, dem Server beizutreten, ohne No Chat Reports installiert zu haben.",
	"option.NoChatReports.convertToGameMessage": "In Spielnachricht umwandeln",
	"option.NoChatReports.convertToGameMessage.tooltip": "Lässt den Server alle Spielernachrichten in Systemnachrichten umwandeln. Systemnachrichten haben keine dazugehörigen Signaturen und können nicht gemeldet werden. Auf unmodifizierten Clients erscheinen sie mit einer grauen Leiste links im Chat.",
	"option.NoChatReports.addQueryData": "Query-Daten hinzufügen",
	"option.NoChatReports.addQueryData.tooltip": "Erlaubt dem Server, beim Handling von Pings zusätzliche Daten an den Client zu schicken. Diese werden für den Hinweis \"Sicherer Server\" und einige andere technische Zwecke genutzt."
}
