{
	"modmenu.descriptionTranslation.nochatreports": "Strips cryptographic signatures from player messages, making it impossible to track and associate them with your Mojang/Microsoft account, as well as use Player Chat Reporting feature.",
	"gui.nochatreport.secureChat": "This option cannot work with No Chat Reports, since there are no signatures to verify.",
	"gui.nochatreport.noReporting": "Chat reports are disabled on this server, courtesy of No Chat Reports.",
	"disconnect.nochatreports.client": "This server does not have No Chat Reports, and you have it configured to require itself on server.",
	"gui.nochatreports.status_secure": "This server has No Chat Reports installed, or prevents your messages from being reportable in some other known way. You can chat safely.",
	"gui.nochatreports.status_unintrusive": "This server allows you to send unsigned messages which cannot be reported to Mojang. Unless some kind of plugin is installed on server that prevents chat reports - vanilla clients will still send signed messages, display unsigned messages as \"Not Secure\" and not show them if \"Only Show Secure Chat\" is enabled in chat options.",
	"gui.nochatreports.status_insecure": "This server demands all chat messages to be signed and you agreed to proceed with this arrangement. Everything you send in the chat is potentially incriminating evidence that can be used against you in the report. You can remove this server from §oWhitelisted Servers§r in the mod config to get warned again.",
	"gui.nochatreports.status_realms": "This is a Realms server. Not only there is no way to prevent chat reports here, but Mojang also employ automated chat monitoring to identify potential \"online harms\" and escalate them for human review, whether owner of the realm likes it or not. Your only hope is chat encryption.",
	"gui.nochatreports.status_insecure_whitelist_all_servers": "This server demands all chat messages to be signed and you disabled the full-screen warning for it. Everything you send in the chat is potentially incriminating evidence that can be used against you in the report. You can disable §oWhitelist all servers§r in the mod config to get warned again.",
	"gui.nochatreports.status_unknown": "No Chat Reports was toggled mid-session. Server safety status can only be evaluated on login. Please re-join the server to evaluate its safety status.",
	"gui.nochatreports.status_undefined": "No Chat Reports could not evaluate the safety of this server. This should never happen, please report it as a bug to the mod developer.",
	"gui.nochatreports.unsafe_server.header": "Caution: Unsafe Server",
	"gui.nochatreports.unsafe_server.contents": "This server requires all chat messages to be signed, which means they can be reported to Mojang, which may result in a ban from all multiplayer servers. This likely means that the server owner kept \"enforce-secure-profile\" enabled in the server.properties, which is the default since 1.19.1. You can choose to play anyway, but No Chat Reports will not be able to protect you.",
	"gui.nochatreports.unsafe_server.check": "Do not show again for this server",
	"gui.nochatreports.reload_config_tooltip": "Reload No Chat Reports config. Use carefully.",
	"gui.nochatreports.verified_server": "§a§lSafe Server§r\nWe could verify that this server has No Chat Reports installed, or prevents chat reports in some other known way. You can chat there safely.",
	"gui.nochatreports.ncr_toggle_tooltip": "§lNo Chat Reports:§r %1$s\nDisable or enable most of the mod's client-sided functionality. You may have to do this to join some Paper/Velocity servers, as they are known for causing issues with NCR.\nCertain networking-unrelated things, such as encryption, chat trust status tweaks and removal of vanilla's \"Chat messages can't be verified\" toast will still work; they can be disabled in config individually.",
	"gui.nochatreports.ncr_state_on": "§a§lEnabled§r",
	"gui.nochatreports.ncr_state_off": "§c§lDisabled§r",
	"tag.nochatreports.encrypted": "Encrypted using: %1$s",
	"tag.nochatreports.encrypted_original": "Non-decrypted: %1$s",
	"gui.nochatreports.encryption_tooltip": "§lEncryption:§r %1$s\nRight-click to configure.\n\nWhile encryption is enabled, you can prevent it from being applied to the message by holding §n§lCtrl§r when sending it.",
	"gui.nochatreports.encryption_tooltip_invalid": "§lEncryption:§r %1$s\n§cInvalid configuration. Click to configure.",
	"gui.nochatreports.encryption_state_on": "§a§lEnabled§r",
	"gui.nochatreports.encryption_state_off": "§c§lDisabled§r",
	"gui.nochatreports.encryption_warning.header": "About Encryption",
	"gui.nochatreports.encryption_warning.contents": "You can encrypt your messages using a secret key. Only people who know this key will be able to decrypt them. No Chat Reports will automatically decrypt all encrypted messages when suitable key is provided and feature is enabled.\nHowever, be aware that encryption is not a \"magic wand\" kind of solution. Moderators on third-party servers can mute or ban you for sending what will appear to them as garbled mess in chat. Futhermore, it is recommended that you generate custom encryption key, and communicate it to other people only via secure channels. Click \"Learn More\" to learn more about how and when you should use encryption.",
	"gui.nochatreports.encryption_warning.check": "Don't show again",
	"gui.nochatreports.encryption_warning.learn_more": "Learn More",
	"gui.nochatreports.encryption_config.header": "Encryption Settings",
	"gui.nochatreports.encryption_config.key_desc": "§lEncryption Key§r\nKey that will be used to encrypt and decrypt your messages. It's format depends on algorithm; for AES it will be 128 bits of Base64-encoded binary data.",
	"gui.nochatreports.encryption_config.passphrase_desc": "§lEncryption Passphrase§r\nInstead of generating random key, you can derive one from passphrase of your choice. If you use this - choose a strong one. Not all algorithms support passphrases.",
	"gui.nochatreports.encryption_config.validation_ok": "Key Validation: §a§lPassed",
	"gui.nochatreports.encryption_config.validation_failed": "Key Validation: §c§lFailed",
	"gui.nochatreports.encryption_config.dice_tooltip": "Generate new random key with respect to selected encryption algorithm.",
	"gui.nochatreports.encryption_config.pass_not_allowed": "<not supported>",
	"gui.nochatreports.encryption_config.algorithm": "Algorithm: %1$s",
	"gui.nochatreports.encryption_config.default_key": "<default: %1$s>",
	"gui.nochatreports.encryption_config.encrypt_public": "Encrypt public messages",
	"algorithm.nochatreports.aes_cfb8_base64.name": "AES/CFB8+Base64R",
	"algorithm.nochatreports.aes_cfb8_base64": "§lAES/CFB8+Base64R§r\nStandard symmetric encryption algorithm. Uses 128 bit keys, output is encoded in special version of Base64 to permit transfer via Minecraft's chat. As a downside - messages will gain roughly 30% increase in length, and server might truncate them if they exceed size limit.",
	"algorithm.nochatreports.aes_gcm_base64.name": "AES/GCM+Base64R",
	"algorithm.nochatreports.aes_gcm_base64": "§lAES/GCM+Base64R§r\nMore security in exchange for severe increase in message size (12 bytes for initialization vector and 12 for authentication tag, Base64 encoding on top). Choose if you value security over anything else.",
	"algorithm.nochatreports.aes_ecb_base64.name": "AES/ECB+Base64R",
	"algorithm.nochatreports.aes_ecb_base64": "§lAES/ECB+Base64R§r\nConsiderably less secure than CFB mode, but saves you some bytes by not requiring initialization vector. Still beats Caesar.",
	"algorithm.nochatreports.caesar.name": "Caesar",
	"algorithm.nochatreports.caesar": "§lCaesar§r\nMeme cipher. With this you're basically hoping that people will give up without even trying to decrypt your messages. That might be true in many cases, so viability of using it depends on your threat model.\nKey should be integer from 1 to 1024. Shift is done by character code instead of alphabetically, to ensure compatibility with any language.",
	"nochatreports.connect.nokey_rejected": "Server rejected connection without chat signing key.",
	"nochatreports.connect.await": "Awaiting reconnection: %1$s seconds...",
	"gui.nochatreports.realms_warning.header": "Caution: Realms",
	"gui.nochatreports.realms_warning.contents": "Realms servers are not private. Realm owners cannot disable chat reporting, and Mojang applies additional chat monitoring to identify potential \"online harms\" and escalate them to human review. If you are then found to violate Minecraft's Community Standards - even if chat participants did not get offended - you will be banned, temporarily or permanently, from all multiplayer services. Use of encryption is highly advised.",
	"gui.nochatreports.realms_warning.check": "Don't show again",
	"gui.nochatreports.realms_warning.learn_more": "Learn More",
	"gui.NoChatReports.showEncryptionButtonWarning": "§cBelow does not disable encryption, it only hides the button!",

	"configuration.NoChatReports.config": "No Chat Reports",

	"configuration.NoChatReports.category.visual": "Visual",

	"option.NoChatReports.showServerSafety": "Show server safety",
	"option.NoChatReports.showServerSafety.tooltip": "Allows the client to display server safety status in bottom-right corner of chat screen. The icon is hoverable for additional information.",
	"option.NoChatReports.showServerSafety.moreInfo": "§bClick here to read more about server safety levels",
	"option.NoChatReports.verifiedIconEnabled": "Verified icon enabled",
	"option.NoChatReports.verifiedIconEnabled.tooltip": "Allows the mod to display special icon in multiplayer menu for servers that have No Chat Reports or some other anti-chat-reporting measures installed.",
	"option.NoChatReports.verifiedIconOffsetX": "Verified icon X-offset",
	"option.NoChatReports.verifiedIconOffsetX.tooltip": "Defines X-axis offset for rendering of \"Safe Server\" icon.",
	"option.NoChatReports.verifiedIconOffsetY": "Verified icon Y-offset",
	"option.NoChatReports.verifiedIconOffsetY.tooltip": "Defines Y-axis offset for rendering of \"Safe Server\" icon.",
	"option.NoChatReports.hideRedChatIndicators": "Hide red chat indicators",
	"option.NoChatReports.hideRedChatIndicators.tooltip": "Prevents the client from displaying \"Not Secure\" indicators, in the form of red bar to the left and §c§l(§r§c!§c§l)§r icon to the right of chat message.",
	"option.NoChatReports.hideYellowChatIndicators": "Hide yellow chat indicators",
	"option.NoChatReports.hideYellowChatIndicators.tooltip": "Prevents the client from displaying \"Modified\" indicators, in the form of yellow bar to the left and §e§l(§r§e?§e§l)§r icon to the right of chat message.",
	"option.NoChatReports.hideGrayChatIndicators": "Hide gray chat indicators",
	"option.NoChatReports.hideGrayChatIndicators.tooltip": "Prevents the client from displaying special indicators for system messages, in the form of gray bar to the left.",
	"option.NoChatReports.hideWarningToast": "Hide warning toast",
	"option.NoChatReports.hideWarningToast.tooltip": "Removes a warning toast that is displayed when entering servers with disabled §oenforce-secure-profile§r.",
	"option.NoChatReports.alwaysHideReportButton": "Always hide report button",
	"option.NoChatReports.alwaysHideReportButton.tooltip": "Prevents the client from ever showing report button in Social Interactions screen. This is disabled by default, and mod simply makes button inactive on servers that have No Chat Reports installed, adding an explanation to the tooltip of the button.",

	"configuration.NoChatReports.category.technical": "Technical",
	
	"option.NoChatReports.demandOnServer": "Demand on server",
	"option.NoChatReports.demandOnServer.tooltip": "Prevents the client from joining servers that don't have No Chat Reports installed.",
	"option.NoChatReports.enableDebugLog": "Enable debug log",
	"option.NoChatReports.enableDebugLog.tooltip": "Enables logging of certain debug information. This is generally useless for non-developers.",
	"option.NoChatReports.disableTelemetry": "Disable telemetry",
	"option.NoChatReports.disableTelemetry.tooltip": "Allows the mod to disable built-in telemetry, similar to how No Telemetry does.",
	"option.NoChatReports.showReloadButton": "Show reload button",
	"option.NoChatReports.showReloadButton.tooltip": "Adds a button for config reloading to multiplayer menu.",
	"option.NoChatReports.whitelistAllServers": "Whitelist all servers",
	"option.NoChatReports.whitelistAllServers.tooltip": "Makes the mod behave as if all servers were added to §oWhitelisted Servers§r list.",
	"option.NoChatReports.showNCRButton": "Show NCR button",
	"option.NoChatReports.showNCRButton.tooltip": "Adds a button that toggles most of the mod's client-sided functionality to multiplayer menu.",
	"option.NoChatReports.enableMod": "Enable mod",
	"option.NoChatReports.enableMod.tooltip": "Responsible for enabling most of the mod's client-sided functionality, see option above.",
	"option.NoChatReports.reconnectAwaitSeconds": "Reconnect await seconds",
	"option.NoChatReports.reconnectAwaitSeconds.tooltip": "Number of seconds which client should wait before automatic reconnect once server rejects connection without chat signing key, assuming user agreed to enter unsafe server.",
	"option.NoChatReports.postDisconnectAwaitSeconds": "Post disconnect await seconds",
	"option.NoChatReports.postDisconnectAwaitSeconds.tooltip": "Similar to §oreconnectAwaitSeconds§r, but countdown starts as soon as player disconnects from the server normally. If this delay is greater than §oreconnectAwaitSeconds§r when they try to re-join the server - then it will apply instead.",
	"option.NoChatReports.signingCheckDelaySeconds": "Signing check delay seconds",
	"option.NoChatReports.signingCheckDelaySeconds.tooltip": "Delay for checking whether whitelisted servers still enforce chat signing, in seconds. Setting this to 0 will cause check to be performed on every login attempt, similar to non-whitelisted servers.",
	"option.NoChatReports.serverSigningChecks": "Server signing checks",
	"option.NoChatReports.serverSigningChecks.tooltip": "Map of whitelisted servers to last signing enforcement check times, in epoch seconds. This typically does not have to be edited manually.",
	"option.NoChatReports.showEncryptionButton": "Show encryption button",
	"option.NoChatReports.showEncryptionButton.tooltip": "Setting this to false will simply prevent encryption button from being displayed in the chat screen. Be aware that encryption itself will not be automatically disabled along with the button.",

	"configuration.NoChatReports.category.whitelistedServers": "Whitelisted Servers",

	"option.NoChatReports.whitelistedServers": "Whitelisted Servers",
	"option.NoChatReports.whitelistedServers.tooltip": "Contains servers for which \"Unsafe Server\" warning screen should never display. Servers are added to this list automatically when you check \"Do not show again for this server\" box in that screen.\nEach entry is a string that is formatted as §l<server-ip>:<port>§r.",
	"option.NoChatReports.whitelistedServers.addButtonTooltip": "Add server",
	"option.NoChatReports.whitelistedServers.removeButtonTooltip": "Remove selected server",
	"option.NoChatReports.whitelistedServers.instructions": "Click the + to add a server. Click the - to remove the selected server.",
	"option.NoChatReports.whitelistedServers.serverAddress": "Click here to edit server address",

	"configuration.NoChatReports.category.lanOptions": "LAN Options",

	"option.NoChatReports.demandOnClient": "Demand on client",
	"option.NoChatReports.demandOnClient.tooltip": "Makes the server require all joining clients to have No Chat Reports installed.",
	"option.NoChatReports.convertToGameMessage": "Convert to game message",
	"option.NoChatReports.convertToGameMessage.tooltip": "Makes the server convert all player messages into system messages. System messages don't have any signatures attached and cannot be reported; on unmodified clients they will display with gray bar to the left.",
	"option.NoChatReports.addQueryData": "Add query data",
	"option.NoChatReports.addQueryData.tooltip": "Allows the server to send additional data to client when handling pings. This is used for displaying \"Safe Server\" icon, as well as some other technical purposes."
}
