{
	"gui.nochatreport.secureChat": "This option cannot work with No Chat Reports, since there are no signatures to verify.",
	"gui.nochatreport.noReporting": "Chat reports are disabled on this server, courtesy of No Chat Reports.",
	"disconnect.nochatreports.client": "This server does not have No Chat Reports, and you have it configured to require itself on server.",
	"gui.nochatreports.status_secure": "This server has No Chat Reports installed, or prevents your messages from being reportable in some other known way. You can chat safely.",
	"gui.nochatreports.status_unintrusive": "This server does not prevent chat reports, but allows you to send unsigned messages which cannot be reported to Mojang. Vanilla clients will still send signed messages, display unsigned messages as \"Not Secure\" and not show them if \"Only Show Secure Chat\" is enabled in chat options.",
	"gui.nochatreports.status_insecure": "This server demands all chat messages to be signed and you agreed to proceed with this arrangement. Everything you send in the chat is potentially incriminating evidence that can be used against you in the report. You can manually remove this server from NoChatReports.json in your config folder to get warned again.",
	"gui.nochatreports.status_insecure_whitelist_all_servers": "This server demands all chat messages to be signed and you disabled the full-screen warning for it. Everything you send in the chat is potentially incriminating evidence that can be used against you in the report. You can disable \"whitelistAllServers\" from NoChatReports.json in your config folder to get warned again.",
	"gui.nochatreports.status_unknown": "No Chat Reports could not evaluate the safety of this server. This should never happen, please report it as a bug to the mod developer.",
	"gui.nochatreports.unsafe_server.header": "Caution: Unsafe Server",
	"gui.nochatreports.unsafe_server.contents": "This server requires all chat messages to be signed, which means they can be reported to Mojang, which may result in a ban from all multiplayer servers. This likely means that the server owner kept \"enforce-secure-profile\" enabled in the server.properties, which is the default since 1.19.1. You can choose to play anyway, but No Chat Reports will not be able to protect you.",
	"gui.nochatreports.unsafe_server.check": "Do not show again for this server",
	"gui.nochatrepords.reload_config_tooltip": "Reload No Chat Reports config. Use carefully."
}
