{
    "modmenu.descriptionTranslation.nochatreports": "Eemaldab mängijasõnumitelt krüptograafilised signatuurid, mis muudab võimatuks nii nende jälgimise ja seostamise sinu Mojangi/Microsofti kontoga kui ka mängija vestlusest teatamise funktsiooni.",
    "gui.nochatreport.secureChat": "See funktsioon ei saa töötada modiga No Chat Reports, kuna kinnitatavad signatuurid puuduvad.",
    "gui.nochatreport.noReporting": "Selles serveris on mängijast teatamine keelatud modi No Chat Reports olemasolu tõttu.",
    "disconnect.nochatreports.client": "Sellest serverist puudub mod No Chat Reports ning sinu seadistused nõuavad selle olemasolu serveris.",
    "gui.nochatreports.status_secure": "Sellele serverile on paigaldatud mod No Chat Reports või see piirab sinu sõnumitest teatamist mõnel muul teadaoleval viisil. Sa saad turvaliselt vestelda.",
    "gui.nochatreports.status_unintrusive": "See server ei piira sõnumitest teatamist, kuid võimaldab saata signeerimata sõnumeid, mida ei saa Mojangile teatada. Vanillikliendid saadavad siiski signeeritud sõnumeid, kuvavad signeerimata sõnumeid \"ebaturvalistena\" ning ei kuva neid üldse, kui vestlusseadetes on lubatud \"Vaid turvaline vestlus\".",
    "gui.nochatreports.status_insecure": "See server nõuab kõikide mängijasõnumite signeerimist ning sa nõustusid selle korraldusega. Kõik, mida vestlusesse saadad on potentsiaalselt süüdistav asitõend, mida saab raportis sinu vastu kasutada. Uuesti hoiatuse saamiseks võid selle modi seadistustes §olubamisloendis serverite§r nimekirjast eemaldada.",
    "gui.nochatreports.status_insecure_whitelist_all_servers": "See server nõuab kõikide mängijasõnumite signeerimist ning sa keelasid seda tähistava täisekraanis hoiatuse. Kõik, mida vestlusesse saadad on potentsiaalselt süüdistav asitõend, mida saab raportis sinu vastu kasutada. Uuesti hoiatuse saamiseks võid modi seadistustes keelata valiku §okõik serverid lubamisloendisse§r.",
    "gui.nochatreports.status_unknown": "No Chat Reports ei suutnud selle serveri turvalisust hinnata. Seda ei tohiks kunagi juhtuda, palun teata sellest veast modi arendajale.",
    "gui.nochatreports.unsafe_server.header": "Hoiatus: ebaturvaline server",
    "gui.nochatreports.unsafe_server.contents": "See server nõuab kõikide vestlussõnumite signeerimist, seega neid saab Mojangile raporteerida ning tagajärjeks võib olla blokeering kõigist mitmikmängu serveritest. See tõenäoliselt tähendab, et serveri omanik jättis failis server.properties valiku \"enforce-secure-profile\" lubatuks, mis on ka vaikeväärtus alates versioonist 1.19.1. Sa võid siiski seal mängida, kuid No Chat Reports ei saa sind kaitsta.",
    "gui.nochatreports.unsafe_server.check": "Ära kuva selle serveri puhul uuesti",
    "gui.nochatrepords.reload_config_tooltip": "Laadi No Chat Reports seadistus uuesti. Kasuta ettevaatlikult.",
    "gui.nochatreports.verified_server": "§a§lTurvaline server§r\nKinnitasime, et serverile on paigaldatud mod No Chat Reports või see piirab sõnumitest teatamist mõnel muul teadaoleval viisil.  Sa saad turvaliselt vestelda.",
    "gui.nochatreports.ncr_toggle_tooltip": "§lNo Chat Reports:§r %1$s\nKeela või luba enamus modi kliendipoolsest funktsionaalsusest. See võib olla vajalik teatud Paper/Velocity serveritega ühendumiseks, kuna need on teadaolevalt NCRiga probleeme põhjustanud.\nTeatud võrguga mitteseonduvad asjad, nagu serveri turvataseme kuvamine ning vanilli \"Vestlussõnumeid ei saa kinnitada\" hüpiku eemaldus töötavad siiski; neid saab seadistustes individuaalselt lülitada.",
    "gui.nochatreports.ncr_state_on": "§a§llubatud§r",
    "gui.nochatreports.ncr_state_off": "§c§lkeelatud§r",

    "configuration.NoChatReports.config": "No Chat Reports",

    "configuration.NoChatReports.category.visual": "Visuaalne",

    "option.NoChatReports.showServerSafety": "Kuva serveri turvatase",
    "option.NoChatReports.showServerSafety.tooltip": "Lubab mängul kuvada serveri turvataset vestluskuva paremal all nurgas. Kursoriga ikooni juurde liikudes kuvatakse täpsem kirjeldus.",
    "option.NoChatReports.showServerSafety.moreInfo": "§bKlõpsa siia, et lugeda serveri turvatasemete kohta",
    "option.NoChatReports.verifiedIconEnabled": "Kuva kinnitatuse ikoon",
    "option.NoChatReports.verifiedIconEnabled.tooltip": "Lubab modil kuvada mitmikmängumenüüs serverite juures ikooni, kui neil on No Chat Reports või mõni muu vestlusest teatamise vastane mehhanism paigaldatud.",
    "option.NoChatReports.verifiedIconOffsetX": "Kinnitatuse ikooni X-nihe",
    "option.NoChatReports.verifiedIconOffsetX.tooltip": "Määrab \"turvalise serveri\" ikooni renderdamise X-nihke.",
    "option.NoChatReports.verifiedIconOffsetY": "Kinnitatuse ikooni Y-nihe",
    "option.NoChatReports.verifiedIconOffsetY.tooltip": "Määrab \"turvalise serveri\" ikooni renderdamise Y-nihke.",
    "option.NoChatReports.hideRedChatIndicators": "Peida punased vestlusindikaatorid",
    "option.NoChatReports.hideRedChatIndicators.tooltip": "Keelab mängul kuvada \"ebaturvaline\" indikaatoreid vasakpoolse punase riba ning parempoolse §c§l(§r§c!§c§l)§r ikoonina vestlussõnumi kõrval.",
    "option.NoChatReports.hideYellowChatIndicators": "Peida kollased vestlusindikaatorid",
    "option.NoChatReports.hideYellowChatIndicators.tooltip": "Keelab mängul kuvada \"muudetud\" indikaatoreid vasakpoolse kollase riba ning parempoolse §e§l(§r§e?§e§l)§r ikoonina vestlussõnumi kõrval.",
    "option.NoChatReports.hideGrayChatIndicators": "Peida hallid vestlusindikaatorid",
    "option.NoChatReports.hideGrayChatIndicators.tooltip": "Keelab mängul kuvada spetsiaalseid süsteemisõnumite indikaatoreid vasakpoolse halli ribana.",
    "option.NoChatReports.hideWarningToast": "Peida hoiatushüpik",
    "option.NoChatReports.hideWarningToast.tooltip": "Peidab hoiatushüpiku, mida kuvatakse serverites, kus on valik §oenforce-secure-profile§r keelatud.",
    "option.NoChatReports.alwaysHideReportButton": "Peida teatamisnupp alati",
    "option.NoChatReports.alwaysHideReportButton.tooltip": "Keelab mängul suhtlustegevuste kuval teatamisnupu kuvamise täielikult. See on vaikimisi keelatud, selle asemel muudab mod No Chat Reports'iga serverites teatamisnupu halliks, lisades nupule kirjeldava vihjeteksti.",

    "configuration.NoChatReports.category.technical": "Tehniline",

    "option.NoChatReports.demandOnServer": "Nõua serveris",
    "option.NoChatReports.demandOnServer.tooltip": "Keelab mängul liitumast serveritesse, kus pole mod No Chat Reports paigaldatud.",
    "option.NoChatReports.enableDebugLog": "Luba silumislogi",
    "option.NoChatReports.enableDebugLog.tooltip": "Lubab teatud silumisteabe logimist. See on üldiselt mitte-arendajatele kasutu.",
    "option.NoChatReports.disableTelemetry": "Keela telemeetria",
    "option.NoChatReports.disableTelemetry.tooltip": "Lubab modil keelata sisse-ehitatud telemeetria, sarnaselt modile No Telemetry.",
    "option.NoChatReports.showReloadButton": "Kuva taaslaadimise nupp",
    "option.NoChatReports.showReloadButton.tooltip": "Lisab mitmikmängu serverite loendisse seadistuste taaslaadimise nupu.",
    "option.NoChatReports.whitelistAllServers": "Kõik serverid lubamisloendisse",
    "option.NoChatReports.whitelistAllServers.tooltip": "Sunnib modi käituma nii, nagu kõik serverid oleksid lisatud §olubamisloendis serverite§r loendisse.",
    "option.NoChatReports.showNCRButton": "Kuva NCRi nupp",
    "option.NoChatReports.showNCRButton.tooltip": "Lisab mitmikmängumenüüsse nupu, mis lülitab enamikku modi kliendipoolsest funktsionaalsusest.",
    "option.NoChatReports.enableMod": "Mod lubatud",
    "option.NoChatReports.enableMod.tooltip": "Vastutab enamiku modi kliendipoolse funktsionaalsuse eest, vaata ülalolevat valikut.",
    
    "configuration.NoChatReports.category.whitelistedServers": "Lubamisloendis serverid",

    "option.NoChatReports.whitelistedServers": "Lubamisloendis serverid",
    "option.NoChatReports.whitelistedServers.tooltip": "Sisaldab servereid, mille puhul \"ebaturvaline server\" hoiatuskuva ei kuvata. Serverid lisatakse siia loendisse automaatselt, kui märgid sellel kuval valiku \"Ära kuva selle serveri puhul uuesti\".\nIga kirje on §l<serveri-ip>:<port>§r vormistusega string.",
    "option.NoChatReports.whitelistedServers.addButtonTooltip": "Lisa server",
    "option.NoChatReports.whitelistedServers.removeButtonTooltip": "Eemalda server",
    "option.NoChatReports.whitelistedServers.instructions": "Serveri lisamiseks vajuta + nuppu. Valitud serveri eemaldamiseks vajuta - nuppu.",
    "option.NoChatReports.whitelistedServers.serverAddress": "Klõpsa siia serveri aadressi muutmiseks",

    "configuration.NoChatReports.category.lanOptions": "LAN-valikud",

    "option.NoChatReports.demandOnClient": "Nõua kliendilt",
    "option.NoChatReports.demandOnClient.tooltip": "Sunnib serverit kõigilt liituvatelt klientidelt nõudma No Chat Reports modi.",
    "option.NoChatReports.convertToGameMessage": "Konverteeri mängusõnumiks",
    "option.NoChatReports.convertToGameMessage.tooltip": "Sunnib serverit konverteerima kõik mängijasõnumid süsteemisõnumiteks. Süsteemisõnumitel pole signatuure ning neid ei saa teatada; vanilliklientidel kuvavad need vasakus servas halli riba.",
    "option.NoChatReports.addQueryData": "Lisa päringuandmeid",
    "option.NoChatReports.addQueryData.tooltip": "Lubab serveril saata pingide käsitlemisel kliendile täiendavaid andmeid. Seda kasutatakse \"turvalise serveri\" ikooni kuvamiseks, kui ka teisteks tehnilisteks eesmärkideks."
}
