{
    "algorithm.nochatreports.caesar": "§lCaesar§r\nMeemisalakirjoitus: käyttäessäsi tätä periaatteessa toivot ihmisten luovuttavan yrittämättä edes purkaa viestiesi salausta. Se voi olla totta monessa tapauksessa, joten tämän käyttökelpoisuus riippuu uhkakuvistasi.\nJoka merkille on luku välillä 1–1024. Kirjoittamasi merkki korvataan toisella merkillä tämän lukujärjestelmän avulla. Numerointia käytetään, koska aakkosjärjestys ei toimisi kaikkien kielien kanssa.",
    "algorithm.nochatreports.caesar.name": "Caesarin salakirjoitus",
    "chat.nochatreports.disabled.signing_requested": "Palvelin kieltäytyi välittämästä sähköisesti allekirjoittamatonta viestiä. Voit ottaa sähköisen allekirjoittamisen käyttöön ponnahdusikkunasta.",
    "configuration.NoChatReports.category.client": "Asiakasohjelma",
    "configuration.NoChatReports.category.lan": "Lähiverkko",
    "configuration.NoChatReports.config": "No Chat Reports",
    "disconnect.nochatreports.client": "Tällä palvelimella ei ole No Chat Reportsia ja olet määritellyt sen pakolliseksi pelaamillesi palvelimille.",
    "gui.NoChatReports.showEncryptionButtonWarning": "§cEi poista salausta käytöstä, ainoastaan piilottaa napin!",
    "gui.nochatreports.OLD_safety_status.secure": "Tällä palvelimella on No Chat Reports tai palvelin muuten estää lähettämiesi viestien ilmiannon. Voit keskustella turvallisesti.",
    "gui.nochatreports.OLD_safety_status.undefined": "No Chat Reports ei pystynyt arvioimaan palvelimen turvallisuutta. Tämän ei pitäisi ikinä tapahtua. Kerro tästä viasta modin kehittäjälle, kiitos.",
    "gui.nochatreports.OLD_status_insecure": "Tämä palvelin sallii vain sähköisesti allekirjoitetut viestit ja halusit jatkaa siitä huolimatta. Kaikkea keskusteluun kirjoittamaasi voidaan käyttää sinua vastaan todistusaineistona ilmiannettaessa. Voit manuaalisesti poistaa tämän palvelimen NoChatReports.json-asetustiedostosta, jos haluat, että sinua varoitetaan tulevaisuudessa uudelleen.",
    "gui.nochatreports.OLD_status_unintrusive": "Tämä palvelin ei estä viestien ilmiantoa, mutta antaa sinun lähettää sähköisesti allekirjoittamattomia viestejä, joita ei voi ilmiantaa Mojangille. Vanilla-asiakasohjelmat lähettävät silti allekirjoitettuja viestejä sekä näyttävät allekirjoittamattomat viestit \"ei-suojattuina\" eivätkä näytä niitä ollenkaan, jos \"Vain suojattu keskustelu\" on valittu keskusteluasetuksista.",
    "gui.nochatreports.OLD_unsafe_server.check": "Älä näytä uudelleen tällä palvelimella",
    "gui.nochatreports.OLD_unsafe_server.contents": "Tämä palvelin vaatii, että kaikki viestit ovat sähköisesti allekirjoitettuja, mikä tarkoittaa, että ne voidaan ilmoittaa Mojangille, mikä voi johtaa porttikieltoon kaikilta moninpelipalvelimilta. Palvelimen ylläpitäjä todennäköisesti pitää \"enforce-secure-profile\"-asetuksen käytössä palvelimen asetustiedostossa, mikä on oletus 1.19.1-versiosta lähtien. Voit pelata palvelimella silti, mutta No Chat Reports ei voi suojella sinua.",
    "gui.nochatreports.OLD_unsafe_server.header": "Varoitus: ei-turvallinen palvelin",
    "gui.nochatreports.encryption_config.algorithm": "Algoritmi: %1$s",
    "gui.nochatreports.encryption_config.default_key": "<oletus: %1$s>",
    "gui.nochatreports.encryption_config.dice_tooltip": "Luo uusi satunnainen avain, joka on yhteensopiva valitun salausalgoritmin kanssa.",
    "gui.nochatreports.encryption_config.encrypt_public": "Salaa julkiset viestit",
    "gui.nochatreports.encryption_config.header": "Salaamisen asetukset",
    "gui.nochatreports.encryption_config.key_desc": "§lSalausavain§r\nAvain, jota käytetään viestiesi salaukseen ja salauksen purkuun. Sen muoto riippuu algoritmista: AES:llä se on 128 bittiä Base64-koodattua binääridataa.",
    "gui.nochatreports.encryption_config.pass_not_allowed": "<ei tuettu>",
    "gui.nochatreports.encryption_config.passphrase_desc": "§lSalauksen tunnuslause§r\nSatunnaisen avaimen luomisen sijaan voit muodostaa sellaisen haluamastasi tunnuslauseesta. Jos käytät tätä – valitse vahva tunnuslause. Kaikki algoritmit eivät toimi tunnuslauseen kanssa.",
    "gui.nochatreports.encryption_config.validation_failed": "Avaimen vahvistaminen: §c§lEpäonnistui",
    "gui.nochatreports.encryption_config.validation_ok": "Avaimen vahvistaminen: §a§lOnnistui",
    "gui.nochatreports.encryption_state_off": "§c§lPois käytöstä§r",
    "gui.nochatreports.encryption_state_on": "§a§lKäytössä§r",
    "gui.nochatreports.encryption_tooltip": "§lSalaus:§r %1$s\nOikeaklikkaa määrittääksesi\n\nSalauksen ollessä käytössä, voit välttää salauksen käytön pitämällä §n§lCtrl§r-näppäintä pohjassa viestiä lähettäessäsi.",
    "gui.nochatreports.encryption_tooltip_invalid": "Salaus:§r %1$s\n§cKelvottomat määritykset. Klikkaa muuttaaksesi määrityksiä.",
    "gui.nochatreports.encryption_warning.check": "Älä näytä tätä uudelleen",
    "gui.nochatreports.encryption_warning.contents": "Voit salata viestisi käyttämällä salaista avainta. Vain he, jotka tietävät tämän avaimen, voivat purkaa salauksen. No Chat Reports purkaa salauksen kaikista viesteistä, kun sopiva avain annetaan ja ominaisuus on käytössä.\nHuomaa kuitenkin, että salaus ei ole taianomainen ratkaisu. Ulkopuolisille pelaajille salatut viestit näyttävät vain sekavalta sotkulta keskustelussa ja kolmannen osapuolen palvelimen valvojat voivat mykistää sinut tai antaa sinulle porttikiellon nähdessään viestisi. Suositellaan, että luot oman salausavaimen ja viestit toisille ihmisille vain turvallisilla kanavilla. Klikkaa \"Lue lisää\" saadaksesi lisätietoa siitä, miten ja milloin sinun pitäisi käyttää salaustoimintoa.",
    "gui.nochatreports.encryption_warning.header": "Tietoa salaamisesta",
    "gui.nochatreports.encryption_warning.learn_more": "Lue lisää",
    "gui.nochatreports.ncr_state_off": "§c§lPois käytöstä§r",
    "gui.nochatreports.ncr_state_on": "§a§lKäytössä§r",
    "gui.nochatreports.ncr_toggle_tooltip": "§lNo Chat Reports§r %1$s\nLaita suurin osa modin asiakasohjelman puoleisesta toiminnallisuudesta käyttöön tai pois käytöstä. Saatat joutua tekemään tämän liittyäksesi joillekin Paper- tai Velocity-palvelimille, sillä niiden tiedetään aiheuttavan ongelmia NCR:n kanssa.\nJotkin verkkotyöskentelyyn liittymättömät asiat, kuten salaus, keskustelun luotettavuustilan muokkaukset sekä \"Keskusteluviestejä ei voida todentaa\"-ilmoituksen poistaminen toimivat silti; ne voidaan laittaa pois määrityksistä yksitellen.",
    "gui.nochatreports.no_reporting": "Keskustelun ilmiantotoiminnon käyttö on mahdotonta tällä palvelimella, kiitos No Chat Reportsin.",
    "gui.nochatreports.realms_warning.check": "Älä näytä tätä uudelleen",
    "gui.nochatreports.realms_warning.contents": "Realms-palvelimet eivät ole yksityisiä. Realmin omistaja ei voi estää viestien ilmiantoa ja Mojang valvoo keskustelua ylimääräisin keinoin tunnistaakseen potentiaalisia \"verkkohaittoja\" ja välittääkseen ne ihmisen arvioitavaksi. Jos sinun todetaan rikkoneen Minecraftin yhteisöstandardeja, – vaikka keskustelun osapuolet eivät tästä loukkaantuneetkaan –, saat väliaikaisen tai pysyvän porttikiellon kaikkiin moninpeleihin. Viestien salaus on erittäin suositeltavaa.",
    "gui.nochatreports.realms_warning.header": "Varoitus: Realms",
    "gui.nochatreports.realms_warning.learn_more": "Lue lisää",
    "gui.nochatreports.reload_config_tooltip": "Lataa uudelleen No Chat Reportsin määritykset. Käytä harkiten.",
    "gui.nochatreports.safety_status.insecure_signing": "Olet ottanut käyttöön viestien sähköisen allekirjoittamisen, mikä tekee kaikista viesteistäsi mahdollista todistusaineistoa sinua vastaan ilmiannettaessa.",
    "gui.nochatreports.safety_status.singleplayer": "Voit aina keskustella turvallisesti yksinpelissä.",
    "gui.nochatreports.safety_status_button.controls": "Vasenklikkaa selataksesi sähköisen allekirjoittamisen käytön vaihtoehtoja.",
    "gui.nochatreports.safety_status_insecure": "Tämä palvelin vaatii kaikilta viesteiltä sähköisestä allekirjoitetusta. Kaikkia sähköisesti allekirjoitettuja viestejä voidaan käyttää sinua vastaan todistusaineistona ilmiannettaessa.",
    "gui.nochatreports.safety_status_realms": "Tämä on Realms-palvelin. Realmsissa ei voi estää viestien ilmiantoa ja täällä Mojangilla on lisäksi myös automaattista valvontaa potentiaalisten \"verkkohaittojen\" tunnistamiseksi ja niiden välittämiseksi ihmisen arvioitavaksi, halusipa Realmin omistaja sitä tai ei. Ainoa toivosi on keskustelun salaaminen.",
    "gui.nochatreports.safety_status_secure": "Tällä palvelimella on No Chat Reports tai palvelin estää lähettämiesi viestien ilmiannon muulla tunnetulla tavalla. Voit keskustella turvallisesti.",
    "gui.nochatreports.safety_status_undefined": "No Chat Reports ei pystynyt arvioimaan palvelimen turvallisuutta. Tämän ei pitäisi ikinä tapahtua. Ilmoita tästä viasta modin kehittäjälle, kiitos.",
    "gui.nochatreports.safety_status_unintrusive": "Tämä palvelin antaa sinun lähettää sähköisesti allekirjoittamattomia viestejä, joita ei voi ilmiantaa Mojangille. Jollei jokin palvelimella estä sitä – Vanilla-asiakasohjelmat lähettävät silti allekirjoitettuja viestejä sekä näyttävät allekirjoittamattomat viestit \"todentamattomina\" eivätkä näytä niitä ollenkaan, jos \"Vain suojattu keskustelu\" on valittu käyttäjän keskusteluasetuksista.",
    "gui.nochatreports.safety_status_unknown": "No Chat Reports ei ole vielä varma tämän palvelimen turvallisuudesta. Yritä lähettää viesti keskusteluun turvallisuuden arviointia varten.",
    "gui.nochatreports.secure_chat": "Tämä asetus ei toimi No Chat Reportsin kanssa, koska viesteissä ei ole sähköisiä allekirjoituksia.",
    "gui.nochatreports.signing_mode": "§lSähköinen allekirjoittaminen: %1$s",
    "gui.nochatreports.signing_mode.always": "Aina",
    "gui.nochatreports.signing_mode.always.tooltip": "Viestien sähköinen allekirjoittaminen on käytössä heti palvelimelle liittyessäsi, kuten Vanillassakin.",
    "gui.nochatreports.signing_mode.default": "Oletus (%1$s)",
    "gui.nochatreports.signing_mode.never": "Ei koskaan",
    "gui.nochatreports.signing_mode.never.tooltip": "Viestien sähköinen allekirjoittaminen ei ikinä ole käytössä ja palvelimen pyynnöt ottaa se käyttöön sivuutetaan.",
    "gui.nochatreports.signing_mode.never_forced": "Ei voi ottaa käyttöön",
    "gui.nochatreports.signing_mode.never_forced.tooltip": "Viestejäsi ei voi allekirjoittaa sähköisesti asiakasohjelman allekirjoitusavaimen saamisessa Mojangilta tapahtuneen ongelman tai käyttäjäsi vuoksi.",
    "gui.nochatreports.signing_mode.on_demand": "Vaadittaessa",
    "gui.nochatreports.signing_mode.on_demand.tooltip": "Sama kuin \"kysy\", mutta sähköinen allekirjoittaminen otetaan käyttöön automaattisesti ilman ponnahdusikkunan näyttämistä, kun palvelin vaatii sähköistä allekirjoittamista.",
    "gui.nochatreports.signing_mode.prompt": "Kysy",
    "gui.nochatreports.signing_mode.prompt.tooltip": "Sähköinen allekirjoitus on oletuksena pois käytöstä, mutta jos palvelin vaatii sähköistä allekirjoittamista, sinulle näytetään ponnahdusikkuna, jossa voit ottaa sähköisen allekirjoittamisen käyttöön yhdeksi istunnoksi kerrallaan.",
    "gui.nochatreports.signing_required.allow_signing": "Hyväksy",
    "gui.nochatreports.signing_required.cancel": "Peruuta",
    "gui.nochatreports.signing_required.check": "Älä näytä tätä uudelleen tällä istunnolla",
    "gui.nochatreports.signing_required.contents": "Tämä palvelin vaatii, että kaikki viestit ovat sähköisesti allekirjoitettuja. Tämä tarkoittaa, että ne voidaan ilmiantaa Mojangille, mikä voi johtaa porttikieltoon kaikilta moninpelipalvelimilta. Palvelimen ylläpitäjä todennäköisesti pitää \"enforce-secure-profile\"-asetuksen käytössä palvelimen asetustiedostossa, mikä on oletus 1.19.1-versiosta lähtien. Klikkaa \"Hyväksy\" ottaaksesi sähköisen allekirjoittamisen käyttöön täksi istunnoksi. Voit myös käyttää turvallisuustilapainiketta keskusteluikkunassa määritelläksesi allekirjoitusten käytön tällä palvelimella.",
    "gui.nochatreports.signing_required.header": "Varoitus: sähköinen allekirjoittaminen on pakollista",
    "gui.nochatreports.signing_status.allowed": "Viestien sähköinen allekirjoittaminen otettiin käyttöön täksi istunnoksi.",
    "gui.nochatreports.signing_status.allowed_session": "Viestien sähköinen allekirjoittaminen otettiin käyttöön täksi istunnoksi, mutta otetaan pois taas, kun liityt uudelleen.",
    "gui.nochatreports.signing_status.disabled": "Viestien sähköinen allekirjoittaminen otettiin pois käytöstä täksi istunnoksi.",
    "gui.nochatreports.signing_status.disabled_allowance_pending": "Viestien sähköinen allekirjoittaminen poistettiin käytöstä täksi istunnoksi, mutta otetaan käyttöön, kun lähetät viestin.",
    "gui.nochatreports.signing_status.disabled_offline": "Viestien sähköinen allekirjoittaminen on pois käytöstä, koska palvelin ei ole verkossa.",
    "gui.nochatreports.signing_status_allowed_realms": "Koska Realmsissa keskustelun sähköinen allekirjoittaminen on aina käytössä ja pakollista, sen estämisestä ei olisi mitään hyötyä.",
    "gui.nochatreports.verified_server": "§a§lTurvallinen palvelin\nPystymme varmistamaan, että tällä palvelimella on No Chat Reports tai se estää viestien ilmiannon muulla tunnetulla tavalla. Voit keskustella siellä turvallisesti.",
    "modmenu.descriptionTranslation.nochatreports": "Poistaa sähköiset allekirjoitukset pelaajan viesteistä, tehden niiden seuraamisesta ja Mojang-/Microsoft-käyttäjään yhdistämisestä sekä keskustelun ilmiantotoiminnon käytöstä mahdotonta.",
    "nochatreports.connect.await": "Odotetaan uudelleenyhdistämistä: %1$s s...",
    "nochatreports.connect.nokey_rejected": "Palvelin kieltäytyi yhteydestä ilman keskustelun sähköistä allekirjoitusavainta.",
    "option.NoChatReports.addQueryData.tooltip": "Palvelin lähettää ylimääräistä tietoa asiakasohjelmalle yhteyskokeilun yhteydessä. Tätä tarvitaan \"Turvallinen palvelin\"-kuvakkeen näyttämiseksi ja muihin teknisiin tarkoituksiin.",
    "option.NoChatReports.alwaysHideReportButton": "Piilota ilmiantopainike aina",
    "option.NoChatReports.alwaysHideReportButton.tooltip": "Estää asiakasohjelmaa näyttämästä ilmiantopainiketta Sosiaaliset kanssakäymiset -ruudussa. Tämä on oletuksena pois päältä ja modi tekee ilmiantopainikkeen passiiviseksi palvelimilla, joilla on No Chat Reports ja lisää selostuksen, joka tulee näkyville osoittimen siirtyessä painikkeen päälle.",
    "option.NoChatReports.convertToGameMessage": "Muuta järjestelmäviestiksi.",
    "option.NoChatReports.convertToGameMessage.tooltip": "Palvelin muuttaa kaikki pelaajien viestit järjestelmäviesteiksi. Järjestelmäviesteihin ei ole liitetty mitään sähköistä allekirjoitusta ja niitä ei voi ilmiantaa. Vanilla-asiakasohjelma näyttää harmaan palkin niiden vasemmalla puolella.",
    "option.NoChatReports.defaultSigningMode": "Sähköisen allekirjoittamisen oletusvalinta",
    "option.NoChatReports.defaultSigningMode.tooltip": "Asettaa oletusvalinnan sähköisestä allekirjoittamisesta palvelimilla, jotka pakottavat tai sallivat sähköisen allekirjoittamisen.",
    "option.NoChatReports.demandOnClient": "Vaadi asiakasohjelmalta",
    "option.NoChatReports.demandOnClient.tooltip": "Palvelin vaatii liittyviltä asiakasohjelmilta No Chat Reportsia.",
    "option.NoChatReports.demandOnClientMessage": "Potkimisviesti vaadittaessa No Chat Reportsia",
    "option.NoChatReports.demandOnClientMessage.tooltip": "Viesti, joka näytetään asiakasohjelmalle, kun se yrittää liittyä palvelimelle ilman No Chat Reportsia.",
    "option.NoChatReports.demandOnServer": "Vaadi palvelimelta",
    "option.NoChatReports.demandOnServer.tooltip": "Estää asiakasohjelmaa liittymästä palvelimille, joilla ei ole No Chat Reportsia.",
    "option.NoChatReports.enableDebugLog": "Luo vianetsintälokeja",
    "option.NoChatReports.enableDebugLog.tooltip": "Ottaa käyttöön tiettyjen virheenkorjaustietojen tallennuksen. Tämä on useimmiten tarpeetonta muille kuin kehittäjille.",
    "option.NoChatReports.enableMod": "Modin käyttö",
    "option.NoChatReports.enableMod.tooltip": "Pitää käytössä suurimman osan modin asiakasohjelman puoleisesta toiminnallisuudesta. Vaatii palvelimelle uudelleen liittymistä muutosten voimaan astumiseksi kesken istunnon.",
    "option.NoChatReports.hideInsecureMessageIndicators": "Piilota viestien vahvistamattomuutta symboloivat merkit",
    "option.NoChatReports.hideInsecureMessageIndicators.tooltip": "Estää asiakasohjelmaa näyttämästä vahvistamattomien viestien symbolia: harmaata palkkia keskusteluviestin vasemmalla puolella.",
    "option.NoChatReports.hideModifiedMessageIndicators": "Piilota viestien muokkausta symboloivat merkit",
    "option.NoChatReports.hideModifiedMessageIndicators.tooltip": "Estää asiakasohjelmaa näyttämästä muokattujen viestien symboleita: harmaata palkkia keskusteluviestin vasemmalla puolella ja §7§l(§r§e?§e§l)§r-merkkiä oikealla.",
    "option.NoChatReports.hideSigningRequestMessage": "Piilota sähköisen allekirjoittamisen pyyntö",
    "option.NoChatReports.hideSigningRequestMessage.tooltip": "Piilottaa keskusteluviestin, joka näytetään, kun palvelin pyytää asiakasohjelmaa allekirjoittamaan viestit sähköisesti.",
    "option.NoChatReports.hideSystemMessageIndicators": "Piilota järjestelmäviestiä symboloivat merkit",
    "option.NoChatReports.hideSystemMessageIndicators.tooltip": "Estää asiakasohjelmaa näyttämästä järjestelmäviestien symbolia: harmaata palkkia keskusteluviestin vasemmalla puolella.",
    "option.NoChatReports.hideWarningToast": "Piilota varoitusilmoitus",
    "option.NoChatReports.hideWarningToast.tooltip": "Poistaa ikkunan oikeaan ylänurkkaan tulevan varoituksen, joka näytetään palvelimilla, joilla §oenforce-secure-profile§r on pois päältä.",
    "option.NoChatReports.showEncryptionButton": "Näytä salauspainike",
    "option.NoChatReports.showEncryptionButton.tooltip": "Tämän pois käytöstä laittaminen yksinkertaisesti piilottaa salauspainikkeen keskusteluikkunasta. Huomaa, että salaus itsessään voi jäädä päälle, vaikka nappi piilotettaisiin.",
    "option.NoChatReports.showEncryptionIndicators": "Näytä salausta symboloivat merkit",
    "option.NoChatReports.showEncryptionIndicators.tooltip": "Laittaa salausta symboloivat merkit (purppuran palkin viestin vasemmalla puolelta ja §5§l(§r§5ȯ§5§l)§r)-merkin oikealta) näkyviin tai piiloon.",
    "option.NoChatReports.showNCRButton": "Näytä NCR-painike",
    "option.NoChatReports.showNCRButton.tooltip": "Lisää moninpelivalikkoon painikkeen, jolla voidaan valita suurin osa modin asiakasohjelman puoleisesta toiminnallisuudesta päälle ja pois.",
    "option.NoChatReports.showReloadButton": "Näytä uudelleenlatauspainike",
    "option.NoChatReports.showReloadButton.tooltip": "Lisää moninpelivalikkoon painikkeen määritysten uudelleenlataamiselle.",
    "option.NoChatReports.showServerSafety": "Näytä palvelimen turvallisuus",
    "option.NoChatReports.showServerSafety.moreInfo": "§bKlikkaa tästä lukeaksesi lisää palvelimen turvallisuustasoista.",
    "option.NoChatReports.showServerSafety.tooltip": "Asiakasohjelma näyttää palvelimen turvallisuustilan keskusteluikkunan oikeassa alanurkassa. Osoittimen vieminen kuvakkeen päälle näyttää lisätietoja.",
    "option.NoChatReports.verifiedIconEnabled": "Vahvistuskuvake päällä",
    "option.NoChatReports.verifiedIconEnabled.tooltip": "Erityinen kuvake näytetään moninpelivalikossa palvelimilla, joilla on No Chat Reports tai joka muuten ehkäisee ilmiantojen tekemistä.",
    "option.NoChatReports.verifiedIconOffsetX": "Vahvistuskuvakkeen siirto X-akselilla",
    "option.NoChatReports.verifiedIconOffsetX.tooltip": "Määrittelee \"Turvallinen palvelin\" -kuvakkeen siirron X-akselilla.",
    "option.NoChatReports.verifiedIconOffsetY": "Vahvistuskuvakkeen siirto Y-akselilla",
    "option.NoChatReports.verifiedIconOffsetY.tooltip": "Määrittelee \"Turvallinen palvelin\" -kuvakkeen siirron Y-akselilla.",
    "tag.nochatreports.encrypted": "Salattu käyttämällä: %1$s",
    "tag.nochatreports.encrypted_original": "Salaamaton: %1$s"
}
