{
	"modmenu.descriptionTranslation.nochatreports": "Rimuove le firme digitali dai messaggi che invii, rendendo impossibile tracciarli e associarli al tuo account Mojang/Microsoft e impedendone dunque la segnalazione.",
	"gui.nochatreport.secureChat": "Questa opzione non può funzionare con No Chat Reports, dal momento che non ci sono firme da verificare.",
	"gui.nochatreport.noReporting": "Le segnalazioni della chat sono state disabilitate su questo server grazie a No Chat Reports.",
	"disconnect.nochatreports.client": "Questo server non ha No Chat Reports e tu hai configurato No Chat Reports in modo che richieda di essere installato anche sul server.",
	"gui.nochatreports.status_secure": "Questo server ha installato No Chat Reports o impedisce ai tuoi messaggi di essere segnalati con qualche altro metodo noto. Puoi messaggiare in sicurezza.",
	"gui.nochatreports.status_unintrusive": "Questo server ti permette di inviare messaggi non firmati che non possono essere segnalati a Mojang. I client vanilla invieranno comumque messaggi firmati, mostreranno i messaggi non firmati come \"Non sicuri\" e li nasconderanno se l'opzione \"Mostra solo chat sicura\" è attiva nelle opzioni della chat.",
	"gui.nochatreports.status_insecure": "Questo server richiede che tutti i messaggi della chat siano firmati e tu hai acconsentito a continuare in queste circostanze. Qualunque cosa invierai in chat sarà una prova potenzialmente incriminante che potrà essere usata contro di te in una segnalazione. Se vuoi essere avvertito di nuovo, puoi rimuovere questo server dalla §owhitelist dei server§r nelle opzioni di configurazione della mod.",
	"gui.nochatreports.status_insecure_whitelist_all_servers": "Questo server richiede che tutti i messaggi della chat siano firmati e tu hai disattivato la relativa schermata di avvertimento. Qualunque cosa invierai in chat sarà una prova potenzialmente incriminante che potrà essere usata contro di te in una segnalazione. Se vuoi essere avvertito di nuovo, puoi disattivare l'opzione §oAggiungi tutti i server alla whitelist§r nelle opzioni di configurazione della mod.",
	"gui.nochatreports.status_unknown": "No Chat Reports non è stato in grado di valutare la sicurezza di questo server. Ciò non dovrebbe mai accadere: ti preghiamo di segnalarlo come un bug allo sviluppatore della mod.",
	"gui.nochatreports.unsafe_server.header": "Attenzione: server non sicuro",
	"gui.nochatreports.unsafe_server.contents": "Questo server richiede che tutti i messaggi della chat siano firmati, il che significa che possono essere segnalati a Mojang, il che può comportare un ban da tutti i server multigiocatore. Probabilmente questo significa che il proprietario del server ha lasciato l'opzione \"enforce-secure-profile\" attiva nel file server.properties (dalla 1.19.1 lo è per impostazione predefinita). Puoi decidere di giocarci comunque, ma No Chat Reports non sarà in grado di proteggerti.",
	"gui.nochatreports.unsafe_server.check": "Non mostrare di nuovo per questo server",
	"gui.nochatrepords.reload_config_tooltip": "Ricarica file di configurazione di No Chat Reports. Da usare con cautela.",
	"gui.nochatreports.verified_server": "§a§lServer sicuro§r\nSiamo stati in grado di verificare che questo server ha installato No Chat Reports o impedisce la segnalazione della chat con qualche altro metodo noto. Qui puoi messaggiare in sicurezza.",
	
	"configuration.NoChatReports.config": "No Chat Reports",
	
	"configuration.NoChatReports.category.visual": "Aspetto",
	
	"option.NoChatReports.showServerSafety": "Mostra stato di sicurezza del server",
	"option.NoChatReports.showServerSafety.tooltip": "Permette al client di mostrare lo stato di sicurezza del server nell'angolo in basso a destra della schermata della chat. Puoi passare il mouse sull'icona per ottenere informazioni aggiuntive.",
	"option.NoChatReports.showServerSafety.moreInfo": "§bClicca qui per maggiori informazioni sui livelli di sicurezza dei server",
	"option.NoChatReports.verifiedIconEnabled": "Abilita icona di verifica",
	"option.NoChatReports.verifiedIconEnabled.tooltip": "Permette alla mod di mostrare un'icona speciale nel menù \"Gioca in multigiocatore\" per i server che hanno installato No Chat Reports o qualche altra misura anti-segnalazione.",
	"option.NoChatReports.verifiedIconOffsetX": "Scostamento x dell'icona di verifica",
	"option.NoChatReports.verifiedIconOffsetX.tooltip": "Definisce lo scostamento sull'asse x dell'icona \"Server sicuro\".",
	"option.NoChatReports.verifiedIconOffsetY": "Scostamento y dell'icona di verifica",
	"option.NoChatReports.verifiedIconOffsetY.tooltip": "Definisce lo scostamento sull'asse y dell'icona \"Server sicuro\".",
	"option.NoChatReports.hideRedChatIndicators": "Nascondi gli indicatori della chat rossi",
	"option.NoChatReports.hideRedChatIndicators.tooltip": "Impedisce al client di mostrare avvertimenti del tipo \"Questo messaggio non è sicuro\", che consistono in una barra rossa a sinistra del messaggio e un'icona \"§c§l(§r§c!§c§l)§r\" a destra.",
	"option.NoChatReports.hideYellowChatIndicators": "Nascondi gli indicatori della chat gialli",
	"option.NoChatReports.hideYellowChatIndicators.tooltip": "Impedisce al client di mostrare avvertimenti del tipo \"Questo messaggio è stato modificato\", che consistono in una barra gialla a sinistra del messaggio e un'icona \"§e§l(§r§e?§e§l)§r\" a destra.",
	"option.NoChatReports.hideGrayChatIndicators": "Nascondi gli indicatori della chat grigi",
	"option.NoChatReports.hideGrayChatIndicators.tooltip": "Impedisce al client di mostrare indicatori speciali per i messaggi di sistema, che consistono in una barra grigia a sinistra del messaggio.",
	"option.NoChatReports.hideWarningToast": "Nascondi l'avviso popup",
	"option.NoChatReports.hideWarningToast.tooltip": "Rimuove l'avviso popup che viene mostrato quando si entra in server con l'opzione §oenforce-secure-profile§r disattivata.",
	"option.NoChatReports.alwaysHideReportButton": "Nascondi il pulsante di segnalazione",
	"option.NoChatReports.alwaysHideReportButton.tooltip": "Impedisce al client di mostrare il pulsante di segnalazione nella schermata \"Interazioni sociali\". Questa opzione è inattiva per impostazione predefinita e la mod semplicemente rende il pulsante inattivo sui server dove la segnalazione della chat è stata disattivata, con una spiegazione nel tooltip del pulsante.",
	
	"configuration.NoChatReports.category.technical": "Avanzate",
	
	"option.NoChatReports.demandOnServer": "Richiedi la mod sui server",
	"option.NoChatReports.demandOnServer.tooltip": "Impedisce al client di entrare nei server che non hanno installato No Chat Reports.",
	"option.NoChatReports.enableDebugLog": "Attiva il log di debug",
	"option.NoChatReports.enableDebugLog.tooltip": "Attiva la registrazione nel log di certe informazioni di debug.\nIn genere, questa opzione è inutile per chi non è uno sviluppatore.",
	"option.NoChatReports.disableTelemetry": "Disattiva telemetria",
	"option.NoChatReports.disableTelemetry.tooltip": "Permette alla mod di disattivare la telemetria incorporata di Minecraft, in modo simile alla mod No Telemetry.",
	"option.NoChatReports.showReloadButton": "Mostra il pulsante di ricaricamento",
	"option.NoChatReports.showReloadButton.tooltip": "Aggiunge al menù \"Gioca in multigiocatore\" un pulsante per ricaricare i file di configurazione.",
	"option.NoChatReports.whitelistAllServers": "Aggiungi tutti i server alla whitelist",
	"option.NoChatReports.whitelistAllServers.tooltip": "Fa sì che la mod si comporti come se tutti i server fossero stati aggiunti alla §owhitelist dei server§r.",
	
	"configuration.NoChatReports.category.whitelistedServers": "Whitelist dei server",
	
	"option.NoChatReports.whitelistedServers": "Server nella whitelist",
	"option.NoChatReports.whitelistedServers.tooltip": "Contiene i server per i quali la schermata di avvertimento \"Attenzione: server non sicuro\" non dev'essere mostrata. I server a cui ti unisci vengono aggiunti automaticamente a questa lista quando selezioni la casella di controllo \"Non mostrare di nuovo per questo server\" nella schermata in questione. Ciascuna voce è una stringa che segue il seguente formato: §l<ip-del-server>:<porta>§r.",
	"option.NoChatReports.whitelistedServers.addButtonTooltip": "Aggiungi server",
	"option.NoChatReports.whitelistedServers.removeButtonTooltip": "Rimuovi server selezionato",
	"option.NoChatReports.whitelistedServers.instructions": "Clicca il simbolo \"+\" per aggiungere un server. Clicca il simbolo \"-\" per rimuovere il server selezionato.",
	"option.NoChatReports.whitelistedServers.serverAddress": "Clicca qui per modificare l'indirizzo del server",
	
	"configuration.NoChatReports.category.lanOptions": "Opzioni LAN",
	
	"option.NoChatReports.demandOnClient": "Richiedi su client",
	"option.NoChatReports.demandOnClient.tooltip": "Fa sì che il server richieda di aver installato No Chat Reports a tutti i client che vogliono entrarvi.",
	"option.NoChatReports.convertToGameMessage": "Converti in messaggio del gioco",
	"option.NoChatReports.convertToGameMessage.tooltip": "Fa sì che il server converta tutti i messaggi dei giocatori in messaggi di sistema. I messaggi di sistema non sono firmati e non possono essere segnalati; sui client non moddati, verranno mostrati con una barra grigia a sinistra.",
	"option.NoChatReports.addQueryData": "Aggiungi dati in risposta alle query",
	"option.NoChatReports.addQueryData.tooltip": "Permette al server di inviare dati aggiuntivi al client durante la gestione dei ping al fine di mostrare l'icona \"Server sicuro\" e per altri fini tecnici."
}
