{
    "algorithm.nochatreports.aes_cfb8_base64": "§lAES/CFB8+Base64R§r\nAlgoritmo standard di cifratura a chiave simmetrica. Usa chiavi a 128 bit. Il messaggio cifrato viene codificato in una versione speciale di Base64 per permetterne la trasmissione tramite la chat di Minecraft. Uno svantaggio è che la lunghezza dei messaggi aumenterà all'incirca del 30% e i server potrebbero troncarli se superano la dimensione massima.",
    "algorithm.nochatreports.aes_cfb8_base64.name": "AES/CFB8+Base64R",
    "algorithm.nochatreports.aes_ecb_base64": "§lAES/ECB+Base64R§r\nÈ decisamente meno sicuro dell'algoritmo che usa la modalità CFB ma, siccome non richiede un vettore di inizializzazione, ti risparmia qualche byte. Sempre meglio del cifrario di Cesare.",
    "algorithm.nochatreports.aes_ecb_base64.name": "AES/ECB+Base64R",
    "algorithm.nochatreports.aes_gcm_base64": "§lAES/GCM+Base64R§r\nUna maggiore sicurezza in cambio di un imponente aumento delle dimensioni del messaggio (12 byte per il vettore di inizializzazione e altri 12 per i dati di autenticazione, il tutto codificato in Base64). L'opzione migliore se per te la sicurezza viene prima di tutto.",
    "algorithm.nochatreports.aes_gcm_base64.name": "AES/GCM+Base64R",
    "algorithm.nochatreports.caesar": "§lCifrario di Cesare§r\nAggiunto per il meme. Se usi questo cifrario, stai praticamente sperando che chiunque veda il messaggio si arrenda senza nemmeno provare a decifrarlo. In alcuni casi potrebbe essere così, per cui decidi se usarlo o meno a seconda dei rischi in cui puoi incorrere.\nLa chiave può essere un numero intero da 1 to 1024. Lo scorrimento viene effettuato su tutti i caratteri Unicode e non su un alfabeto in particolare, in modo da garantire la compatibilità di questo sistema con qualsiasi lingua.",
    "algorithm.nochatreports.caesar.name": "Cifrario di Cesare",
    "chat.nochatreports.disabled.signing_requested": "Il server ha rifiutato l'invio del messaggio non firmato. Puoi attivare la firma dei messaggi cambiando la modalità di firma o tramite la schermata di avviso.",
    "configuration.NoChatReports.category.client": "Client",
    "configuration.NoChatReports.category.lan": "LAN",
    "configuration.NoChatReports.config": "No Chat Reports",
    "disconnect.nochatreports.client": "Questo server non ha No Chat Reports e tu hai configurato No Chat Reports in modo che richieda di essere installato anche sul server.",
    "gui.NoChatReports.showEncryptionButtonWarning": "§cL'opzione seguente non disattiva la crittografia, nasconde solo il pulsante!",
    "gui.nochatreports.encryption_config.algorithm": "Algoritmo: %1$s",
    "gui.nochatreports.encryption_config.default_key": "<predefinita: %1$s>",
    "gui.nochatreports.encryption_config.dice_tooltip": "Genera una nuova chiave casuale a seconda dell'algoritmo di crittografia selezionato.",
    "gui.nochatreports.encryption_config.encrypt_public": "Invia messaggi pubblici cifrati",
    "gui.nochatreports.encryption_config.header": "Impostazioni di crittografia",
    "gui.nochatreports.encryption_config.key_desc": "§lChiave di crittografia§r\nChiava usata per cifrare e decifrare i tuoi messaggi. Il suo formato dipende dall'algoritmo: per l'AES sarà 128 bit di dati binari codificati in Base64.",
    "gui.nochatreports.encryption_config.pass_not_allowed": "<non supportata>",
    "gui.nochatreports.encryption_config.passphrase_desc": "§lPassword di crittografia§r\nInvece di generare una chiave casuale, puoi derivarne una da una password a tua scelta. Se decidi di usare una password, scegline una robusta. Non tutti gli algoritmi di crittografia supportano l'uso di una password.",
    "gui.nochatreports.encryption_config.validation_failed": "Convalida della chiave: §c§lNon riuscita",
    "gui.nochatreports.encryption_config.validation_ok": "Convalida della chiave: §a§lRiuscita",
    "gui.nochatreports.encryption_state_off": "§c§lNo§r",
    "gui.nochatreports.encryption_state_on": "§a§lSì§r",
    "gui.nochatreports.encryption_tooltip": "§lCrittografia:§r %1$s\nFai clic con il tasto destro per configurare.\n\nSe la crittografia è attiva, puoi impedire che venga applicata al messaggio tenendo premuto il tasto §n§lCtrl§r quando lo invii.",
    "gui.nochatreports.encryption_tooltip_invalid": "§lCrittografia:§r %1$s\n§cConfigurazione non valida. Fai clic per configurare.",
    "gui.nochatreports.encryption_warning.check": "Non mostrare più",
    "gui.nochatreports.encryption_warning.contents": "Puoi cifrare i tuoi messaggi usando una chiave segreta. Solo le persone a conoscenza di questa chiave saranno in grado di decifrarli. No Chat Reports decifra automaticamente tutti i messaggi cifrati se viene fornita la giusta chiave e la funzionalità in questione è attiva.\nTuttavia, tieni a mente che la crittografia non è una \"formula magica\" che risolve tutto. I moderatori dei server di terze parti possono silenziarti o bannarti se invii in chat quello che loro vedranno come nient'altro che una serie di lettere senza senso. Inoltre, si consiglia di generare chiavi personalizzate e di comunicarle con altre persone solo attraverso canali sicuri. Per maggiori informazioni su come e quando sia opportuno cifrare i messaggi, fai clic su \"Scopri di più\".",
    "gui.nochatreports.encryption_warning.header": "Informazioni sulla crittografia",
    "gui.nochatreports.encryption_warning.learn_more": "Scopri di più",
    "gui.nochatreports.ncr_state_off": "§c§lNo§r",
    "gui.nochatreports.ncr_state_on": "§a§lSì§r",
    "gui.nochatreports.ncr_toggle_tooltip": "§lNo Chat Reports:§r %1$s\nAttiva o disattiva la maggior parte delle funzionalità su lato client della mod. Potrebbe essere necessario per entrare in alcuni server su Paper/Velocity, che sono noti per avere problemi con No Chat Reports.\nAlcune cose che non sono relative al collegamento online, come la crittografia, le icone di sicurezza della chat e la rimozione dell'avviso popup \"I messaggi in chat non possono essere verificati\" continueranno a funzionare, ma possono essere disattivate separatamente nel menù di configurazione.",
    "gui.nochatreports.no_reporting": "Le segnalazioni della chat sono state disabilitate su questo server grazie a No Chat Reports.",
    "gui.nochatreports.realms_warning.check": "Non mostrare più",
    "gui.nochatreports.realms_warning.contents": "I server di Realms non sono privati. I proprietari dei realm non possono disattivare la segnalazione della chat e Mojang pratica un monitoraggio aggiuntivo sulle chat per identificare possibili \"pericoli online\" e riferirli a moderatori umani. A quel punto, se viene stabilito che hai violato gli Standard della community, a prescindere dal fatto che i partecipanti alla chat siano stati o meno offesi, sarai bannato, temporaneamente o permanentemente, da tutti i servizi multigiocatore. Si consiglia l'utilizzo della crittografia.",
    "gui.nochatreports.realms_warning.header": "Attenzione: Realms",
    "gui.nochatreports.realms_warning.learn_more": "Scopri di più",
    "gui.nochatreports.reload_config_tooltip": "Ricarica il file di configurazione di No Chat Reports. Da usare con cautela.",
    "gui.nochatreports.safety_status.insecure": "Attualmente questo server richiede che tutti i messaggi in chat siano firmati. Tutti i messaggi firmati sono prove potenzialmente incriminanti che possono essere usate contro di te in una segnalazione.",
    "gui.nochatreports.safety_status.insecure_signing": "Hai attivato la firma dei messaggi, il che rende tutti i tuoi messaggi delle prove potenzialmente incriminanti che possono essere usate contro di te in una segnalazione.",
    "gui.nochatreports.safety_status.realms": "Questo server è un realm. In questo server non solo è impossibile impedire la segnalazione della chat, ma Mojang si serve anche di un sistema automatico di monitoraggio per identificare possibili \"pericoli online\" e riferirli a moderatori umani per la revisione, anche se il proprietario del server non vuole. La tua unica speranza è la crittografia.",
    "gui.nochatreports.safety_status.secure": "Questo server ha installato No Chat Reports o impedisce ai tuoi messaggi di essere segnalati con qualche altro metodo noto. Puoi messaggiare in sicurezza.",
    "gui.nochatreports.safety_status.singleplayer": "Puoi sempre messaggiare in sicurezza nei mondi in giocatore singolo.",
    "gui.nochatreports.safety_status.undefined": "Non è stato possibile per No Chat Reports valutare la sicurezza di questo server. Questo non dovrebbe mai accadere: ti preghiamo di segnalarlo come un bug allo sviluppatore della mod.",
    "gui.nochatreports.safety_status.unintrusive": "Questo server ti permette di inviare messaggi non firmati che non possono essere segnalati a Mojang. A meno che sul server non sia stato installato qualche plug-in che impedisca la segnalazione della chat, i client non moddati invieranno comumque messaggi firmati, mostreranno i messaggi non firmati come \"Non sicuri\" e li nasconderanno se l'opzione \"Mostra solo chat sicura\" è attiva nelle opzioni della chat.",
    "gui.nochatreports.safety_status.unknown": "No Chat Reports non è in grado di determinare la sicurezza di questo server. Prova a inviare un messaggio per eseguire una valutazione.",
    "gui.nochatreports.safety_status_button.controls": "Fai clic con il tasto sinistro per cambiare modalità dì firma.",
    "gui.nochatreports.secure_chat": "Questa opzione non può funzionare con No Chat Reports, dal momento che non ci sono firme da verificare.",
    "gui.nochatreports.signing_mode": "§lModalità di firma: %1$s",
    "gui.nochatreports.signing_mode.always": "Firma sempre",
    "gui.nochatreports.signing_mode.always.tooltip": "Questa modalità attiva automaticamente la firma dei messaggi non appena entri in un server, esattamente come i client non moddati.",
    "gui.nochatreports.signing_mode.default": "Predefinita (%1$s)",
    "gui.nochatreports.signing_mode.never": "Non firmare mai",
    "gui.nochatreports.signing_mode.never.tooltip": "In questa modalità i messaggi non vengono mai firmati e tutte le richieste di firma da parte del server vengono ignorate.",
    "gui.nochatreports.signing_mode.never_forced": "Impossibile firmare i messaggi",
    "gui.nochatreports.signing_mode.never_forced.tooltip": "Questa modalità indica che i tuoi messaggi non possono essere firmati, o perché stai usando un account offline o perché il client non è riuscito a recuperare le tue chiavi per la firma dei messaggi dai servizi di Mojang.",
    "gui.nochatreports.signing_mode.on_demand": "Su richiesta",
    "gui.nochatreports.signing_mode.on_demand.tooltip": "Simile alla modalità \"Chiedi conferma\", ma la firma dei messaggi viene attivata non appena il server lo richiede, senza mostrare una schermata di avviso.",
    "gui.nochatreports.signing_mode.prompt": "Chiedi conferma",
    "gui.nochatreports.signing_mode.prompt.tooltip": "In questa modalità i messaggi normalmente non vengono firmati, ma se il server richiede la firma dei messaggi ti verrà mostrata una schermata di avviso in cui potrai attivare la firma dei messaggi per una sessione.",
    "gui.nochatreports.signing_required.allow_signing": "Firma i messaggi",
    "gui.nochatreports.signing_required.cancel": "Ignora",
    "gui.nochatreports.signing_required.check": "Non mostrare più per questa sessione",
    "gui.nochatreports.signing_required.contents": "Questo server richiede che tutti i messaggi della chat siano firmati, il che significa che possono essere segnalati a Mojang, il che può comportare un ban da tutti i server multigiocatore. Probabilmente questo significa che il proprietario del server ha lasciato l'opzione \"enforce-secure-profile\" attiva nel file server.properties (dalla 1.19.1 lo è per impostazione predefinita).\n\nClicca su \"Firma i messaggi\" per attivare la firma dei messaggi durante questa sessione. Puoi usare anche il pulsante dello stato di sicurezza nella schermata della chat per selezionare la modalità di firma per questo server.",
    "gui.nochatreports.signing_required.header": "Attenzione: è richiesta la firma dei messaggi",
    "gui.nochatreports.signing_status.allowed": "La firma dei messaggi è stata attivata per questa sessione.",
    "gui.nochatreports.signing_status.allowed_realms": "La firma dei messaggi è sempre attiva quando giochi nei Realm perché è sempre obbligatoria e comunque disattivarla non sarebbe utile.",
    "gui.nochatreports.signing_status.allowed_session": "La firma dei messaggi è stata attivata per questa sessione, ma verrà disattivata la prossima volta che entrerai nel server.",
    "gui.nochatreports.signing_status.disabled": "La firma dei messaggi è stata disattivata per questa sessione.",
    "gui.nochatreports.signing_status.disabled_allowance_pending": "La firma dei messaggi è stata disattivata per questa sessione, ma verrà attivata non appena invierai un messaggio.",
    "gui.nochatreports.signing_status.disabled_offline": "La firma dei messaggi non è attiva perché questo server è in modalità offline.",
    "gui.nochatreports.verified_server": "§a§lServer sicuro§r\nSiamo stati in grado di verificare che questo server ha installato No Chat Reports o impedisce la segnalazione della chat con qualche altro metodo noto. Qui puoi messaggiare in sicurezza.",
    "modmenu.descriptionTranslation.nochatreports": "Rimuove le firme digitali dai messaggi che invii, rendendo impossibile tracciarli e associarli al tuo account Mojang/Microsoft e impedendone dunque la segnalazione.",
    "nochatreports.connect.await": "In attesa di riconnessione: %1$s secondi...",
    "nochatreports.connect.nokey_rejected": "Il server ha rifiutato la connessione senza le chiavi per la firma dei messaggi.",
    "option.NoChatReports.addQueryData": "Aggiungi dati in risposta alle query",
    "option.NoChatReports.addQueryData.tooltip": "Permette al server di inviare dati aggiuntivi al client durante la gestione dei ping al fine di mostrare l'icona \"Server sicuro\" e per altri fini tecnici.",
    "option.NoChatReports.alwaysHideReportButton": "Nascondi il pulsante di segnalazione",
    "option.NoChatReports.alwaysHideReportButton.tooltip": "Impedisce al client di mostrare il pulsante di segnalazione nella schermata \"Interazioni sociali\". Questa opzione è inattiva per impostazione predefinita e la mod semplicemente rende il pulsante inattivo sui server dove la segnalazione della chat è stata disattivata, con una spiegazione nel tooltip del pulsante.",
    "option.NoChatReports.convertToGameMessage": "Converti in messaggio del gioco",
    "option.NoChatReports.convertToGameMessage.tooltip": "Fa sì che il server converta tutti i messaggi dei giocatori in messaggi di sistema. I messaggi di sistema non sono firmati e non possono essere segnalati; sui client non moddati, verranno mostrati con una barra grigia a sinistra.",
    "option.NoChatReports.defaultSigningMode": "Modalità di firma predefinita",
    "option.NoChatReports.defaultSigningMode.tooltip": "Imposta la modalità di firma predefinita per i server che impongono o che permettono la firma dei messaggi.",
    "option.NoChatReports.demandOnClient": "Richiedi la mod sui client",
    "option.NoChatReports.demandOnClient.tooltip": "Fa sì che il server richieda di aver installato No Chat Reports a tutti i client che vogliono entrarvi.",
    "option.NoChatReports.demandOnClientMessage": "Messaggio di espulsione per client senza la mod",
    "option.NoChatReports.demandOnClientMessage.tooltip": "Il messaggio che viene mostrato al client se cerca di entrare nel server senza aver installato No Chat Reports.",
    "option.NoChatReports.demandOnServer": "Richiedi la mod sui server",
    "option.NoChatReports.demandOnServer.tooltip": "Impedisce al client di entrare nei server che non hanno installato No Chat Reports.",
    "option.NoChatReports.disableTelemetry": "Disattiva telemetria",
    "option.NoChatReports.disableTelemetry.tooltip": "Permette alla mod di disattivare la telemetria incorporata di Minecraft, in modo simile alla mod No Telemetry.",
    "option.NoChatReports.enableDebugLog": "Attiva il log di debug",
    "option.NoChatReports.enableDebugLog.tooltip": "Attiva la registrazione nel log di certe informazioni di debug.\nIn genere, questa opzione è inutile per chi non è uno sviluppatore.",
    "option.NoChatReports.enableMod": "Attiva la mod",
    "option.NoChatReports.enableMod.tooltip": "Attiva o disattiva la maggior parte delle funzionalità della mod sul lato client. Se l'opzione viene attivata o disattivata durante una sessione, sarà necessario uscire e rientrare affinché le modifiche abbiano effetto.",
    "option.NoChatReports.hideInsecureMessageIndicators": "Nascondi gli indicatori dei messaggi non verificati",
    "option.NoChatReports.hideInsecureMessageIndicators.tooltip": "Impedisce al client di mostrare indicatori per i messaggi non verificati, che consistono in una barra grigia a sinistra del messaggio.",
    "option.NoChatReports.hideModifiedMessageIndicators": "Nascondi gli indicatori dei messaggi modificati",
    "option.NoChatReports.hideModifiedMessageIndicators.tooltip": "Impedisce al client di mostrare indicatori per i messaggi modificati, che consistono in una barra grigia a sinistra del messaggio e un'icona §7§l(§r§7?§7§l)§r a destra del messaggio che appare al passaggio del mouse.",
    "option.NoChatReports.hideSigningRequestMessage": "Nascondi messaggio di richiesta della firma",
    "option.NoChatReports.hideSigningRequestMessage.tooltip": "Nasconde il messaggio in chat che viene mostrato quando il server richiede al client di firmare i messaggi.",
    "option.NoChatReports.hideSystemMessageIndicators": "Nascondi gli indicatori dei messaggi di sistema",
    "option.NoChatReports.hideSystemMessageIndicators.tooltip": "Impedisce al client di mostrare indicatori per i messaggi di sistema, che consistono in una barra grigia a sinistra del messaggio.",
    "option.NoChatReports.hideWarningToast": "Nascondi l'avviso popup",
    "option.NoChatReports.hideWarningToast.tooltip": "Rimuove l'avviso popup che viene mostrato quando si entra in server con l'opzione §oenforce-secure-profile§r disattivata.",
    "option.NoChatReports.showEncryptionButton": "Mostra il pulsante per la crittografia",
    "option.NoChatReports.showEncryptionButton.tooltip": "Disattivare questa opzione non farà altro che impedire che il pulsante per la crittografia venga mostrato nella schermata della chat. Nota che la crittografia non verrà disattivata automaticamente insieme al pulsante.",
    "option.NoChatReports.showEncryptionIndicators": "Mostra gli indicatori di crittografia",
    "option.NoChatReports.showEncryptionIndicators.tooltip": "Attiva o disattiva gli indicatori per i messaggi cifrati, che consistono in una barra viola a sinistra del messaggio e un'icona §5§l(§r§5ȯ§5§l)§r a destra del messaggio che appare al passaggio del mouse.",
    "option.NoChatReports.showNCRButton": "Mostra il pulsante di No Chat Reports",
    "option.NoChatReports.showNCRButton.tooltip": "Aggiunge al menù \"Gioca in multigiocatore\" un pulsante per attivare o disattivare la maggior parte delle funzionalità della mod sul lato client.",
    "option.NoChatReports.showReloadButton": "Mostra il pulsante di ricaricamento",
    "option.NoChatReports.showReloadButton.tooltip": "Aggiunge al menù \"Gioca in multigiocatore\" un pulsante per ricaricare i file di configurazione.",
    "option.NoChatReports.showServerSafety": "Mostra stato di sicurezza del server",
    "option.NoChatReports.showServerSafety.moreInfo": "§bFai clic qui per maggiori informazioni sui livelli di sicurezza dei server",
    "option.NoChatReports.showServerSafety.tooltip": "Permette al client di mostrare lo stato di sicurezza del server nell'angolo in basso a destra della schermata della chat. Puoi passare il mouse sull'icona per ottenere informazioni aggiuntive.",
    "option.NoChatReports.verifiedIconEnabled": "Abilita icona di verifica",
    "option.NoChatReports.verifiedIconEnabled.tooltip": "Permette alla mod di mostrare un'icona speciale nel menù \"Gioca in multigiocatore\" per i server che hanno installato No Chat Reports o qualche altra misura anti-segnalazione.",
    "option.NoChatReports.verifiedIconOffsetX": "Scostamento x dell'icona di verifica",
    "option.NoChatReports.verifiedIconOffsetX.tooltip": "Definisce lo scostamento sull'asse x dell'icona \"Server sicuro\".",
    "option.NoChatReports.verifiedIconOffsetY": "Scostamento y dell'icona di verifica",
    "option.NoChatReports.verifiedIconOffsetY.tooltip": "Definisce lo scostamento sull'asse y dell'icona \"Server sicuro\".",
    "tag.nochatreports.encrypted": "Cifrato con: %1$s",
    "tag.nochatreports.encrypted_original": "Testo cifrato: %1$s"
}
