{
	"modmenu.descriptionTranslation.nochatreports": "Usuwa sygnatury kryptograficzne z wiadomości graczy, co uniemożliwia śledzenie i powiązanie ich z Twoim kontem Mojang/Microsoft oraz korzystanie z funkcji raportowania czatu gracza.",
	"key.nochatreports.ctrl": "Ctrl",
	"key.nochatreports.cmd": "Cmd",
	"gui.nochatreports.secure_chat": "Ta opcja nie może działać z No Chat Reports, ponieważ nie ma sygnatur do weryfikacji.",
	"gui.nochatreports.no_reporting": "Raportowanie czatu jest wyłączone na tym serwerze, dzięki No Chat Reports.",
	"disconnect.nochatreports.client": "Ten serwer nie ma zainstalowanego No Chat Reports, a Ty skonfigurowałeś go do wymagania takiej funkcji.",
	"gui.nochatreports.safety_status_button.controls": "Kliknij lewym przyciskiem, aby przełączyć między trybami podpisywania.",
	"gui.nochatreports.safety_status.secure": "Ten serwer ma zainstalowany No Chat Reports lub uniemożliwia raportowanie Twoich wiadomości w inny znany sposób. Możesz bezpiecznie czatować.",
	"gui.nochatreports.safety_status.singleplayer": "Zawsze możesz bezpiecznie czatować w trybie dla pojedynczego gracza.",
	"gui.nochatreports.safety_status.unintrusive": "Ten serwer pozwala Ci wysyłać niesygnowane wiadomości, które nie mogą zostać zgłoszone do Mojang. Chyba że zainstalowano na serwerze jakiś rodzaj pluginu uniemożliwiającego raportowanie czatu, klienci vanilla będą nadal wysyłać podpisane wiadomości, wyświetlać niesygnowane wiadomości jako \"Niezweryfikowane\" i nie pokazywać ich, jeśli w opcjach czatu włączono \"Tylko pokaż bezpieczny czat\".",
	"gui.nochatreports.safety_status.insecure": "Ten serwer wymaga obecnie, aby wszystkie wiadomości czatu były podpisane. Wszystkie podpisane wiadomości są potencjalnym dowodem obciążającym, który może zostać wykorzystany przeciwko Tobie w raporcie.",
	"gui.nochatreports.safety_status.insecure_signing": "Włączyłeś podpisywanie czatu, co sprawia, że wszystkie Twoje wiadomości są potencjalnym dowodem obciążającym, który może zostać wykorzystany przeciwko Tobie w raporcie.",
	"gui.nochatreports.safety_status.realms": "To jest serwer Realms. Nie tylko nie ma tu możliwości zapobiegnięcia raportowaniu czatu, ale Mojang także stosuje automatyczne monitorowanie czatu w celu identyfikacji potencjalnych \"szkód online\" i eskalacji ich do przeglądu przez ludzi, niezależnie od tego, czy właściciel serwera Realms się z tym zgadza czy nie. Twoja jedyna nadzieja to szyfrowanie czatu.",
	"gui.nochatreports.safety_status.unknown": "No Chat Reports nie jest pewny bezpieczeństwa tego serwera jeszcze. Spróbuj wysłać wiadomość w czacie, aby go ocenić.",
	"gui.nochatreports.safety_status.undefined": "No Chat Reports nie był w stanie ocenić bezpieczeństwa tego serwera. To nigdy nie powinno się zdarzyć, proszę zgłosić to jako błąd do dewelopera moda.",
	"gui.nochatreports.signing_status.allowed_realms": "Podpisywanie czatu jest zawsze włączone na Realms, ponieważ jest zawsze wymagane, a jego wyłączenie nie przyniesie żadnych korzyści.",
	"gui.nochatreports.signing_status.allowed": "Podpisywanie wiadomości jest włączone dla tej sesji.",
	"gui.nochatreports.signing_status.allowed_session": "Podpisywanie wiadomości jest włączone dla tej sesji, ale zostanie wyłączone po ponownym dołączeniu.",
	"gui.nochatreports.signing_status.disabled": "Podpisywanie wiadomości jest wyłączone dla tej sesji.",
	"gui.nochatreports.signing_status.disabled_allowance_pending": "Podpisywanie wiadomości jest wyłączone dla tej sesji, ale zostanie włączone po wysłaniu jakiejkolwiek wiadomości.",
	"gui.nochatreports.signing_status.disabled_offline": "Podpisywanie wiadomości jest wyłączone, ponieważ jest to serwer offline.",
	"gui.nochatreports.reload_config_tooltip": "Przeładuj konfigurację No Chat Reports. Używaj ostrożnie.",
	"gui.nochatreports.verified_server": "§a§lBezpieczny serwer§r\nMożemy potwierdzić, że ten serwer ma zainstalowany No Chat Reports, lub w inny znany sposób uniemożliwia raportowanie czatu. Możesz tam bezpiecznie czatować.",
	"gui.nochatreports.ncr_toggle_tooltip": "§lNo Chat Reports:§r %1$s\nWyłącz lub włącz większość funkcjonalności modu po stronie klienta. Może to być konieczne, aby dołączyć do niektórych serwerów Paper/Velocity, ponieważ są znane z powodowania problemów z NCR.\nPewne rzeczy związane z siecią, takie jak szyfrowanie, dostosowania statusu zaufania czatu i usuwanie \"Toastu\" Vanilla \"Wiadomości czatu nie mogą być zweryfikowane\", będą nadal działać; można je wyłączyć indywidualnie w pliku konfiguracyjnym.",
	"gui.nochatreports.ncr_state_on": "§a§lWłączone§r",
	"gui.nochatreports.ncr_state_off": "§c§lWyłączone§r",
	"tag.nochatreports.encrypted": "Zaszyfrowane przy użyciu: %1$s",
	"tag.nochatreports.encrypted_original": "Nieodszyfrowane: %1$s",
	"gui.nochatreports.encryption_tooltip": "§lSzyfrowanie:§r %1$s\nKliknij prawym przyciskiem myszy, aby skonfigurować.\n\nPodczas gdy szyfrowanie jest włączone, możesz zapobiec jego zastosowaniu do wiadomości, przytrzymując klawisz §n§lCtrl§r podczas jej wysyłania.",
	"gui.nochatreports.encryption_tooltip_invalid": "§lSzyfrowanie:§r %1$s\n§cNieprawidłowa konfiguracja. Kliknij, aby skonfigurować.",
	"gui.nochatreports.encryption_state_on": "§a§lWłączone§r",
	"gui.nochatreports.encryption_state_off": "§c§lWyłączone§r",
	"gui.nochatreports.encryption_warning.header": "O Szyfrowaniu",
	"gui.nochatreports.encryption_warning.contents": "Możesz zaszyfrować swoje wiadomości za pomocą tajnego klucza. Tylko osoby, które znają ten klucz, będą w stanie je odszyfrować. No Chat Reports automatycznie odszyfruje wszystkie zaszyfrowane wiadomości, gdy zostanie podany odpowiedni klucz i funkcja zostanie włączona. Jednakże, pamiętaj, że szyfrowanie nie jest rodzajem \"magicznej różdżki\" rozwiązania. Moderatorzy na serwerach osób trzecich mogą wyciszyć lub zbanować Cię za wysyłanie wiadomości, które będą dla nich wyglądać jak zepsuty bajzel w czacie. Ponadto zaleca się, aby wygenerować niestandardowy klucz szyfrowania i przekazać go innym osobom tylko za pomocą bezpiecznych kanałów. Kliknij \"Dowiedz się więcej\", aby dowiedzieć się więcej o tym, jak i kiedy powinieneś używać szyfrowania.",
	"gui.nochatreports.encryption_warning.check": "Nie pokazuj ponownie",
	"gui.nochatreports.encryption_warning.learn_more": "Dowiedz się więcej",
	"gui.nochatreports.encryption_config.header": "Ustawienia szyfrowania",
	"gui.nochatreports.encryption_config.key_desc": "§lKlucz szyfrowania§r\nKlucz, który zostanie użyty do szyfrowania i odszyfrowania Twoich wiadomości. Jego format zależy od algorytmu; dla AES będzie to 128 bitów danych binarnych zakodowanych w Base64.",
	"gui.nochatreports.encryption_config.passphrase_desc": "§lHasło szyfrowania§r\nZamiast generowania losowego klucza, możesz wyprowadzić go z hasła wybranego przez siebie. Jeśli to zrobisz, wybierz silne hasło. Nie wszystkie algorytmy obsługują hasła.",
	"gui.nochatreports.encryption_config.validation_ok": "Weryfikacja klucza: §a§lPomyślna",
	"gui.nochatreports.encryption_config.validation_failed": "Weryfikacja klucza: §c§lNieudana",
	"gui.nochatreports.encryption_config.dice_tooltip": "Wygeneruj nowy losowy klucz z uwzględnieniem wybranego algorytmu szyfrowania.",
	"gui.nochatreports.encryption_config.pass_not_allowed": "<nieobsługiwane>",
	"gui.nochatreports.encryption_config.algorithm": "Algorytm: %1$s",
	"gui.nochatreports.encryption_config.default_key": "<domyślnie: %1$s>",
	"gui.nochatreports.encryption_config.encrypt_public": "Szyfruj publiczne wiadomości",
	"algorithm.nochatreports.aes_cfb8_base64.name": "AES/CFB8+Base64R",
	"algorithm.nochatreports.aes_cfb8_base64": "§lAES/CFB8+Base64R§r\nStandardowy symetryczny algorytm szyfrowania. Używa kluczy 128-bitowych, a wyjście jest kodowane w specjalnej wersji Base64 umożliwiającej przesyłanie przez czat Minecraft. Wadą jest zwiększenie długości wiadomości o około 30%, a serwer może je uciąć, jeśli przekroczą limit rozmiaru.",
	"algorithm.nochatreports.aes_gcm_base64.name": "AES/GCM+Base64R",
	"algorithm.nochatreports.aes_gcm_base64": "§lAES/GCM+Base64R§r\nWiększe bezpieczeństwo kosztem znacznego zwiększenia rozmiaru wiadomości (12 bajtów na wektor inicjalizacyjny i 12 na tag uwierzytelniający, kodowanie Base64 na wierzchu). Wybierz, jeśli cenisz bezpieczeństwo ponad wszystko.",
	"algorithm.nochatreports.aes_ecb_base64.name": "AES/ECB+Base64R",
	"algorithm.nochatreports.aes_ecb_base64": "§lAES/ECB+Base64R§r\nZnacznie mniej bezpieczny niż tryb CFB, ale oszczędza trochę miejsca, nie wymagając wektora inicjalizacji. Wciąż lepszy niż Cezar.",
	"algorithm.nochatreports.caesar.name": "Cezar",
	"algorithm.nochatreports.caesar": "§lCezar§r\nSzyfr memiczny. Zasadniczo liczy się na to, że ludzie zrezygnują z próby deszyfrowania twoich wiadomości bez wysiłku. To może być prawdą w wielu przypadkach, więc opłacalność jego stosowania zależy od twojego modelu zagrożenia.\nKlucz powinien być liczbą całkowitą od 1 do 1024. Przesunięcie jest wykonywane według kodu znaku zamiast alfabetycznie, aby zapewnić kompatybilność z dowolnym językiem.",
	"nochatreports.connect.nokey_rejected": "Serwer odrzucił połączenie bez klucza szyfrowania czatu.",
	"nochatreports.connect.await": "Oczekiwanie na ponowne połączenie: %1$s sekund...",
	"gui.nochatreports.realms_warning.header": "Uwaga: Realms",
	"gui.nochatreports.realms_warning.contents": "Serwery Realms nie są prywatne. Właściciele Realmów nie mogą wyłączyć raportowania czatu, a Mojang stosuje dodatkowe monitorowanie czatu w celu wykrycia potencjalnych \"szkód online\" i eskalacji ich do recenzji ludzkiej. Jeśli zostaniesz uznany za naruszającego Standardy Społeczności Minecrafta - nawet jeśli uczestnicy czatu nie zostali urażeni - zostaniesz zbanowany, tymczasowo lub na stałe, ze wszystkich usług wieloosobowych. Użycie szyfrowania jest bardzo zalecane.",
	"gui.nochatreports.realms_warning.check": "Nie pokazuj ponownie",
	"gui.nochatreports.realms_warning.learn_more": "Dowiedz się więcej",
	"gui.nochatreports.signing_required.header": "Uwaga: Wymagane podpisywanie czatu",
	"gui.nochatreports.signing_required.contents": "Ten serwer wymaga, aby wszystkie wiadomości czatu były podpisane, co oznacza, że mogą być zgłaszane do Mojang, co może skutkować banem ze wszystkich serwerów wieloosobowych. Oznacza to prawdopodobnie, że właściciel serwera zachował włączoną opcję \"enforce-secure-profile\" w pliku server.properties, która jest domyślna od wersji 1.19.1.\n\nKliknij \"Zezwól na podpisywanie\", aby włączyć podpisywanie wiadomości na tę sesję. Możesz również użyć przycisku statusu bezpieczeństwa w oknie czatu, aby wybrać tryb podpisywania dla tego serwera.",
	"gui.nochatreports.signing_required.allow_signing": "Zezwól na podpisywanie",
	"gui.nochatreports.signing_required.cancel": "Odrzuć",
	"gui.nochatreports.signing_required.check": "Nie pokazuj ponownie podczas tej sesji",
	"chat.nochatreports.disabled.signing_requested": "Serwer odmówił dostarczenia niepodpisanej wiadomości. Możesz włączyć podpisywanie czatu, zmieniając swój tryb podpisywania lub korzystając z okna dialogowego.",
	"gui.nochatreports.signing_mode": "§lTryb podpisywania: %1$s",
	"gui.nochatreports.signing_mode.default": "Domyślnie (%1$s)",
	"gui.nochatreports.signing_mode.always": "Zawsze",
	"gui.nochatreports.signing_mode.never": "Nigdy",
	"gui.nochatreports.signing_mode.never_forced": "Nie można włączyć",
	"gui.nochatreports.signing_mode.prompt": "Podpowiedź",
	"gui.nochatreports.signing_mode.on_demand": "Na żądanie",
	"gui.nochatreports.signing_mode.always.tooltip": "Ten tryb automatycznie włącza podpisywanie wiadomości, gdy tylko wejdziesz na serwer, identycznie jak to robi oryginalny klient.",
	"gui.nochatreports.signing_mode.never.tooltip": "W tym trybie wiadomości nigdy nie są podpisywane, a wszystkie żądania serwera o podpisanie są ignorowane.",
	"gui.nochatreports.signing_mode.never_forced.tooltip": "Ten tryb oznacza, że twoje wiadomości nie mogą być w ogóle podpisane, ponieważ używasz konta offline lub klient nie pobrał twoich kluczy podpisu z usługi Mojang.",
	"gui.nochatreports.signing_mode.prompt.tooltip": "W tym trybie wiadomości nie są domyślnie podpisywane, ale jeśli serwer żąda podpisania - pojawi się okno, w którym możesz włączyć podpisywanie na jedną sesję.",
	"gui.nochatreports.signing_mode.on_demand.tooltip": "Podobnie jak w trybie podpowiedzi, ale zamiast pokazywać okno, podpisywanie zostanie automatycznie włączone, gdy tylko serwer zażąda tego.",

	"configuration.NoChatReports.config": "No Chat Reports",
	"configuration.NoChatReports.category.client": "Klient",
	"option.NoChatReports.enableMod": "Włącz modyfikację",
	"option.NoChatReports.enableMod.tooltip": "Odpowiada za większość funkcjonalności modyfikacji po stronie klienta. Jeśli zostanie włączony w trakcie sesji, konieczne będzie ponowne dołączenie do serwera, aby zmiany zaczęły działać.",
	"option.NoChatReports.showNCRButton": "Pokaż przycisk NCR",
	"option.NoChatReports.showNCRButton.tooltip": "Dodaje przycisk przełączający większość funkcjonalności modyfikacji po stronie klienta do menu wieloosobowego.",
	"option.NoChatReports.defaultSigningMode": "Domyślny tryb podpisywania",
	"option.NoChatReports.defaultSigningMode.tooltip": "Ustawia domyślny tryb podpisywania dla serwerów, które wymuszają lub pozwalają na podpisywanie wiadomości czatu.",
	"option.NoChatReports.showReloadButton": "Pokaż przycisk ponownego wczytywania",
	"option.NoChatReports.showReloadButton.tooltip": "Dodaje przycisk ponownego wczytywania konfiguracji do menu wieloosobowego.",
	"option.NoChatReports.verifiedIconEnabled": "Włącz ikonę zweryfikowanego serwera",
	"option.NoChatReports.verifiedIconEnabled.tooltip": "Umożliwia modyfikacji wyświetlanie specjalnej ikony w menu wieloosobowym dla serwerów, które zainstalowały No Chat Reports lub inne środki anty-raportowania czatu.",
	"option.NoChatReports.verifiedIconOffsetX": "Przesunięcie X ikony zweryfikowanego serwera",
	"option.NoChatReports.verifiedIconOffsetX.tooltip": "Określa przesunięcie wzdłuż osi X dla wyświetlania ikony \"Bezpieczny Serwer\".",
	"option.NoChatReports.verifiedIconOffsetY": "Przesunięcie Y ikony zweryfikowanego serwera",
	"option.NoChatReports.verifiedIconOffsetY.tooltip": "Określa przesunięcie wzdłuż osi Y dla wyświetlania ikony \"Bezpieczny Serwer\".",
	"gui.NoChatReports.showEncryptionButtonWarning": "§cPoniższe nie wyłącza szyfrowania, tylko ukrywa przycisk!",
	"option.NoChatReports.showEncryptionButton": "Pokaż przycisk szyfrowania",
	"option.NoChatReports.showEncryptionButton.tooltip": "Ustawienie tego na false spowoduje po prostu brak wyświetlania przycisku szyfrowania w oknie czatu. Należy pamiętać, że samo szyfrowanie nie zostanie automatycznie wyłączone wraz z przyciskiem.",
	"option.NoChatReports.showEncryptionIndicators": "Pokaż wskaźniki szyfrowania",
	"option.NoChatReports.showEncryptionIndicators.tooltip": "Włącza wyświetlanie wskaźników szyfrowania wiadomości w postaci fioletowej belki po lewej stronie i §5§l(§r§5ȯ§5§l)§r po najechaniu kursorem na prawo od wiadomości w oknie czatu.",
	"option.NoChatReports.showServerSafety": "Pokaż bezpieczeństwo serwera",
	"option.NoChatReports.showServerSafety.tooltip": "Pozwala klientowi na wyświetlanie statusu bezpieczeństwa serwera w prawym dolnym rogu okna czatu. Ikona jest najechalna, aby wyświetlić dodatkowe informacje.",
	"option.NoChatReports.showServerSafety.moreInfo": "§bKliknij tutaj, aby dowiedzieć się więcej o poziomach bezpieczeństwa serwera",
	"option.NoChatReports.hideInsecureMessageIndicators": "Ukryj wskaźniki niesprawdzonych wiadomości",
	"option.NoChatReports.hideInsecureMessageIndicators.tooltip": "Uniemożliwia klientowi wyświetlanie wskaźników niesprawdzonych wiadomości w postaci szarej belki po lewej stronie wiadomości w oknie czatu.",
	"option.NoChatReports.hideModifiedMessageIndicators": "Ukryj wskaźniki zmodyfikowanych wiadomości",
	"option.NoChatReports.hideModifiedMessageIndicators.tooltip": "Uniemożliwia klientowi wyświetlanie wskaźników zmodyfikowanych wiadomości w postaci szarej belki po lewej stronie i §7§l(§r§7?§7§l)§r po najechaniu kursorem na prawo od wiadomości w oknie czatu.",
	"option.NoChatReports.hideSystemMessageIndicators": "Ukryj wskaźniki wiadomości systemowych",
	"option.NoChatReports.hideSystemMessageIndicators.tooltip": "Uniemożliwia klientowi wyświetlanie wskaźników wiadomości systemowych w postaci szarej belki po lewej stronie wiadomości w oknie czatu.",
	"option.NoChatReports.hideWarningToast": "Ukryj ostrzeżenie",
	"option.NoChatReports.hideWarningToast.tooltip": "Usuwa komunikat ostrzegawczy wyświetlany podczas dołączania do serwerów z wyłączoną opcją §oenforce-secure-profile§r.",
	"option.NoChatReports.hideSigningRequestMessage": "Ukryj prośbę o podpisanie wiadomości",
	"option.NoChatReports.hideSigningRequestMessage.tooltip": "Ukrywa wiadomość czatu, która jest wyświetlana, gdy serwer prosi klienta o podpisanie wiadomości.",
	"option.NoChatReports.alwaysHideReportButton": "Zawsze ukrywaj przycisk raportowania",
	"option.NoChatReports.alwaysHideReportButton.tooltip": "Uniemożliwia klientowi wyświetlanie przycisku raportowania w ekranie Interakcji Społecznych. Domyślnie jest to wyłączone, a mod po prostu czyni przycisk nieaktywnym na serwerach z zainstalowanym No Chat Reports, dodając wyjaśnienie do podpowiedzi przycisku.",
	"option.NoChatReports.demandOnServer": "Wymagaj na serwerze",
	"option.NoChatReports.demandOnServer.tooltip": "Uniemożliwia klientowi dołączenie do serwerów, na których nie zainstalowano No Chat Reports.",
	"option.NoChatReports.enableDebugLog": "Włącz dziennik debugowania",
	"option.NoChatReports.enableDebugLog.tooltip": "Włącza zapisywanie pewnych informacji debugowania. Zwykle jest to bezużyteczne dla niefachowców.",
	"option.NoChatReports.disableTelemetry": "Wyłącz telemetrię",
	"option.NoChatReports.disableTelemetry.tooltip": "Pozwala modowi wyłączyć wbudowaną telemetrię, podobnie jak No Telemetry.",
	"configuration.NoChatReports.category.lan": "LAN",
	"option.NoChatReports.demandOnClient": "Wymaganie na kliencie",
	"option.NoChatReports.demandOnClient.tooltip": "Powoduje, że serwer wymaga zainstalowania No Chat Reports przez wszystkich dołączających klientów.",
	"option.NoChatReports.demandOnClientMessage": "Wiadomość przy braku wymaganego No Chat Reports",
	"option.NoChatReports.demandOnClientMessage.tooltip": "Wiadomość wyświetlana klientowi, gdy próbuje dołączyć do serwera bez zainstalowanego No Chat Reports.",
	"option.NoChatReports.convertToGameMessage": "Konwersja na wiadomości systemowe",
	"option.NoChatReports.convertToGameMessage.tooltip": "Powoduje, że serwer konwertuje wszystkie wiadomości graczy na wiadomości systemowe. Wiadomości systemowe nie mają żadnych sygnatur i nie mogą być zgłaszane; na niezmodyfikowanych klientach będą wyświetlane z szarym paskiem po lewej stronie.",
	"option.NoChatReports.addQueryData": "Dodaj dane zapytania",
	"option.NoChatReports.addQueryData.tooltip": "Pozwala serwerowi wysyłać dodatkowe dane do klienta podczas obsługi pingów. Służy to do wyświetlania ikony \"Bezpieczny serwer\", jak również do niektórych innych celów technicznych."
}
