{
	"modmenu.descriptionTranslation.nochatreports": "Usuwa podpisy kryptograficzne z wiadomości graczy, uniemożliwiając ich śledzenie i powiązanie z kontem Mojang/Microsoft, a także korzystanie z funkcji raportowania czatu gracza.",
	"gui.nochatreport.secureChat": "Ta opcja nie działa z No Chat Reports, ponieważ nie ma podpisów do weryfikacji.",
	"gui.nochatreport.noReporting": "Raporty czatu są wyłączone na tym serwerze, dzięki No Chat Reports.",
	"disconnect.nochatreports.client": "Na tym serwerze nie ma No Chat Reports, a został skonfigurowany tak, aby był wymagany na serwerze.",
	"gui.nochatreports.status_secure": "Ten serwer ma zainstalowane No Chat Reports lub uniemożliwia raportowanie wiadomości w inny znany sposób. Możesz bezpiecznie chatować.",
	"gui.nochatreports.status_unintrusive": "Ten serwer pozwala na wysyłanie nie podpisanych wiadomości, których nie można zgłosić do Mojangu. Klienci Vanilla dalej będą wysyłać podpisane wiadomości, pokazywać nie podpisane jako \"Nie zabezpieczone\" i nie pokaże ich przy włączonej opcji \"Tylko bezpieczny czat\".",
	"gui.nochatreports.status_insecure": "Ten serwer wymaga podpisania wszystkich wiadomości graczy, a ty zgodziłeś się kontynuować z tym. Wszystko, co wysyłasz na czacie, jest potencjalnie obciążającym dowodem, który można wykorzystać przeciwko tobie w zgłoszeniu. Możesz ręcznie usunąć ten serwer z NoChatReports.json w folderze konfiguracyjnym, aby ponownie otrzymać ostrzeżenie.",
	"gui.nochatreports.status_insecure_whitelist_all_servers": "Ten serwer wymaga podpisania wszystkich wiadomości graczy, a ty wyłączyłeś pełno ekranowe ostrzeżenie o tym. Wszystko, co wysyłasz na czacie, jest potencjalnie obciążającym dowodem, który można wykorzystać przeciwko tobie w zgłoszeniu. Możesz wyłączyć \"whitelistAllServers\" w NoChatReports.json w folderze konfiguracyjnym, aby ponownie otrzymać ostrzeżenie.",
	"gui.nochatreports.status_undefined": "No Chat Reports nie może ocenić bezpieczeństwa tego serwera. To nigdy nie powinno się zdarzyć, zgłoś to jako błąd twórcy modów.",
	"gui.nochatreports.unsafe_server.header": "Uwaga: Niezabezpieczony serwer",
	"gui.nochatreports.unsafe_server.contents": "Ten serwer wymaga podpisania wszystkich wiadomości czatu, co oznacza, że można je zgłaszać do Mojang. Prawdopodobnie oznacza to, że właściciel serwera pozostawił włączony „enforce-secure-profile” w server.properties, co jest ustawieniem domyślnym od 1.19.1. Pomimo to możesz dalej zagrać, ale No Chat Reports nie będzie w stanie Cię ochronić.",
	"gui.nochatreports.unsafe_server.check": "Nie pokazuj ponownie dla tego serwera",
	"gui.nochatreports.reload_config_tooltip": "Przeładuj konfigurację No Chat Reports. Używaj ostrożnie.",
	"gui.nochatreports.verified_server": "§a§lBezpieczny serwer§r\nMożemy sprawdzić, czy na tym serwerze zainstalowano No Chat Reports lub w inny znany sposób zapobiec raportowaniu z czatu. Możesz tam bezpiecznie czatować.",
	"gui.nochatreports.ncr_toggle_tooltip": "§lNo Chat Reports:§r %1$s\nWyłącz lub włącz większość funkcji po stronie klienta moda. Być może będziesz musiał to zrobić, aby dołączyć do niektórych serwerów Paper/Velocity, ponieważ są one znane z powodowania problemów z NCR.\nNiektóre rzeczy niezwiązane z siecią, takie jak szyfrowanie, poprawianie stanu zaufania czatu i usuwanie wanilii „Wiadomości na czacie nie mogą być zweryfikowane\" toasty nadal będą działać; można je wyłączyć w konfiguracji indywidualnie.",
	"gui.nochatreports.ncr_state_on": "§a§lWłączony§r",
	"gui.nochatreports.ncr_state_off": "§c§lWyłączony§r",
	"tag.nochatreports.encrypted": "Zaszyfrowany używając: %1$s",
	"tag.nochatreports.encrypted_original": "Nieodszyfrowane: %1$s",
	"gui.nochatreports.encryption_tooltip": "§lSzyfrowanie:§r %1$s\nKliknij prawym przyciskiem, aby skonfigurować.",
	"gui.nochatreports.encryption_tooltip_invalid": "§lSzyfrowanie:§r %1$s\n§cNie prawidłowa konfiguracja. Kliknij, aby skonfigurować.",
	"gui.nochatreports.encryption_state_on": "§a§lWłączone§r",
	"gui.nochatreports.encryption_state_off": "§c§lWyłączone§r",
	"gui.nochatreports.encryption_warning.header": "O Szyfrowaniu",
	"gui.nochatreports.encryption_warning.contents": "Możesz zaszyfrować swoje wiadomości za pomocą tajnego klucza. Tylko osoby znające ten klucz będą mogły je odszyfrować. No Chat Reports automatycznie odszyfruje wszystkie zaszyfrowane wiadomości po podaniu odpowiedniego klucza i włączeniu funkcji.\nJednakże należy pamiętać, że szyfrowanie nie jest rozwiązaniem typu „magicznej różdżki”. Moderatorzy na serwerach stron trzecich mogą wyciszyć lub zablokować Cię za wysyłanie tego, co będzie im się wydawać zniekształconym bałaganem na czacie. Ponadto zaleca się wygenerowanie niestandardowego klucza szyfrowania i przekazywanie go innym osobom wyłącznie za pośrednictwem bezpiecznych kanałów. Kliknij „Więcej informacji”, aby dowiedzieć się więcej o tym, jak i kiedy należy używać szyfrowania.",
	"gui.nochatreports.encryption_warning.check": "Nie pokazuj ponownie",
	"gui.nochatreports.encryption_warning.learn_more": "Dowiedz się więcej",
	"gui.nochatreports.encryption_config.header": "Ustawienia Szyfrowania",
	"gui.nochatreports.encryption_config.key_desc": "§lKlucz szyfrowania§r\nKlucz, który będzie używany do szyfrowania i odszyfrowywania wiadomości. Jego format zależy od algorytmu; dla AES będzie to 128 bitów danych binarnych zakodowanych w Base64.",
	"gui.nochatreports.encryption_config.passphrase_desc": "§lHasło szyfrowania§r\nZamiast generować losowy klucz, możesz go wyprowadzić z wybranego hasła. Jeśli używasz tego - wybierz mocny. Nie wszystkie algorytmy obsługują hasła.",
	"gui.nochatreports.encryption_config.validation_ok": "Walidacja klucza: §a§lPomyślna",
	"gui.nochatreports.encryption_config.validation_failed": "Walidacja klucza: §c§lBłąd",
	"gui.nochatreports.encryption_config.dice_tooltip": "Wygeneruj nowy losowy klucz z uwzględnieniem wybranego algorytmu szyfrowania.",
	"gui.nochatreports.encryption_config.pass_not_allowed": "<nieobsługiwane>",
	"gui.nochatreports.encryption_config.algorithm": "Algorytm: %1$s",
	"gui.nochatreports.encryption_config.default_key": "<domyślny: %1$s>",
	"gui.nochatreports.encryption_config.encrypt_public": "Szyfruj wiadomości publiczne",
	"algorithm.nochatreports.aes_cfb8_base64": "§lAES/CFB8+Base64R§r\nStandardowy algorytm szyfrowania symetrycznego. Używa 128-bitowych kluczy, dane wyjściowe są zakodowane w Base64, aby umożliwić przesyłanie za pośrednictwem czatu Minecrafta. Wadą - wiadomości zyskają około 30% długości, a serwer może je skrócić, jeśli przekroczą limit rozmiaru.",
	"algorithm.nochatreports.aes_gcm_base64": "§lAES/GCM+Base64R§r\nWiększe bezpieczeństwo w zamian za znaczny wzrost rozmiaru wiadomości (12 bajtów na wektor inicjujący i 12 na znacznik uwierzytelniania, kodowanie Base64 na górze). Wybierz, jeśli cenisz bezpieczeństwo ponad wszystko inne.",
	"algorithm.nochatreports.aes_ecb_base64": "§lAES/ECB+Base64R§r\nZnacznie mniej bezpieczny niż tryb CFB, ale oszczędza kilka bajtów, ponieważ nie wymaga wektora inicjalizacji. Wciąż lepsze od Cezara.",
	"algorithm.nochatreports.caesar": "§lCezar§r\nSzyfr dla memu. Dzięki temu masz zasadniczo nadzieję, że ludzie zrezygnują, nawet nie próbując odszyfrować twoich wiadomości. Może to być prawdą w wielu przypadkach, więc opłacalność jego użycia zależy od modelu zagrożenia.\nKlucz powinien być liczbą całkowitą od 1 do 1024. Przesunięcie odbywa się za pomocą kodu znakowego, a nie alfabetycznego, aby zapewnić zgodność z dowolnym językiem.",

	"configuration.NoChatReports.config": "No Chat Reports",
	
	"configuration.NoChatReports.category.visual": "Wizualne",
	
	"option.NoChatReports.showServerSafety": "Pokaż bezpieczeństwo serwera",
	"option.NoChatReports.showServerSafety.tooltip": "Umożliwia klientowi wyświetlanie stanu bezpieczeństwa serwera w prawym dolnym rogu ekranu czatu. Ikonę można przesunąć, aby uzyskać dodatkowe informacje.",
	"option.NoChatReports.showServerSafety.moreInfo": "§bKliknij tutaj, aby przeczytać więcej o poziomach bezpieczeństwa serwerów",
	"option.NoChatReports.verifiedIconEnabled": "Zweryfikowana ikona włączona",
	"option.NoChatReports.verifiedIconEnabled.tooltip": "Pozwala modowi wyświetlać specjalną ikonę w menu gry wieloosobowej dla serwerów, na których zainstalowano No Chat Reports lub inne środki zapobiegające zgłaszaniu czatów.",
	"option.NoChatReports.verifiedIconOffsetX": "Przesunięcie X zweryfikowanej ikony",
	"option.NoChatReports.verifiedIconOffsetX.tooltip": "Definiuje przesunięcie osi X dla renderowania ikony \"Bezpieczny serwer\".",
	"option.NoChatReports.verifiedIconOffsetY": "Przesunięcie Y zweryfikowanej ikony",
	"option.NoChatReports.verifiedIconOffsetY.tooltip": "Definiuje przesunięcie osi Y dla renderowania ikony \"Bezpieczny serwer\".",
	"option.NoChatReports.hideRedChatIndicators": "Ukryj czerwone wskaźniki czatu",
	"option.NoChatReports.hideRedChatIndicators.tooltip": "Zapobiega wyświetlaniu przez klienta wskaźników \"Niezabezpieczonych\" w postaci czerwonego paska po lewej stronie i ikony §c§l(§r§c!§c§l)§r po prawej stronie wiadomości czatu.",
	"option.NoChatReports.hideYellowChatIndicators": "Ukryj żółte wskaźniki czatu",
	"option.NoChatReports.hideYellowChatIndicators.tooltip": "Zapobiega wyświetlaniu przez klienta wskaźników \"Zmodyfikowano\" w postaci żółtego paska po lewej stronie i ikony §e§l(§r§e?§e§l)§r po prawej stronie wiadomości czatu.",
	"option.NoChatReports.hideGrayChatIndicators": "Ukryj szare wskaźniki czatu",
	"option.NoChatReports.hideGrayChatIndicators.tooltip": "Zapobiega wyświetlaniu przez klienta specjalnych wskaźników komunikatów systemowych w postaci szarego paska po lewej stronie.",
	"option.NoChatReports.hideWarningToast": "Ukryj toast ostrzegawczy",
	"option.NoChatReports.hideWarningToast.tooltip": "Usuwa ostrzeżenie wyświetlane podczas wchodzenia na serwery z wyłączonym §oenforce-secure-profile§r.",
	"option.NoChatReports.alwaysHideReportButton": "Zawsze ukrywaj przycisk raportu",
	"option.NoChatReports.alwaysHideReportButton.tooltip": "Zapobiega wyświetlaniu przez klienta przycisku raportu na ekranie interakcji społecznościowych. Domyślnie jest to wyłączone, a mod po prostu dezaktywuje przycisk na serwerach, na których nie zainstalowano żadnych raportów czatu, dodając wyjaśnienie do podpowiedzi przycisku.",
	
	"configuration.NoChatReports.category.technical": "Techniczne",
	
	"option.NoChatReports.demandOnServer": "Wymagaj na serwerze",
	"option.NoChatReports.demandOnServer.tooltip": "Uniemożliwia klientowi dołączanie do serwerów, na których nie zainstalowano No Chat Reports.",
	"option.NoChatReports.enableDebugLog": "Włącz dziennik debugowania",
	"option.NoChatReports.enableDebugLog.tooltip": "Umożliwia rejestrowanie pewnych informacji debugowania. Jest to generalnie bezużyteczne dla osób niebędących programistami.",
	"option.NoChatReports.disableTelemetry": "Wyłącz telementrię",
	"option.NoChatReports.disableTelemetry.tooltip": "Umożliwia modowi wyłączenie wbudowanej telemetrii, podobnie jak w przypadku No Telementry.",
	"option.NoChatReports.showReloadButton": "Pokaż przycisk przeładowania",
	"option.NoChatReports.showReloadButton.tooltip": "Dodaje przycisk przeładowania konfiguracji do menu gry wieloosobowej.",
	"option.NoChatReports.whitelistAllServers": "Dodaj wszystkie serwery do białej listy",
	"option.NoChatReports.whitelistAllServers.tooltip": "Sprawia, że mod zachowuje się tak, jakby wszystkie serwery zostały dodane do §oBiałej listy serwerów§r.",
	"option.NoChatReports.showNCRButton": "Pokaż przycisk NCR",
	"option.NoChatReports.showNCRButton.tooltip": "Dodaje przycisk, który przełącza większość funkcjonalności moda po stronie klienta do menu gry wieloosobowej.",
	"option.NoChatReports.enableMod": "Włącz modyfikacje",
	"option.NoChatReports.enableMod.tooltip": "Odpowiedzialny za włączenie większości funkcjonalności modów po stronie klienta, patrz opcja powyżej.",
	
	"configuration.NoChatReports.category.whitelistedServers": "Serwery w białej liście",
	
	"option.NoChatReports.whitelistedServers": "Serwery w białej liście",
	"option.NoChatReports.whitelistedServers.tooltip": "Zawiera serwery, dla których ekran ostrzeżenia \"Niebezpieczny serwer\" nigdy nie powinien być wyświetlany. Serwery są dodawane do tej listy automatycznie po zaznaczeniu pola \"Nie pokazuj ponownie dla tego serwera\" na tym ekranie.\nKażdy wpis jest łańcuchem w formacie §l<adres-serwera>:<port>§r.",
	"option.NoChatReports.whitelistedServers.addButtonTooltip": "Dodaj serwer",
	"option.NoChatReports.whitelistedServers.removeButtonTooltip": "Usuń serwer",
	"option.NoChatReports.whitelistedServers.instructions": "Kliknij +, aby dodać serwer. Kliknij -, aby usunąć wybrany serwer.",
	"option.NoChatReports.whitelistedServers.serverAddress": "Kliknij tutaj, aby edytować adres serwera",
	
	"configuration.NoChatReports.category.lanOptions": "LAN Options",
	
	"option.NoChatReports.demandOnClient": "Wymagaj na kliencie",
	"option.NoChatReports.demandOnClient.tooltip": "Sprawia, że serwer wymaga, aby wszyscy dołączający klienci mieli zainstalowany No Chat Reports.",
	"option.NoChatReports.convertToGameMessage": "Konwertuj na wiadomość z gry",
	"option.NoChatReports.convertToGameMessage.tooltip": "Sprawia, że serwer konwertuje wszystkie wiadomości gracza na wiadomości systemowe. Wiadomości systemowe nie mają żadnych podpisów i nie mogą być raportowane; na niezmodyfikowanych klientach będą wyświetlane z szarym paskiem po lewej stronie.",
	"option.NoChatReports.addQueryData": "Dodaj dane zapytania",
	"option.NoChatReports.addQueryData.tooltip": "Umożliwia serwerowi wysyłanie dodatkowych danych do klienta podczas obsługi pingów. Służy do wyświetlania ikony \"Bezpieczny serwer\", a także do innych celów technicznych."
}
