{
	"modmenu.descriptionTranslation.nochatreports": "STRIPS Assinaturas criptográficas de mensagens de jogador, tornando impossível rastreá-las e associá-las à sua conta Mojang/Microsoft, além de usar o recurso de relatório de bate-papo de jogador.",
	"gui.nochatreports.secure_chat": "Esta opção não pode funcionar sem relatórios de bate-papo, pois não há assinaturas a serem verificadas.",
	"gui.nochatreports.no_reporting": "Os relatórios de bate-papo estão desativados neste servidor, cortesia de relatórios sem bate-papo.",
	"disconnect.nochatreports.client": "Este servidor não possui relatórios de bate-papo e você o configurou para exigir-se no servidor.",
	"gui.nochatreports.safety_status.secure": "Este servidor não possui relatórios de bate-papo instalados ou impede que suas mensagens sejam relatáveis de outra maneira conhecida.Você pode conversar com segurança.",
	"gui.nochatreports.safety_status.unintrusive": "Este servidor permite enviar mensagens não assinadas que não podem ser relatadas ao Mojang.A menos que algum tipo de plug-in seja instalado no servidor que impeça relatórios de bate-papo - os clientes de baunilha ainda enviarão mensagens assinadas, exibirá mensagens não assinadas como \"Não é seguro\" e não mostrar a eles se \"Só mostre chat seguro\" Está Ativado Nas OpÇões de bate-papo. ",
	"gui.nochatreports.safety_status.insecure": "Este servidor exige que todas as mensagens de bate-papo sejam assinadas e você concordou em prosseguir com esse acordo. Tudo o que você envia no bate-papo é potencialmente incriminador evidência que pode ser usada contra você no relatório. Você pode removerEste servidor de §Whitelisted Servers§r na configuração do mod para ser avisado novamente.",
	"gui.nochatreports.safety_status.realms": "Este é um servidor realms.Não apenas não há como evitar relatórios de bate-papo aqui, mas a Mojang também emprega monitoramento automatizado de bate-papo para identificar potencial \"danos online\" e escalá-los para revisão humana, seja proprietário do reino, gosta ou não.Sua única esperança é a criptografia de bate-papo.",
	"gui.nochatreports.status_insecure_whitelist_all_servers": "Este servidor exige que todas as mensagens de bate-papo sejam assinadas e você desativou o aviso de tela cheia para ele.Tudo o que você envia no bate-papo é uma evidência potencialmente incriminadora que pode ser usada contra você no relatório.Você pode desativar §oWhitelist todos os servidores§r na configuração do mod para ser avisado novamente.",
	"gui.nochatreports.safety_status.unknown": "Nenhum relatório de bate-papo foi alterado no meio da sessão.O status de segurança do servidor só pode ser avaliado no login.Por favor, lembre-se do servidor para avaliar seu status de segurança.",
	"gui.nochatreports.safety_status.undefined": "Nenhum relatório de bate-papo não pôde avaliar a segurança deste servidor.Isso nunca deve acontecer, denuncie-o como um bug para o desenvolvedor do mod.",
	"gui.nochatreports.unsafe_server.header": "Cuidado: servidor inseguro",
	"gui.nochatreports.unsafe_server.contents": "Este servidor exige que todas as mensagens de bate-papo sejam assinadas, o que significa que elas podem ser relatadas ao Mojang, o que pode resultar em uma proibição de todos os servidores multiplayer.Isso provavelmente significa que o proprietário do servidor manteve \"enforce-secure-profile\" ativado no server.properties, que é o padrão desde 1.19.1.Você pode optar por jogar de qualquer maneira, mas nenhum relatório de bate-papo não será capaz de protegê -lo.",
	"gui.nochatreports.unsafe_server.check": "Não mostre novamente para este servidor",
	"gui.nochatreports.reload_config_tooltip": "Recarregue nenhum relatório de bate-papo Config.Use com cuidado.",
	"gui.nochatreports.verified_server": "§a§lServidor seguro§r\nPoderíamos verificar se este servidor não possui relatórios de bate-papo instalados ou evita relatórios de bate-papo de outra maneira conhecida.Você pode conversar lá com segurança.",
	"gui.nochatreports.ncr_toggle_tooltip": "§lSem relatórios de bate-papo:§r %1$s\nDesative ou habilite a maioria da funcionalidade do lado do cliente do MOD.Você pode ter que fazer isso para ingressar em alguns servidores de papel/velocidade, pois eles são conhecidos por causar problemas com a NCR.\nCerta networking-unrelated things, como criptografia, ajustes de status de confiança de bate-papo e remoção de vanilla \"As mensagens de bate-papo não podem ser verificadas\" A torrada ainda funcionará;Eles podem ser desativados na configuração individualmente.",
	"gui.nochatreports.ncr_state_on": "§a§lHabilitada§r",
	"gui.nochatreports.ncr_state_off": "§c§lDesabilitada§r",
	"tag.nochatreports.encrypted": "Criptografado usando: %1$s",
	"tag.nochatreports.encrypted_original": "Não concretizado: %1$s",
	"gui.nochatreports.encryption_tooltip": "§lCriptografia:§r %1$s\nClique com o botão direito do mouse para configurar.\n\nEnquanto a criptografia está ativada, você pode impedir que ela seja aplicada à mensagem segurando §n§l%2$s§r Ao enviá-lo.",
	"gui.nochatreports.encryption_tooltip_invalid": "§lEcriptografia:§r %1$s\n§cConfiguração inválida.Clique para configurar.",
	"gui.nochatreports.encryption_state_on": "§a§lHabilitada§r",
	"gui.nochatreports.encryption_state_off": "§c§lDesabilitada§r",
	"gui.nochatreports.encryption_warning.header": "Sobre criptografia",
	"gui.nochatreports.encryption_warning.contents": "Você pode criptografar suas mensagens usando uma chave secreta.Somente as pessoas que sabem que essa chave poderão descriptografá-las.Nenhum relatório de bate-papo descriptografará automaticamente todas as mensagens criptografadas quando a chave adequada for fornecida e o recurso é ativado.\nNo entanto, esteja ciente de que a criptografia não é um \"varinha mágica\" tipo de solução.Os moderadores em servidores de terceiros podem silenciar ou bani-lo por enviar o que aparecerá para eles como bagunça ilegal no bate-papo.ALÉM DISSO, é recomendável que você gere a chave de criptografia personalizada e a comunique a outras pessoas apenas por meio de canais seguros.Clique \"Saber mais\" Para saber mais sobre como e quando você deve usar a criptografia.",
	"gui.nochatreports.encryption_warning.check": "Não mostre de novo",
	"gui.nochatreports.encryption_warning.learn_more": "Saber mais",
	"gui.nochatreports.encryption_config.header": "Configurações de criptografia",
	"gui.nochatreports.encryption_config.key_desc": "§lChave de encriptação§r\nChave que será usada para criptografar e descriptografar suas mensagens.Seu formato depende do algoritmo;Para o AES, serão 128 bits de dados binários codificados pela base64.",
	"gui.nochatreports.encryption_config.passphrase_desc": "§lSenha de criptografia§r\nEm vez de gerar chave aleatória, você pode derivar uma da senha de sua escolha.Se você usar isso - escolha um forte.Nem todos os algoritmos suportam as sessões.",
	"gui.nochatreports.encryption_config.validation_ok": "Validação-chave: §a§lPassou",
	"gui.nochatreports.encryption_config.validation_failed": "Validação-chave: §c§lFracassou",
	"gui.nochatreports.encryption_config.dice_tooltip": "Gerar nova chave aleatória em relação ao algoritmo de criptografia selecionado.",
	"gui.nochatreports.encryption_config.pass_not_allowed": "<não suportado>",
	"gui.nochatreports.encryption_config.algorithm": "Algoritmo: %1$s",
	"gui.nochatreports.encryption_config.default_key": "<predefinição: %1$s>",
	"gui.nochatreports.encryption_config.encrypt_public": "Criptografar mensagens públicas",
	"algorithm.nochatreports.aes_cfb8_base64.name": "AES/CFB8+Base64R",
	"algorithm.nochatreports.aes_cfb8_base64": "§lAES/CFB8+Base64R§r\nAlgoritmo de criptografia simétrica padrão.Usa as teclas de 128 bits, a saída é codificada na versão especial da base64 para permitir a transferência por meio do bate-papo do Minecraft.Como uma desvantagem - as mensagens ganharão um aumento de cerca de 30% no comprimento, e o servidor poderá truncá -las se exceder o limite de tamanho.",
	"algorithm.nochatreports.aes_gcm_base64.name": "AES/GCM+Base64R",
	"algorithm.nochatreports.aes_gcm_base64": "§lAES/GCM+Base64R§r\nMais segurança em troca de um aumento grave no tamanho da mensagem (12 bytes para vetor de inicialização e 12 para tag de autenticação, codificação base64 na parte superior).Escolha se você valoriza a segurança em vez de qualquer outra coisa.",
	"algorithm.nochatreports.aes_ecb_base64.name": "AES/ECB+Base64R",
	"algorithm.nochatreports.aes_ecb_base64": "§lAES/ECB+Base64R§r\nConsideravelmente menos seguro que o modo CFB, mas economiza alguns bytes por não exigir o vetor de inicialização.Ainda vence César.",
	"algorithm.nochatreports.caesar.name": "Caesar",
	"algorithm.nochatreports.caesar": "§lCaesar§r\nMeme Cipher.Com isso, você basicamente espera que as pessoas desista sem sequer tentar descriptografar suas mensagens.Isso pode ser verdade em muitos casos; portanto, a viabilidade de usá -lo depende do seu modelo de ameaça.\nA chave deve ser inteira de 1 a 1024. A mudança é feita pelo código do caractere, em vez de alfabeticamente, para garantir a compatibilidade com qualquer idioma.",
	"nochatreports.connect.nokey_rejected": "Conexão rejeitada por servidor sem chave de assinatura de bate-papo.",
	"nochatreports.connect.await": "Aguardando reconexão: %1$s ssegundas..",
	"gui.nochatreports.realms_warning.header": "Cuidado: Realms",
	"gui.nochatreports.realms_warning.contents": "Os servidores da Realms não são privados.Os proprietários de imóveis não podem desativar os relatórios de bate-papo, e Mojang aplica monitoramento adicional de bate-papo para identificar potencial \"danos online\" e escalá-los para a revisão humana.Se você for encontrado para violar os padrões da comunidade da Minecraft - mesmo que os participantes do bate-papo não se ofendessem - você será banido, temporária ou permanentemente, de todos os serviços multiplayer.O uso da criptografia é altamente recomendável.",
	"gui.nochatreports.realms_warning.check": "Não mostre de novo",
	"gui.nochatreports.realms_warning.learn_more": "Saber mais",
	"gui.NoChatReports.showEncryptionButtonWarning": "§cAbaixo não desative a criptografia, ela apenas esconde o botão!",

	"configuration.NoChatReports.config": "Sem relatórios de bate-papo",

	"configuration.NoChatReports.category.visual": "visual",

	"option.NoChatReports.showServerSafety": "Mostrar segurança do servidor",
	"option.NoChatReports.showServerSafety.tooltip": "Permite que o cliente exiba o status de segurança do servidor no canto inferior direito da tela de bate-papo.O ícone é pairável para obter informações adicionais.",
	"option.NoChatReports.showServerSafety.moreInfo": "§bClique aqui para ler mais sobre os níveis de segurança do servidor",
	"option.NoChatReports.verifiedIconEnabled": "Ícone verificado ativado",
	"option.NoChatReports.verifiedIconEnabled.tooltip": "Permite que o mod exiba um ícone especial no menu multiplayer para servidores que não possuem relatórios de bate-papo ou outras medidas de relatórios anti-bats instalados.",
	"option.NoChatReports.verifiedIconOffsetX": "Ícone verificado X-offset",
	"option.NoChatReports.verifiedIconOffsetX.tooltip": "Define o deslocamento do eixo x para renderizar \"Servidor seguro\" ícone.",
	"option.NoChatReports.verifiedIconOffsetY": "Ícone verificado Y-offset",
	"option.NoChatReports.verifiedIconOffsetY.tooltip": "Define o deslocamento do eixo y para a renderização de \"Servidor seguro\" ícone.",
	"option.NoChatReports.hideRedChatIndicators": "Ocultar indicadores de bate-papo vermelho",
	"option.NoChatReports.hideRedChatIndicators.tooltip": "Impede o cliente de exibir \"Não é seguro\" indicadores, na forma de barra vermelha à esquerda e §c§l(§r§c!§c§l)§r Ícone à mensagem da direita do chat.",
	"option.NoChatReports.hideYellowChatIndicators": "Hide yellow chat indicators",
	"option.NoChatReports.hideYellowChatIndicators.tooltip": "Impede o cliente de exibir \"Modificada\" indicadores, na forma de barra amarela à esquerda e §e§l(§r§e?§e§l)§r Ícone à mensagem da direita da bate-papo.",
	"option.NoChatReports.hideGrayChatIndicators": "Ocultar indicadores de bate-papo cinza",
	"option.NoChatReports.hideGrayChatIndicators.tooltip": "Impede que o cliente exiba indicadores especiais para mensagens do sistema, na forma de barra cinza à esquerda.",
	"option.NoChatReports.hideWarningToast": "Ocultar torrada de aviso",
	"option.NoChatReports.hideWarningToast.tooltip": "Remove uma torrada de aviso que é exibida ao inserir servidores com desabilitação §oenforce-secure-profile§r.",
	"option.NoChatReports.alwaysHideReportButton": "Sempre oculte o botão Relatório",
	"option.NoChatReports.alwaysHideReportButton.tooltip": "Impede que o cliente mostre o botão Relatório na tela de interações sociais.Isso é desativado por padrão, e o mod simplesmente torna o botão inativo nos servidores que não têm relatórios de bate-papo instalados, adicionando uma explicação à dica de ferramenta do botão.",

	"configuration.NoChatReports.category.technical": "Técnico",
	
	"option.NoChatReports.demandOnServer": "Demanda no servidor",
	"option.NoChatReports.demandOnServer.tooltip": "Impede que o cliente ingressasse em servidores que não possuem relatórios de bate-papo instalados.",
	"option.NoChatReports.enableDebugLog": "Ativar log de depuração",
	"option.NoChatReports.enableDebugLog.tooltip": "Permite o registro de determinadas informações de depuração.Isso geralmente é inútil para não desenvolvedores.",
	"option.NoChatReports.disableTelemetry": "Desative a telemetria",
	"option.NoChatReports.disableTelemetry.tooltip": "Permite que o mod desative a telemetria interna, semelhante a como nenhuma telemetria faz.",
	"option.NoChatReports.showReloadButton": "Mostre o botão Reload",
	"option.NoChatReports.showReloadButton.tooltip": "Adiciona um botão para recarregamento da configuração ao menu multiplayer.",
	"option.NoChatReports.whitelistAllServers": "Whitelist todos os servidores",
	"option.NoChatReports.whitelistAllServers.tooltip": "Faz com que o mod se comporte como se todos os servidores fossem adicionados a §oServidores de permissões na lista de permissões§r Lista.",
	"option.NoChatReports.showNCRButton": "Mostre o botão NCR",
	"option.NoChatReports.showNCRButton.tooltip": "Adiciona um botão que alterna a maior parte da funcionalidade do lado do Mod ao menu multiplayer.",
	"option.NoChatReports.enableMod": "Ativar mod",
	"option.NoChatReports.enableMod.tooltip": "Responsável por ativar a maioria da funcionalidade do lado do Mod, consulte a opção acima.",
	"option.NoChatReports.reconnectAwaitSeconds": "Reconectar aguardar segundos",
	"option.NoChatReports.reconnectAwaitSeconds.tooltip": "Número de segundos, qual cliente deve esperar antes da reconectar automática assim que o servidor rejeitar a conexão sem a chave de assinatura de bate-papo, assumindo que o usuário concordasse em inserir o servidor inseguro.",
	"option.NoChatReports.postDisconnectAwaitSeconds": "Pós -desconexão aguarda segundos",
	"option.NoChatReports.postDisconnectAwaitSeconds.tooltip": "Igual a §oreconnectAwaitSeconds§r, Mas a contagem regressiva começa assim que o jogador se desconecta do servidor normalmente.Se esse atraso for maior que §oreconnectAwaitSeconds§r Quando eles tentam conectar novamente o servidor - ele se aplicará.",
	"option.NoChatReports.signingCheckDelaySeconds": "Assinando atraso de verificação segundos",
	"option.NoChatReports.signingCheckDelaySeconds.tooltip": "Atraso para verificar se os servidores de Whitelisted ainda aplicam a assinatura do bate-papo, em segundos.Configurar isso para 0 fará com que a verificação seja executada em todas as tentativas de login, semelhantes a servidores não brancos.",
	"option.NoChatReports.serverSigningChecks": "Verificações de assinatura do servidor",
	"option.NoChatReports.serverSigningChecks.tooltip": "Mapa de servidores de permissões para último assinar os tempos de verificação da aplicação, em segundos de época.Isso normalmente não precisa ser editado manualmente.",
	"option.NoChatReports.showEncryptionButton": "Mostrar botão de criptografia",
	"option.NoChatReports.showEncryptionButton.tooltip": "Definir isso como false simplesmente impedirá que o botão de criptografia seja exibido na tela de bate-papo.Esteja ciente de que a própria criptografia não será desativada automaticamente junto com o botão.",

	"configuration.NoChatReports.category.whitelistedServers": "Servidores de permissões na lista de permissões",

	"option.NoChatReports.whitelistedServers": "Servidores de permissões na lista de permissões",
	"option.NoChatReports.whitelistedServers.tooltip": "Contém servidores para os quais \"Servidor inseguro\" A tela de aviso nunca deve ser exibida.Os servidores são adicionados a esta lista automaticamente quando você verifica \"Não mostre novamente para este servidor\" caixa naquela tela.\nCada entrada é uma string formatada como §l<server-ip>:<port>§r.",
	"option.NoChatReports.whitelistedServers.addButtonTooltip": "Adicionar servidor",
	"option.NoChatReports.whitelistedServers.removeButtonTooltip": "Remova o servidor selecionado",
	"option.NoChatReports.whitelistedServers.instructions": "Clique no + para adicionar um servidor.Clique no - para remover o servidor selecionado.",
	"option.NoChatReports.whitelistedServers.serverAddress": "Clique aqui para editar o endereço do servidor",

	"configuration.NoChatReports.category.lanOptions": "Opções da LAN",

	"option.NoChatReports.demandOnClient": "Demanda pelo cliente",
	"option.NoChatReports.demandOnClient.tooltip": "Faz com que o servidor exija que todos os clientes ingressantes não tenham relatórios de bate-papo instalados.",
	"option.NoChatReports.convertToGameMessage": "Converter para mensagem de jogo",
	"option.NoChatReports.convertToGameMessage.tooltip": "Faz com que o servidor converta todas as mensagens do jogador em mensagens do sistema.As mensagens do sistema não têm assinaturas anexadas e não podem ser relatadas;em clientes não modificados, eles exibirão com barra cinza à esquerda.",
	"option.NoChatReports.addQueryData": "Adicione dados de consulta",
	"option.NoChatReports.addQueryData.tooltip": "Permite que o servidor envie dados adicionais ao cliente ao manusear pings.Isso é usado para exibir \"Servidor seguro\" Ícone, bem como alguns outros fins técnicos."
}
