{
	"modmenu.descriptionTranslation.nochatreports": "Удаляет криптографические подписи из сообщений игроков, делая невозможным их отслеживание и привязку к вашей учетной записи Mojang/Microsoft, а также использование функции создания отчётов в чате игроков.",
	"key.nochatreports.ctrl": "Ctrl",
	"key.nochatreports.cmd": "Cmd",
	"gui.nochatreports.secure_chat": "Этот параметр не может работать с No Chat Reports, поскольку нет подписей для проверки.",
	"gui.nochatreports.no_reporting": "Отчеты о чате отключены на этом сервере, благодаря No Chat Reports.",
	"disconnect.nochatreports.client": "На этом сервере нет No Chat Reports, и вы настроили его так, чтобы он запрашивал сам себя на сервере.",
	"gui.nochatreports.safety_status_button.controls": "Щелкните ЛКМ, чтобы переключаться между режимами подписи.",
	"gui.nochatreports.safety_status.secure": "На этом сервере либо установлен No Chat Reports, либо ваши сообщения не могут быть доступны для публикации каким-либо другим известным способом. Вы можете безопасно общаться в чате.",
	"gui.nochatreports.safety_status.singleplayer": "Вы всегда можете безопасно общаться в однопользовательских и автономных локальных мирах.",
	"gui.nochatreports.safety_status.unintrusive": "Этот сервер позволяет вам отправлять неподписанные сообщения, о которых нельзя сообщить Mojang. Если на сервере не установлен какой-либо плагин, предотвращающий отчеты о чате, ванильные клиенты по-прежнему будут отправлять подписанные сообщения, отображать неподписанные сообщения как «Непроверенные» и не показывать их, если в настройках чата включено «Показывать только защищённый чат»",
	"gui.nochatreports.safety_status.insecure": "В настоящее время этот сервер требует, чтобы все сообщения чата были подписаны. Все подписанные сообщения являются потенциально компрометирующими доказательствами, которые могут быть использованы против вас в отчёте о чате.",
	"gui.nochatreports.safety_status.insecure_signing": "Вы включили авторизацию чата, что превращает все ваши сообщения в потенциально компрометирующие улики, которые могут быть использованы против вас в отчете о чате.",
	"gui.nochatreports.safety_status.realms": "Это сервер Realms. Здесь нет не только возможности предотвратить сообщения в чате, но Mojang также использует автоматический мониторинг чата для выявления потенциального «онлайн-вреда» и передачи его на проверку человеку, нравится это владельцу Realms или нет. Ваша единственная надежда - это шифрование чата.",
	"gui.nochatreports.safety_status.unknown": "No Chat Reports пока не уверен в безопасности этого сервера. Попробуйте отправить сообщение в чате, чтобы оценить его.",
	"gui.nochatreports.safety_status.undefined": "No Chat Reports не смог оценить безопасность этого сервера. Этого никогда не должно произойти, пожалуйста, сообщите об этом как об ошибке разработчику мода.",
	"gui.nochatreports.signing_status.allowed_realms": "Регистрация в чате всегда включена в Realms, поскольку она всегда требуется, и её отключение в любом случае не принесет никакой пользы.",
	"gui.nochatreports.signing_status.allowed": "Для этого сеанса включена подпись сообщений.",
	"gui.nochatreports.signing_status.allowed_session": "Подписание сообщений включено для этого сеанса, но оно будет отключено, как только вы повторно присоединитесь.",
	"gui.nochatreports.signing_status.disabled": "Подписание сообщений в этом сеансе отключено.",
	"gui.nochatreports.signing_status.disabled_allowance_pending": "Подписание сообщений отключено для этого сеанса, но оно будет включено, как только вы отправите любое сообщение.",
	"gui.nochatreports.signing_status.disabled_offline": "Подписание сообщений отключено, так как это автономный сервер.",
	"gui.nochatreports.reload_config_tooltip": "Перезагрузите конфигурацию No Chat Reports. Используйте осторожно.",
	"gui.nochatreports.verified_server": "§a§lБезопасный сервер§r\nМы могли бы убедиться, что на этом сервере установлен No Chat Reports или что он предотвращает отчеты о чате каким-либо другим известным способом. Вы можете безопасно общаться там.",
	"gui.nochatreports.ncr_toggle_tooltip": "§lNo Chat Reports:§r %1$s\nОтключите или включите большую часть клиентских функций мода. Возможно, вам придется сделать это, чтобы подключиться к некоторым серверам Paper/Velocity, поскольку известно, что они вызывают проблемы с No Chat Reports.\nНекоторые не связанные с сетью вещи, такие как шифрование, настройки статуса доверия в чате и удаление всплывающего сообщения vanilla «Сообщения чата не могут быть проверены», по-прежнему будут работать; они могут может быть отключен в конфигурации индивидуально.",
	"gui.nochatreports.ncr_state_on": "§a§lВключено§r",
	"gui.nochatreports.ncr_state_off": "§c§lОтключено§r",
	"tag.nochatreports.encrypted": "Зашифровано с использованием: %1$s",
	"tag.nochatreports.encrypted_original": "Не расшифровано: %1$s",
	"gui.nochatreports.encryption_tooltip": "§lШифрование:§r %1$s\nЩелкните правой кнопкой мыши, чтобы настроить.\n\nПока шифрование включено, вы можете предотвратить его применение к сообщению, удерживая %2$s при его отправке.",
	"gui.nochatreports.encryption_tooltip_invalid": "§lШифрование:§r %1$s\n§cНеверная конфигурация. Нажмите, чтобы настроить.",
	"gui.nochatreports.encryption_state_on": "§a§lВключено§r",
	"gui.nochatreports.encryption_state_off": "§c§lОтключено§r",
	"gui.nochatreports.encryption_warning.header": "О шифровании",
	"gui.nochatreports.encryption_warning.contents": "Вы можете зашифровать свои сообщения с помощью секретного ключа. Только люди, знающие этот ключ, смогут расшифровать их. Отчеты о чате не будут автоматически расшифровывать все зашифрованные сообщения, если предоставлен подходящий ключ и функция включена.\nОднако имейте в виду, что шифрование - это не решение типа «волшебной палочки». Модераторы на сторонних серверах могут отключить звук или забанить вас за отправку того, что им покажется искаженным беспорядком в чате. Кроме того, рекомендуется сгенерировать пользовательский ключ шифрования и передавать его другим людям только по защищенным каналам. Нажмите «Узнать больше», чтобы узнать больше о том, как и когда вам следует использовать шифрование.",
	"gui.nochatreports.encryption_warning.check": "Больше не показывать",
	"gui.nochatreports.encryption_warning.learn_more": "Узнать больше",
	"gui.nochatreports.encryption_config.header": "Настройки шифрования",
	"gui.nochatreports.encryption_config.key_desc": "§lКлюч шифрования§r\nКлюч, который будет использоваться для шифрования и дешифрования ваших сообщений. Его формат зависит от алгоритма; для AES это будут 128 бит двоичных данных в кодировке Base64.",
	"gui.nochatreports.encryption_config.passphrase_desc": "§lКлючевая фраза шифрования§r\nВместо генерации случайного ключа вы можете получить его из парольной фразы по вашему выбору. Если вы используете это - выберите надежный ключ. Не все алгоритмы поддерживают парольные фразы.",
	"gui.nochatreports.encryption_config.validation_ok": "Проверка ключа: §a§lПройдена",
	"gui.nochatreports.encryption_config.validation_failed": "Проверка ключа: §c§lПровалена",
	"gui.nochatreports.encryption_config.dice_tooltip": "Сгенерируйте новый случайный ключ в соответствии с выбранным алгоритмом шифрования.",
	"gui.nochatreports.encryption_config.pass_not_allowed": "<не поддерживается>",
	"gui.nochatreports.encryption_config.algorithm": "Алгоритм: %1$s",
	"gui.nochatreports.encryption_config.default_key": "<по умолчанию: %1$s>",
	"gui.nochatreports.encryption_config.encrypt_public": "Шифрование общедоступных сообщений",
	"algorithm.nochatreports.aes_cfb8_base64.name": "AES/CFB8+Base64R",
	"algorithm.nochatreports.aes_cfb8_base64": "§lAES/CFB8+Base64R§r\nСтандартный алгоритм симметричного шифрования. Использует 128-битные ключи, выходные данные кодируются в специальной версии Base64 для обеспечения возможности передачи через чат Minecraft. Как недостаток - длина сообщений увеличится примерно на 30%, и сервер может обрезать их, если они превысят предельный размер.",
	"algorithm.nochatreports.aes_gcm_base64.name": "AES/GCM+Base64R",
	"algorithm.nochatreports.aes_gcm_base64": "§lAES/GCM+Base64R§r\nПовышенная безопасность в обмен на значительное увеличение размера сообщения (12 байт для вектора инициализации и 12 байт для тега аутентификации, сверху кодировка Base64). Выберите это, если вы цените безопасность превыше всего остального.",
	"algorithm.nochatreports.aes_ecb_base64.name": "AES/ECB+Base64R",
	"algorithm.nochatreports.aes_ecb_base64": "§lAES/ECB+Base64R§r\nЗначительно менее защищенный, чем режим CFB, но экономит несколько байт, поскольку не требует вектора инициализации. По-прежнему превосходит Caesar.",
	"algorithm.nochatreports.caesar.name": "Цезарь",
	"algorithm.nochatreports.caesar": "§lЦезарь§r\nМемный шифр. Используя это, вы, по сути, надеетесь, что люди сдадутся, даже не пытаясь расшифровать ваши сообщения. Во многих случаях это может быть правдой, поэтому целесообразность его использования зависит от вашей модели угроз.\nКлюч должен быть целым числом от 1 до 1024. Сдвиг производится по символьному коду, а не по алфавиту, чтобы обеспечить совместимость с любым языком.",
	"nochatreports.connect.nokey_rejected": "Сервер отклонил соединение без ключа подписи чата.",
	"nochatreports.connect.await": "Ожидание повторного подключения: %1$s секунд…",
	"gui.nochatreports.realms_warning.header": "Внимание: Realms",
	"gui.nochatreports.realms_warning.contents": "Серверы Realms не являются частными. Владельцы Realms не могут отключить отчеты о чатах, и Mojang использует дополнительный мониторинг чатов для выявления потенциального «онлайн-вреда» и доведения его до сведения пользователей. Если после этого будет установлено, что вы нарушаете стандарты сообщества Minecraft - даже если участники чата не обиделись - вы будете временно или навсегда заблокированы во всех многопользовательских сервисах. Настоятельно рекомендуется использовать шифрование.",
	"gui.nochatreports.realms_warning.check": "Больше не показывать",
	"gui.nochatreports.realms_warning.learn_more": "Узнать больше",
	"gui.nochatreports.signing_required.header": "Внимание: Требуется подпись чата",
	"gui.nochatreports.signing_required.contents": "Этот сервер требует, чтобы все сообщения чата были подписаны, что означает, что о них можно сообщать Mojang, что может привести к блокировке всех многопользовательских серверов. Вероятно, это означает, что владелец сервера оставил «enforce-secure-profile» включенным в server.properties, который используется по умолчанию с версии 1.19.1.\n\nНажмите «Разрешить подписание», чтобы включить подписание сообщений для этого сеанса. Вы также можете использовать кнопку состояния безопасности на экране чата, чтобы выбрать режим подписи для этого сервера.",
	"gui.nochatreports.signing_required.allow_signing": "Разрешить подписание",
	"gui.nochatreports.signing_required.cancel": "Отклонить",
	"gui.nochatreports.signing_required.check": "Больше не показывать во время этого сеанса",
	"chat.nochatreports.disabled.signing_requested": "Сервер отказался доставить неподписанное сообщение. Вы можете включить подписание в чате, изменив режим подписи или выбрав окно запроса.",
	"gui.nochatreports.signing_mode": "§lРежим подписи: %1$s",
	"gui.nochatreports.signing_mode.default": "По умолчанию (%1$s)",
	"gui.nochatreports.signing_mode.always": "Всегда",
	"gui.nochatreports.signing_mode.never": "Никогда",
	"gui.nochatreports.signing_mode.never_forced": "Не удается включить",
	"gui.nochatreports.signing_mode.prompt": "Незамедлительно",
	"gui.nochatreports.signing_mode.on_demand": "По требованию",
	"gui.nochatreports.signing_mode.always.tooltip": "Этот режим автоматически включает подписание сообщений, как только вы заходите на сервер, аналогично тому, как это сделал бы обычный клиент.",
	"gui.nochatreports.signing_mode.never.tooltip": "В этом режиме сообщения никогда не подписываются, и все запросы сервера на их подписание игнорируются.",
	"gui.nochatreports.signing_mode.never_forced.tooltip": "Этот режим указывает на то, что ваши сообщения вообще не могут быть подписаны либо потому, что вы используете автономную учетную запись, либо потому, что клиенту не удалось получить ваши ключи подписи из сервиса Mojang.",
	"gui.nochatreports.signing_mode.prompt.tooltip": "В этом режиме сообщения по умолчанию не подписываются, но если сервер потребует подписи, вам будет показано всплывающее окно, где вы можете включить подписание на один сеанс.",
	"gui.nochatreports.signing_mode.on_demand.tooltip": "Аналогично режиму запроса, но вместо отображения всплывающего экрана регистрация будет просто включена автоматически, как только сервер потребует этого.",

	"configuration.NoChatReports.config": "Настройки No Chat Reports",
	"configuration.NoChatReports.category.client": "Клиент",
	"option.NoChatReports.enableMod": "Включить мод",
	"option.NoChatReports.enableMod.tooltip": "Отвечает за включение большей части клиентских функций мода. Потребуется повторное подключение к серверу, чтобы оно вступило в силу, если переключено в середине сеанса.",
	"option.NoChatReports.showNCRButton": "Показать кнопку No Chat Reports",
	"option.NoChatReports.showNCRButton.tooltip": "Добавляет кнопку, которая переключает большую часть клиентских функций мода в меню многопользовательской игры.",
	"option.NoChatReports.defaultSigningMode": "Режим подписи по умолчанию",
	"option.NoChatReports.defaultSigningMode.tooltip": "Устанавливает режим подписи по умолчанию для серверов, которые принудительно или разрешают подписание в чате.",
	"option.NoChatReports.showReloadButton": "Show reload button",
	"option.NoChatReports.showReloadButton.tooltip": "Добавляет кнопку для перезагрузки конфигурации в меню многопользовательской игры.",
	"option.NoChatReports.verifiedIconEnabled": "Значок подтверждения включен",
	"option.NoChatReports.verifiedIconEnabled.tooltip": "Позволяет моду отображать специальный значок в меню многопользовательской игры для серверов, на которых установлен No Chat Reports или какие-либо другие меры по борьбе с сообщениями о чатах.",
	"option.NoChatReports.verifiedIconOffsetX": "Значок подтверждения, X-сдвиг",
	"option.NoChatReports.verifiedIconOffsetX.tooltip": "Определяет смещение по оси X для отображения значка «Безопасный сервер».",
	"option.NoChatReports.verifiedIconOffsetY": "Значок подтверждения, Y-сдвиг",
	"option.NoChatReports.verifiedIconOffsetY.tooltip": "Определяет смещение по оси Y для отображения значка «Безопасный сервер».",
	"gui.NoChatReports.showEncryptionButtonWarning": "§cПриведенное ниже не отключает шифрование, оно только скрывает кнопку!",
	"option.NoChatReports.showEncryptionButton": "Показать кнопку шифрования",
	"option.NoChatReports.showEncryptionButton.tooltip": "Установка значения false просто предотвратит отображение кнопки шифрования на экране чата. Имейте в виду, что само шифрование не будет автоматически отключено вместе с кнопкой.",
	"option.NoChatReports.showEncryptionIndicators": "Показывать индикаторы шифрования",
	"option.NoChatReports.showEncryptionIndicators.tooltip": "Переключает отображение индикаторов зашифрованного сообщения в виде фиолетовой полосы слева и §5§l(§r§5ȯ§5§l)§r при наведении курсора справа от сообщения чата.",
	"option.NoChatReports.showServerSafety": "Показать безопасность сервера",
	"option.NoChatReports.showServerSafety.tooltip": "Позволяет клиенту отображать статус безопасности сервера в правом нижнем углу экрана чата. Значок можно перемещать для получения дополнительной информации.",
	"option.NoChatReports.showServerSafety.moreInfo": "§bНажмите здесь, чтобы узнать больше об уровнях безопасности сервера",
	"option.NoChatReports.hideInsecureMessageIndicators": "Скрыть индикаторы непроверенных сообщений",
	"option.NoChatReports.hideInsecureMessageIndicators.tooltip": "Запрещает клиенту отображать индикаторы непроверенных сообщений в виде серой полосы слева от сообщения чата.",
	"option.NoChatReports.hideModifiedMessageIndicators": "Скрыть измененные индикаторы сообщений",
	"option.NoChatReports.hideModifiedMessageIndicators.tooltip": "Запрещает клиенту отображать измененные индикаторы сообщений в виде серой полосы слева и §7§l(§r§7?§7§l)§r при наведении курсора справа от сообщения чата.",
	"option.NoChatReports.hideSystemMessageIndicators": "Скрыть индикаторы системных сообщений",
	"option.NoChatReports.hideSystemMessageIndicators.tooltip": "Запрещает клиенту отображать индикаторы системных сообщений в виде серой полосы слева от сообщения чата.",
	"option.NoChatReports.hideWarningToast": "Скрыть предупреждающий значок",
	"option.NoChatReports.hideWarningToast.tooltip": "Удаляет всплывающее предупреждение, отображаемое при входе на серверы с отключенным §oenforce-secure-profile§r.",
	"option.NoChatReports.hideSigningRequestMessage": "Скрыть сообщение с запросом на подпись",
	"option.NoChatReports.hideSigningRequestMessage.tooltip": "Скрывает сообщение чата, которое отображается, когда сервер запрашивает у клиента подпись сообщений.",
	"option.NoChatReports.alwaysHideReportButton": "Всегда скрывайте кнопку отчета",
	"option.NoChatReports.alwaysHideReportButton.tooltip": "Не позволяет клиенту когда-либо отображать кнопку отчета на экране социальных взаимодействий. По умолчанию это отключено, и мод просто делает кнопку неактивной на серверах, на которых установлен No Chat Reports, добавляя объяснение во всплывающую подсказку кнопки.",
	"option.NoChatReports.demandOnServer": "Запрос на сервер",
	"option.NoChatReports.demandOnServer.tooltip": "Запрещает клиенту подключаться к серверам, на которых не установлен No Chat Reports.",
	"option.NoChatReports.enableDebugLog": "Включить журнал отладки",
	"option.NoChatReports.enableDebugLog.tooltip": "Позволяет регистрировать определенную отладочную информацию. Как правило, это бесполезно для не-разработчиков.",
	"option.NoChatReports.disableTelemetry": "Отключить телеметрию",
	"option.NoChatReports.disableTelemetry.tooltip": "Позволяет моду отключать встроенную телеметрию аналогично тому, как это делает No Telemetry.",
	"configuration.NoChatReports.category.lan": "Локальная сеть",
	"option.NoChatReports.demandOnClient": "Запрос на клиент",
	"option.NoChatReports.demandOnClient.tooltip": "Заставляет сервер требовать, чтобы у всех присоединяющихся клиентов было установлено No Chat Reports.",
	"option.NoChatReports.demandOnClientMessage": "Запрос на сообщение об удалении клиента",
	"option.NoChatReports.demandOnClientMessage.tooltip": "Сообщение, которое выводится клиенту, если он пытается подключиться к серверу без установленного No Chat Reports.",
	"option.NoChatReports.convertToGameMessage": "Преобразовать в игровое сообщение",
	"option.NoChatReports.convertToGameMessage.tooltip": "Заставляет сервер преобразовывать все сообщения игрока в системные сообщения. Системные сообщения не имеют прикрепленных подписей и не могут быть переданы; на неизмененных клиентах они будут отображаться серой полосой слева.",
	"option.NoChatReports.addQueryData": "Добавление данных запроса",
	"option.NoChatReports.addQueryData.tooltip": "Позволяет серверу отправлять дополнительные данные клиенту при обработке пингов. Это используется для отображения значка «Безопасный сервер», а также для некоторых других технических целей."
}
