{
	"gui.nochatreport.secureChat": "Этот параметр не работает с No Chat Reports ввиду отсутствия криптографических сигнатур.",
	"gui.nochatreport.noReporting": "Жалобы на чат отключены на этом сервере благодаря No Chat Reports.",
	"disconnect.nochatreports.client": "Текущая конфигурация требует наличия No Chat Reports везде, но на данном сервере мод отсутствует.",
	"gui.nochatreports.status_secure": "На этом сервере либо установлена модификация No Chat Reports, либо он он предотвращает возможность отправки жалоб с прикреплением сообщений. Вы можете общаться безопасно.",
	"gui.nochatreports.status_unintrusive": "Сервер не запрещает жалобы, но позволяет вам отправлять неподписанные сообщения. Технически, они всё ещё могут быть отправлены Mojang, но их нельзя использовать как подлинное доказательство, и поэтому к ним вряд ли могут быть применены какие-либо действия.",
	"gui.nochatreports.status_insecure": "Сервер требует, чтобы все сообщения игроков были подписаны, и вы согласились с этим условием. Всё, что вы отправляете в чат, является потенциальной уликой, и это может быть использовано против вас в жалобе. Вы можете вручную удалить этот сервер из NoChatReports.json в файле конфигурации чтобы снова получить это предупреждение.",
	"gui.nochatreports.status_unknown": "No Chat Reports не смог оценить безопасность сервера. Такого не должно случаться, это баг. Пожалуйста, сообщите разработчику мода об этой ситуации.",
	"gui.nochatreports.unsafe_server.header": "Внимание: Небезопасный сервер",
	"gui.nochatreports.unsafe_server.contents": "Сервер требует, чтобы все сообщения игроков были подписаны, поэтому они могут быть отправлены Mojang. Скорее всего, владелец сервера оставил опцию 'enforce-secure-profile' включённой в server.properties, что является значением по-умолчанию с 1.19.1. Вы можете проигнорировать это предупреждение, но тогда No Chat Reports не сможет защитить вас.",
	"gui.nochatreports.unsafe_server.check": "Никогда не показывать для этого сервера",
	"gui.nochatrepords.reload_config_tooltip": "Перезагрузить конфигурацию No Chat Reports. Использовать с осторожностью."
}
