{
	"modmenu.descriptionTranslation.nochatreports": "ตัดลายนามทางคริปโตกราฟิกออกจากข้อความของผู้เล่น ทำให้ไม่สามารถติดตามและเชื่อมโยงข้อมูลเข้ากับบัญชี Mojang หรือ Microsoft ของคุณได้ รวมถึงการใช้ฟีเจอร์การรายงานผู้เล่น",
	"key.nochatreports.ctrl": "Ctrl",
	"key.nochatreports.cmd": "Cmd",
	"gui.nochatreports.secure_chat": "ตัวเลือกนี้ไม่สามารถใช้ร่วมกับ No Chat Reports ได้ เนื่องจากไม่มีลายนามให้ยืนยันตัวตนได้",
	"gui.nochatreports.no_reporting": "การรายงานแช็ตถูกปิดบนเซิร์ฟเวอร์นี้ จากการป้องกันของ No Chat Reports",
	"disconnect.nochatreports.client": "เซิร์ฟเวอร์นี่้ไม่มีม็อด No Chat Reports โดยเมื่อก่อนหน้านี้ คุณได้ตั้งค่าให้ตัวม็อดเองต้องมีการใช้ม็อดดังกล่าวในเซิร์ฟเวอร์",
	"gui.nochatreports.safety_status_button.controls": "คลิกซ้ายเพื่อเลื่อนหาตัวเลือกโหมดการลงนาม",
	"gui.nochatreports.safety_status.secure": "เซิร์ฟเวอร์นี้ไม่มีม็อด No Chat Reports ติดตั้งไว้ หรือมีการป้องกันไม่ให้ข้อความของคุณถูกรายงานได้ทางใดทางหนึ่ง ดังนั้นคุณสามารถพูดคุยผ่านแช็ตได้อย่างปลอดภัย",
	"gui.nochatreports.safety_status.singleplayer": "คุณสามารถพูดคุยในแช็ตได้อย่างปลอดภัยในโหมดผู้เล่นคนเดียว",
	"gui.nochatreports.safety_status.unintrusive": "เซิร์ฟเวอร์นี้อนุญาตให้คุณส่งข้อความที่ไม่ได้รับการลงนามซึ่งไม่สามารถรายงานข้อความดังกล่าวไปยัง Mojang ได้ ยกเว้นหากเซิร์ฟเวอร์มีปลั๊กอินติดตั้งไว้เพื่อป้องกันไม่ให้รายงานข้อความ หากเป็นเช่นนั้น ระบบไคลเอนต์ของวานิลลาจะยังส่งข้อความที่มีการลงนามแล้วอยู่ และแสดงข้อความที่ไม่ได้ลงนามไว้ว่า \"ไม่ปลอดภัย\" และจะไม่แสดงข้อความเหล่านั้นเมื่อตัวเลือก \"เปิดเฉพาะแช็ตที่ปลอดภัย\" ถูกเปิดไว้ในการตั้งค่าแช็ต",
	"gui.nochatreports.safety_status.insecure": "เซิร์ฟเวอร์นี้ต้องการให้ข้อความแช็ตได้รับการลงนามอย่างถูกต้องและคุณก็ได้ตกลงที่จะให้มีการกำหนดตามนี้ ทุกข้อความที่คุณส่งเข้าไปในแช็ตจะเป็นหลักฐานให้ใช้ในการรายงานคุณอย่างชัดเจน คุณสามารถลบเซิร์ฟเวอร์นี้ออกจากตัวเลือก §oเซิรฟ์เวอร์ที่ได้รับอนุญาต§r ในการตั้งค่าม็อดเพื่อให้ได้รับคำเตือนอีกครั้ง",
	"gui.nochatreports.safety_status.insecure_signing": "คุณได้เปิดการลงนามของแช็ตไว้ ซึ่งจะทำให้ข้อความของคุณมีศักยภาพที่จะเป็นหลักฐานในการกล่าวหาความผิดกับคุณได้ในการรายงาน",
	"gui.nochatreports.safety_status.realms": "เซิร์ฟเวอร์นี้เป็นเซิร์ฟเวอร์ Realms นอกจากไม่มีวิธีที่จะป้องกันการรายงานแช็ตในเซิร์ฟเวอร์นี้แล้ว ทาง Mojang ยังสามารถใช้การตรวจจับแช็ตอัตโนมัติเพื่อค้นหา \"การคุกคามทางออนไลน์\" และส่งไปให้ผู้คนตรวจสอบและพิจารณาได้ แล้วแต่ว่าเจ้าของ ๆ Realm ต้องการที่จะให้เป็นแบบนั้นหรือไม่ หนทางเดียวที่คุณจะเลี่ยงได้ก็คือการเข้ารหัสแช็ตของคุณเท่านั้น",
	"gui.nochatreports.safety_status.unknown": "No Chat Reports ยังไม่แน่ใจในความปลอดภัยของเซิร์ฟเวอร์นี้ โปรดลองส่งข้อความในแช็ตเพื่อประเมินความปลอดภัย",
	"gui.nochatreports.safety_status.undefined": "ม็อด No Chat Reports ไม่สามารถประเมินความปลอดภัยของเซิร์ฟเวอร์นี้ได้ ซึ่งสิ่งนี้ไม่ควรที่จะเกิดขึ้นเป็นอย่างยิ่ง เมื่อพบ โปรดรายงานปัญหานี้ในรูปแบบของบักให้กับผู้พัฒนาม็อดเพื่อทำการแก้ไขต่อไป",
	"gui.nochatreports.signing_status.allowed_realms": "การลงนามแช็ตจะถูกเปิดไว้ใน Realms เสมอ เนื่องจากเป็นสิ่งที่จำเป็นต้องเปิด และการปิดตัวเลือกดังกล่าวจะไม่เกิดประโยชน์ใด ๆ เลย",
	"gui.nochatreports.signing_status.allowed": "การลงนามข้อความในเซสชันนี้ถูกเปิดอยู่",
	"gui.nochatreports.signing_status.allowed_session": "การลงนามข้อความถูกเปิดในเซสชันนี้ แต่จะถูกปิดอีกครั้งเมื่อคุณเข้าใหม่",
	"gui.nochatreports.signing_status.disabled": "การลงนามข้อความในเซสชันนี้ถูกปิดอยู่",
	"gui.nochatreports.signing_status.disabled_allowance_pending": "การลงนามข้อความถูกปิดในเซสชันนี้ แต่จะถูกเปิดอีกครั้งเมื่อคุณเข้าใหม่",
	"gui.nochatreports.signing_status.disabled_offline": "การลงนามข้อความถูกปิดเนื่องจากเซิร์ฟเวอร์นี้เป็นเซิร์ฟเวอร์แบบออฟไลน์",
	"gui.nochatreports.reload_config_tooltip": "โหลดการตั้งค่าของ No Chat Reports ใหม่ โปรดใช้อย่างระมัดระวัง",
	"gui.nochatreports.verified_server": "§l§a§lเซิร์ฟเวอร์ปลอดภัย§r\nเรายืนยันได้ว่าเซิร์ฟเวอร์นี้ได้ติดตั้งม็อด No Chat Report ไว้ หรือป้องกันการรายงานแช็ตในทางใดทางหนึ่ง คุณสามารถพูดคุยในเซิร์ฟเวอร์ดังกล่าวได้อย่างปลอดภัย",
	"gui.nochatreports.ncr_toggle_tooltip": "§lNo Chat Reports:§r %1$s\nปิดหรือเปิดฟังก์ชันต่าง ๆ ของม็อดฝั่งไคลเอนต์ ซึ่งคุณอาจจำเป็นต้องเปิดหรือปิดตัวเลือกนี้เพื่อให้สามารถเข้าเล่นเซิร์ฟเวอร์ของ Paper หรือ Velocity บางเซิร์ฟเวอร์ได้, เนื่องมาจากเซิร์ฟเวอร์เหล่านี้มักมีปัญหากับม็อดนี้.\nฟีเจอร์บางอย่างที่ไม่เกี่ยวข้องกับเครือข่าย เช่น การเข้ารหัส การปรับปรุงสถานะความน่าเชื่อถือของแช็ต และการนำโทสต์ \"ไม่สามารถยืนยันข้อความแช็ตได้\" ออก จะยังคงใช้งานได้ตามปกติ ฟีเจอร์เหล่านี้สามารถปิดแยกต่างหากได้",
	"gui.nochatreports.ncr_state_on": "§a§lเปิด§r",
	"gui.nochatreports.ncr_state_off": "§c§lปิด§r",
	"tag.nochatreports.encrypted": "เข้ารหัสโดยใช้: %1$s",
	"tag.nochatreports.encrypted_original": "ไม่ถอดรหัส: %1$s",
	"gui.nochatreports.encryption_tooltip": "§lการเข้ารหัส:§r %1$s\n§cการตั้งค่าไม่ถูกต้อง คลิกเพื่อตั้งค่า\n\nขณะที่การเข้ารหัสถูกเปิดเอาไว้ คุณสามารถป้องกันไม่ให้ข้อความถูกเข้ารหัสได้โดยการกดปุ่ม §n§lCtrl§r ค้างไว้ในขณะที่กำลังกดส่ง",
	"gui.nochatreports.encryption_tooltip_invalid": "§lการเข้ารหัส:§r %1$s\n§cการตั้งค่าไม่ถูกต้อง คลิกเพื่อตั้งค่า",
	"gui.nochatreports.encryption_state_on": "§a§lเปิด§r",
	"gui.nochatreports.encryption_state_off": "§c§lปิด§r",
	"gui.nochatreports.encryption_warning.header": "เกี่ยวกับการเข้ารหัส",
	"gui.nochatreports.encryption_warning.contents": "คุณสามารถเข้ารหัสข้อความของคุณได้โดยใช้คีย์ลับ มีเพียงคนที่รู้คีย์ดังกล่าวที่จะสามารถถอดรหัสได้ โดยตัวม็อด No Chat Reports จะถอดรหัสทุกข้อความที่เข้ารหัสมาแล้วให้เมื่อมีการป้อนคีย์ที่เหมาะสมให้และมีฟีเจอร์ดังกล่าวเปิดการใช้งานอยู่\nอย่างไรก็ตาม ก็ต้องระวังไว้ด้วยว่าการเข้ารหัสนั้นไม่ใช่ \"คฑาวิเศษ\" ที่สามารถชี้ไปทางไหนก็แก้ปัญหาได้มากขนาดนั้น ผู้ดูแลในเซิร์ฟเวอร์มือที่สามยังสามารถปิดเสียง (ไม่ให้พูดคุย) หรือแบนคุณได้อยู่จากการส่งข้อความที่พวกเขาเห็นเป็นเพียงข้อความต่างดาวที่อ่านไม่ออกในแช็ต นอกจากนี้ แนะนำว่าให้คุณสร้างคีย์เข้ารหัสขึ้นมาเอง และใช้สื่อสารมันกับคนอื่น ๆ ผ่านช่องทางที่ปลอดภัยจะเป็นการดีกว่า คลิก \"เรียนรู้เพิ่มเติม\" เพื่อเรียนรู้เพิ่มเติมว่าการเข้ารหัสต้องใช้อย่างไร และต้องใช้เมื่อไร",
	"gui.nochatreports.encryption_warning.check": "ไม่ต้องแสดงอีก",
	"gui.nochatreports.encryption_warning.learn_more": "เรียนรู้เพิ่มเติม",
	"gui.nochatreports.encryption_config.header": "การตั้งค่าการเข้ารหัส",
	"gui.nochatreports.encryption_config.key_desc": "§lคีย์การเข้ารหัส§r\nเป็นคีย์ที่ใช้ในการเข้าหรือถอดรหัสข้อความของคุณเอง โดยรูปแบบของคีย์นั้นขึ้นอยู่กับวิธีการที่ใช้ หากเป็น AES ตัวคีย์จะเป็นข้อมูลตัวเลขฐานสองแบบ Base64-encoded 128 บิต",
	"gui.nochatreports.encryption_config.passphrase_desc": "§ข้อความรหัสผ่านของการเข้ารหัส§r\nจะเป็นการรับรหัสจากข้อความรหัสผ่านที่คุณเลือกเอง แทนการสร้างคีย์ขึ้นมาสุ่ม ๆ ถ้าคุณใช้ตัวเลือกนี้ โปรดเลือกรหัสที่มีความแข็งแรง คาดเดาได้ยาก มีบางอัลกอริทึมที่ไม่สามารถใช้ข้อความรหัสผ่านได้",
	"gui.nochatreports.encryption_config.validation_ok": "การตรวจสอบคีย์: §a§lผ่าน",
	"gui.nochatreports.encryption_config.validation_failed": "การตรวจสอบคีย์: §c§lไม่ผ่าน",
	"gui.nochatreports.encryption_config.dice_tooltip": "สร้างคีย์ใหม่ขึ้นมาแบบสุ่มตามอัลกอริทึมการเข้ารหัสที่ได้เลือกไว้",
	"gui.nochatreports.encryption_config.pass_not_allowed": "<ไม่ได้รับการสนับสนุน>",
	"gui.nochatreports.encryption_config.algorithm": "อัลกอริทึม: %1$s",
	"gui.nochatreports.encryption_config.default_key": "<ค่าเริ่มต้น: %1$s>",
	"gui.nochatreports.encryption_config.encrypt_public": "เข้ารหัสข้อความสาธารณะ",
	"algorithm.nochatreports.aes_cfb8_base64.name": "AES/CFB8+Base64R",
	"algorithm.nochatreports.aes_cfb8_base64": "§lAES/CFB8+Base64R§r\nอัลกอริทึมการเข้ารหัสแบบสมมาตรปกติ ใช้คีย์แบบ 128 บิต ข้อมูลส่งออกจะเป็นลักษณะการเข้ารหัสแบบ Base64 (Base64-encoded) เพื่อให้อนุญาตการถ่ายโอนข้อมูลผ่านระบบแช็ตของ Minecraft มีข้อเสียได้แก่ ข้อความจะมีความยาวมากขึ้นราว ๆ 30% และเซิร์ฟเวอร์อาจจะตัดข้อความเหล่านั้นหากมีขนาดที่มากเกินไปช",
	"algorithm.nochatreports.aes_gcm_base64.name": "AES/GCM+Base64R",
	"algorithm.nochatreports.aes_gcm_base64": "§lAES/GCM+Base64R§r\nมีความปลอดภัยมากกว่า แลกมากับขนาดของข้อความที่เพิ่มมากขึ้นเป็นจำนวนมาก (ต้องใช้พื้นที่ 12 ไบต์ สำหรับเส้นสมมติเริ่มต้น และอีก 12 ไบต์ สำหรับแท็กการรับรอง ตบท้ายด้วยการเข้ารหัสแบบ Base64) แนะนำให้เลือกตัวเลือกนี้หากคุณต้องการให้ความสำคัญกับความปลอดภัยเป็นที่หนึ่ง",
	"algorithm.nochatreports.aes_ecb_base64.name": "AES/ECB+Base64R",
	"algorithm.nochatreports.aes_ecb_base64": "§lAES/ECB+Base64R§r\nมีความปลอดภัยน้อยกว่าแบบ CFB เป็นอย่างมาก แต่ช่วยประหยัดพื้นที่ได้โดยไม่มีการสร้างเส้นสมมติเริ่มต้นขึ้นมา ยังคงดีกว่าแบบ Caesar อยู่",
	"algorithm.nochatreports.caesar.name": "Caesar",
	"algorithm.nochatreports.caesar": "§lCaesar§r\nMeme cipher. หากปรับเป็นโหมดนี้ คุณอาจหวังได้แค่ว่าคนอื่นจะยอมไม่ถอดรหัสข้อความของคุณ ซึ่งอาจจะเกิดขึ้นจริงก็ได้ในหลาย ๆ กรณี เพราะฉะนั้นการที่มันทำงานได้ดีหรือไม่นั้นขึ้นอยู่กับโมเดลแบบอย่างของผู้ไม่ประสงค์ดี\nคีย์มักจะเป็นตัวเลขจำนวนเต็มตั้งแต่ 1 ถึง 1024 การเลื่อนนั้นทำได้โดยใช้รหัสอักขระแทนตัวอักษร เพื่อให้แน่ใจว่าจะสามารถใช้งานร่วมกับภาษาอื่น ๆ ได้",
	"nochatreports.connect.nokey_rejected": "เซิร์ฟเวอร์ปฏิเสธการเชื่อมต่อที่ไม่มีคีย์การลงนามแช็ต",
	"nochatreports.connect.await": "กำลังรอการเชื่อมต่อใหม่อีกครั้ง: %1$s วินาที...",
	"gui.nochatreports.realms_warning.header": "คำเตือน: พบการเข้า Realm",
	"gui.nochatreports.realms_warning.contents": "เซิร์ฟเวอร์ Realm ไม่เป็นส่วนตัว เจ้าของ Realm ไม่สามารถปิดการรายงานแช็ตได้ และทาง Mojang ก็ยังใส่การตรวจจับแช็ตเข้ามาเพิ่มเติมเพื่อชี้หาความเป็นไปได้ของ \"การคุกคามทางออนไลน์\" และส่งไปให้ผู้คนตรวจสอบและพิจารณาได้ หากตรวจสอบแล้วพบว่าคุณละเมิดข้อปฏิบัติของชุมชน Minecraft ไม่ว่าคนที่ร่วมพูดคุยด้วยจะไม่รู้สึกถูกรุกรานก็ตาม คุณจะถูกแบนชั่วคราวหรือแบนถาวรจากการเล่นผู้เล่นหลายคนได้ จึงขอแนะนำอย่างยิ่งว่าให้ใช้โหมดการเข้ารหัส",
	"gui.nochatreports.realms_warning.check": "ไม่ต้องแสดงอีก",
	"gui.nochatreports.realms_warning.learn_more": "เรียนรู้เพิ่มเติม",
	"gui.nochatreports.signing_required.header": "คำเตือน: ร้องขอการลงนามแช็ตเรียบร้อย",
	"gui.nochatreports.signing_required.contents": "เซิร์ฟเวอร์นี้ต้องการให้มีการลงนามแช็ตทั้งหมด ซึ่งหมายความว่าแช็ตเหล่านั้นจะถูกรายงานไปยังทาง Mojang ได้ ซึ่งอาจส่งผลให้คุณถูกแบนจากการเล่นเซิร์ฟเวอร์ผู้เล่นหลายคนทั้งหมด ซึ่งอาจหมายความได้ว่าเจ้าของเซิร์ฟเวอร์ได้เปิดการตั้งค่า \"enforce-secure-profile\" เอาไว้ในไฟล์ server.properties อันเป็นค่าเริ่มต้นตั้งแต่เวอร์ชัน 1.19.1\n\nโปรดคลิก \"อนุญาตการลงนาม\" เพื่อเปิดการลงนามข้อความในเซสชันนี้ หรือคุณสามารถใช้ปุ่มสถานะความปลอดภัยในหน้าจอแช็ตเพื่อเลือกโหมดการลงนามให้กับเซิร์ฟเวอร์นี้ได้",
	"gui.nochatreports.signing_required.allow_signing": "อนุญาตการลงนาม",
	"gui.nochatreports.signing_required.cancel": "ไม่อนุญาต",
	"gui.nochatreports.signing_required.check": "ไม่ต้องแสดงข้อความในเซสชันนี้อีก",
	"chat.nochatreports.disabled.signing_requested": "เซิร์ฟเวอร์ได้ปฏิเสธการส่งออกข้อความที่ไม่มีการลงนาม คุณสามารถเปิดการลงนามข้อความได้โดยการเปลี่ยนโหมดการลงนาม หรือเปลี่ยนผ่านเมนูพร้อมท์",
	"gui.nochatreports.signing_mode": "§lโหมดการลงนาม: %1$s",
	"gui.nochatreports.signing_mode.default": "ค่าเริ่มต้น (%1$s)",
	"gui.nochatreports.signing_mode.always": "ทุกครั้ง",
	"gui.nochatreports.signing_mode.never": "ไม่ต้องลงนาม",
	"gui.nochatreports.signing_mode.never_forced": "ลงนามไม่ได้",
	"gui.nochatreports.signing_mode.prompt": "รวดเร็ว",
	"gui.nochatreports.signing_mode.on_demand": "ตามความต้องการ",
	"gui.nochatreports.signing_mode.always.tooltip": "โหมดนี้จะเปิดการลงนามข้อความโดยอัตโนมัติหลังจากที่คุณได้เข้าเซิร์ฟเวอร์แล้ว เหมือนกับที่ไคลเอนต์ของตัวเกมดั้งเดิมทำ",
	"gui.nochatreports.signing_mode.never.tooltip": "ในโหมดนี้ ข้อความต่าง ๆ จะไม่ถูกลงนามเลย และจะละเลยการร้องขอของเซิร์ฟเวอร์ให้ลงนามข้อความอีกด้วย",
	"gui.nochatreports.signing_mode.never_forced.tooltip": "โหมดนี้จะระบุให้เซิร์ฟเวอร์ว่าข้อความของคุณไม่สามารถลงนามได้เลย ไม่ว่าเพราะคุณกำลังใช้บัญชีออฟไลน์ หรือไคลเอนต์ไม่สามารถนำคีย์การลงนามมาจากบริการของ Mojang ได้",
	"gui.nochatreports.signing_mode.prompt.tooltip": "ในโหมดนี้ ข้อความต่าง ๆ จะไม่ถูกลงนามโดยเริ่มต้น แต่ถ้าเซิร์ฟเวอร์ต้องการให้มีการลงนาม คุณจะพบหน้าจอป็อปอัพที่ทำให้คุณจะสามารถเปิดการลงนามให้เซสชันนั้น ๆ ได้",
	"gui.nochatreports.signing_mode.on_demand.tooltip": "โหมดนี้จะมีความคล้ายคลึงกับโหมดรวดเร็ว แต่แทนที่จะแสดงหน้าจอป็อปอัพให้ลงนาม การลงนามจะเกิดขึ้นโดยอัตโนมัติตั้งแต่ที่เซิร์ฟเวอร์ต้องการเลย",

	"configuration.NoChatReports.config": "No Chat Reports",
	"configuration.NoChatReports.category.client": "ฝั่งไคลเอนต์",
	"option.NoChatReports.enableMod": "เปิดการใช้งานม็อด",
	"option.NoChatReports.enableMod.tooltip": "มีหน้าที่เปิดหรือปิดฟังก์ชันส่วนใหญ่ของม็อดฝั่งไคลเอนต์ หากถูกปิด/เปิดกลางเซสชัน คุณต้องเข้าเซิร์ฟเวอร์ใหม่เพื่อให้เกิดผลตามการตั้งค่าที่เปลี่ยนไป",
	"option.NoChatReports.showNCRButton": "แสดงปุ่ม NCR",
	"option.NoChatReports.showNCRButton.tooltip": "เพิ่มปุ่มที่สามารถเปิดปิดฟังก์ชันส่วนใหญ่ของม็อดฝั่งไคลเอนต์ได้เข้าไปในหน้าเมนูผู้เล่นหลายคน",
	"option.NoChatReports.defaultSigningMode": "โหมดการลงนามแบบค่าเริ่มต้น",
	"option.NoChatReports.defaultSigningMode.tooltip": "ตั้งให้โหมดการลงนามเป็นค่าเริ่มต้นให้เซิร์ฟเวอร์ที่บังคับหรืออนุญาตให้ใช้การลงนามแช็ต",
	"option.NoChatReports.showReloadButton": "แสดงปุ่มรีโหลด",
	"option.NoChatReports.showReloadButton.tooltip": "เพิ่มปุ่มสำหรับการโหลดการตั้งค่าใหม่เข้าไปในหน้าเมนูผู้เล่นหลายคน",
	"option.NoChatReports.verifiedIconEnabled": "เปิดการแสดงไอคอนการยืนยัน",
	"option.NoChatReports.verifiedIconEnabled.tooltip": "อนุญาตให้ม็อดแสดงไอคอนพิเศษในหน้าเมนูผู้เล่นหลายคนสำหรับเซิร์ฟเวอร์ที่ไม่มีม็อด No Chat Reports หรือมาตรการการปัองกันการรายงานข้อความติดตั้งไว้",
	"option.NoChatReports.verifiedIconOffsetX": "ตำแหน่งแนวนอนของไอคอนการยืนยัน",
	"option.NoChatReports.verifiedIconOffsetX.tooltip": "กำหนดตำแหน่งตามแนวแกน X (แนวนอน) ในการเรนเดอร์ไอคอน \"เซิร์ฟเวอร์ที่ปลอดภัย\"",
	"option.NoChatReports.verifiedIconOffsetY": "ตำแหน่งแนวตั้งของไอคอนการยืนยัน",
	"option.NoChatReports.verifiedIconOffsetY.tooltip": "กำหนดตำแหน่งตามแนวแกน Y (แนวตั้ง) ในการเรนเดอร์ไอคอน \"เซิร์ฟเวอร์ที่ปลอดภัย\"",
	"gui.NoChatReports.showEncryptionButtonWarning": "§cการตั้งค่าด้านล่างไม่ได้มีไว้เพื่อปิดการเข้ารหัส แต่มีไว้แค่ซ่อนปุ่มเท่านั้น!",
	"option.NoChatReports.showEncryptionButton": "แสดงปุ่มการเข้ารหัส",
	"option.NoChatReports.showEncryptionButton.tooltip": "เมื่อปิดการตั้งค่านี้ จะทำเพียงแค่ป้องกันไม่ให้มีการแสดงปุ่มการเข้ารหัสในหน้าข้อความ โปรดระลึกไว้ว่าการเข้ารหัสจะไม่ถูกปิดตามการตั้งค่านี้",
	"option.NoChatReports.showEncryptionIndicators": "แสดงตัวบ่งชี้การเข้ารหัส",
	"option.NoChatReports.showEncryptionIndicators.tooltip": "เปิด/ปิดการแสดงตัวบ่งชี้การเข้ารหัสข้อความที่อยู่ในรูปของแถบสีม่วงทางด้านซ้ายและสัญลักษณ์ §5§l(§r§5ȯ§5§l)§r ขณะชี้ลูกศรทางด้านขวาของข้อความ",
	"option.NoChatReports.showServerSafety": "แสดงความปลอดภัยของเซิร์ฟเวอร์",
	"option.NoChatReports.showServerSafety.tooltip": "อนุญาตให้ไคลเอนต์แสดงสถานะความปลอดภัยที่มุมขวาล่างของหน้าจอแช็ต ตัวไอคอนสามารถวางเคอร์เซอร์เพื่อแสดงข้อมูลเพิ่มเติมได้",
	"option.NoChatReports.showServerSafety.moreInfo": "§bคลิกที่นี่เพื่ออ่านข้อมูลเกี่ยวกับระดับความปลอดภัยของเซิร์ฟเวอร์เพิ่มเติม",
	"option.NoChatReports.hideInsecureMessageIndicators": "ซ่อนตัวบ่งชี้ข้อความที่ไม่ได้รับการยืนยัน",
	"option.NoChatReports.hideInsecureMessageIndicators.tooltip": "ป้องกันไม่ให้ไคลเอนต์แสดงตัวบ่งชี้ข้อความที่ไม่ได้รับการยืนยัน ซึ่งมีลักษณะเป็นแถบสีเทาทางด้านซ้ายของข้อความ",
	"option.NoChatReports.hideModifiedMessageIndicators": "ซ่อนตัวบ่งชี้ข้อความที่ถูกดัดแปลง",
	"option.NoChatReports.hideModifiedMessageIndicators.tooltip": "ป้องกันไม่ให้ไคลเอนต์แสดงตัวบ่งชี้ข้อความที่ถูกดัดแปลง ซึ่งมีลักษณะเป็นแถบสีเทาทางด้านซ้ายข้อความ และเครื่องหมาย §7§l(§r§7?§7§l)§r ที่อยู่ทางด้านขวาของข้อความขณะที่นำเคอร์เซอร์ไปวาง",
	"option.NoChatReports.hideSystemMessageIndicators": "ซ่อนตัวบ่งชี้ข้อความจากระบบ",
	"option.NoChatReports.hideSystemMessageIndicators.tooltip": "ป้องกันไม่ให้ไคลเอนต์แสดงตัวบ่งชี้ข้อความจากระบบ ซึ่งมีลักษณะเป็นแถบสีเทาทางด้านซ้ายของข้อความ",
	"option.NoChatReports.hideWarningToast": "ซ่อนโทสต์คำเตือน",
	"option.NoChatReports.hideWarningToast.tooltip": "ลบโทสต์คำเตือนที่จะแสดงขึ้นขณะที่กำลังเข้าเซิร์ฟเวอร์ที่มีปิดการตั้งค่า §oenforce-secure-profile§r ไว้",
	"option.NoChatReports.hideSigningRequestMessage": "ซ่อนคำร้องขอลงนาม",
	"option.NoChatReports.hideSigningRequestMessage.tooltip": "ซ่อนคำร้องขอลงนามที่จะแสดงขึ้นเมื่อเซิร์ฟเวอร์ร้องขอให้ไคลเอนต์ลงนามข้อความ",
	"option.NoChatReports.alwaysHideReportButton": "ซ่อนปุ่มรายงานทุกครั้ง",
	"option.NoChatReports.alwaysHideReportButton.tooltip": "ระงับไคลเอนต์ไม่ให้แสดงปุ่มรายงานบนหน้าปฏิสัมพันธ์ทางสังคม ตัวเลือกนี้จะถูกปิดมาตั้งแต่แรก และตัวม็อดเองก็ทำให้ปุ่มไม่สามารถใช้งานได้บนเซิร์ฟเวอร์ที่มีม็อด No Chat Reports ติดตั้งไว้อยู่แล้ว โดยใส่คำอธิบายเข้าไปในเคล็ดลับของปุ่ม",
	"option.NoChatReports.demandOnServer": "จำกัดเฉพาะเซิร์ฟเวอร์ที่มีม็อด",
	"option.NoChatReports.demandOnServer.tooltip": "ป้องกันไม่ให้ไคลเอนต์เข้าร่วมเซิร์ฟเวอร์ที่ไม่มีม็อด No Chat Reports ติดตั้งไว้",
	"option.NoChatReports.enableDebugLog": "เปิด Debug Log",
	"option.NoChatReports.enableDebugLog.tooltip": "เปิดการบันทึกข้อมูลการดีบักบางอย่าง ตัวเลือกนี้ไม่มีประโยชน์ใด ๆ สำหรับผู้ใช้ทั่วไปที่ไม่ใช่นักพัฒนาอยู่แล้ว",
	"option.NoChatReports.disableTelemetry": "ปิดการส่งข้อมูลทางไกล",
	"option.NoChatReports.disableTelemetry.tooltip": "อนุญาตให้ม็อดปิดการส่งข้อมูลทางไกลที่ติดมากับเกม คล้าย ๆ กับสิ่งที่ม็อด No Telemetry ทำ",
	"configuration.NoChatReports.category.lan": "LAN",
	"option.NoChatReports.demandOnClient": "จำกัดเฉพาะไคลเอนต์ที่มีม็อด",
	"option.NoChatReports.demandOnClient.tooltip": "ทำให้เซิร์ฟเวอร์ต้องการให้ไคลเอนต์ที่เข้าร่วมต้องมีม็อด No Chat Reports ติดตั้งไว้",
	"option.NoChatReports.demandOnClientMessage": "แสดงข้อความการเตะผู้เล่นบนไคลเอนต์",
	"option.NoChatReports.demandOnClientMessage.tooltip": "คือข้อความที่ถูกแสดงให้กับไคลเอนต์ในขณะที่พยายามเข้าร่วมเซิร์ฟเวอร์โดยที่ไม่มีม็อด No Chat Reports ติดตั้งไว้",
	"option.NoChatReports.convertToGameMessage": "แปลงให้เป็นข้อความในเกม",
	"option.NoChatReports.convertToGameMessage.tooltip": "ทำให้เซิร์ฟเวอร์เปลี่ยนข้อความของผู้เล่นทั้งหมดให้เป็นข้อความของระบบ โดยข้อความของระบบไม่มีลายนามติดไว้และไม่สามารถรายงานได้ สำหรับไคลเอนต์ที่ไม่มีการดัดแปลงจะแสดงแถบสีเทาด้านซ้ายของแช็ต",
	"option.NoChatReports.addQueryData": "เพิ่มข้อมูลการสอบถาม",
	"option.NoChatReports.addQueryData.tooltip": "อนุญาตให้เซิร์ฟเวอร์ส่งข้อมูลเพิ่มเติมเข้ามายังไคลเอนต์ขณะที่รับมือกับ Ping อยู่ เพื่อใช้ในการแสดงไอคอน \"Safe Server\" รวมทั้งจุดประสงค์ทางเทคนิคอื่น ๆ อีกด้วย"
}
