{
	"gui.nochatreports.secure_chat": "Ця опція не сумісна із модом No Chat Reports, бо підписів для перевірки не буде.",
	"gui.nochatreports.no_reporting": "Завдяки No Chat Reports, на цьому сервері неможливо скаржитися на повідомлення в чаті.",
	"disconnect.nochatreports.client": "Цей сервер не може забезпечети можливість вільної комунікації у чаті. Ваші налаштування не дозволяють приєднуватися до таких серверів, запропонуйте адміністратору встановити No Chat Reports.",
	"gui.nochatreports.safety_status.secure": "Цей сервер є безпечним: на ньому встановлено мод No Chat Reports або використувуються відомі методи для унеможливлювання скарг на повідомлення. Спілкуйтесь на здоров'я!",
	"gui.nochatreports.OLD_status_unintrusive": "Цей сервер не забороняє гравцям скаржитися на повідомлення в чаті, але одночасно відмова від підпису повідомлень дозволена. Теоретично на вас ще можуть поскаржитися до Mojang, але довести вашу провину буде надто складно, що робить вірогідність блокування або інших санкцій дуже, дуже малою.",
	"gui.nochatreports.OLD_status_insecure": "Цей сервер вимогає від усіх гравців підписувати повідомлення у чаті. Ваші налаштування не забороняють приєднуватись до цього серверу, але на кожне з ваших повідомлень зможуть поскаржитись. Будь-що сказане вами може бути використано як беззаперечні докази порушення правил Mojang. Ви можете видалити цей сервер із файлу NoChatReports.json, щоб повернути попередження.",
	"gui.nochatreports.safety_status.undefined": "No Chat Reports не вдалося зробити висновок про безпечність цього серверу. Ця поведінка не нормальна та є ознакою помилки, будь ласка, повідомте автора модифікації про це.",
	"gui.nochatreports.unsafe_server.header": "Увага: небезпечний сервер",
	"gui.nochatreports.unsafe_server.contents": "Цей сервер вимогає від вас підписувати усі повідомлення, які ви надсилаєте у чат. Це значить, що на них можна буде поскаржитись у Mojang. Скоріш за все, адміністратор серверу не вимкнув опцію 'enforce-secure-profile' у своєму server.properties (ця опція є увімкненою за умовчанням у версіях 1.19.1+). Ви можете під'єднатись все одно, але No Chat Reports не буде працювати тут. Вас попередили.",
	"gui.nochatreports.unsafe_server.check": "Не показувати знов (тільки для цього серверу)",
	"gui.nochatreports.reload_config_tooltip": "Перезавантажити конфігурацію No Chat Reports. Використовуйте обачливо."
}
