{
	"modmenu.descriptionTranslation.nochatreports": "Видаляє криптографічні підписи з повідомлень, унеможливлюючи відстеження та асоціювання їх з вашим обліковим записом Mojang/Microsoft, а також використання функції скарги на повідомлення.",
	"key.nochatreports.ctrl": "Ctrl",
	"key.nochatreports.cmd": "Cmd",
	"gui.nochatreports.secure_chat": "Ця опція не сумісна із модифікацією No Chat Reports, бо немає підписів для перевірки.",
	"gui.nochatreports.no_reporting": "Завдяки No Chat Reports, на цьому сервері неможливо скаржитися на повідомлення.",
	"disconnect.nochatreports.client": "Цей сервер не може забезпечити можливість вільного спілкування у чаті. Ваші налаштування не дозволяють приєднуватися до таких серверів, тому запропонуйте адміністратору встановити No Chat Reports.",
	"gui.nochatreports.safety_status_button.controls": "Клацніть лівою кнопкою миші для перемикання між режимами.",
	"gui.nochatreports.safety_status.secure": "На цьому сервері встановлено No Chat Reports, або позбавлення повідомлень від підписів робиться іншим відомим способом. Можливо безпечно спілкуватись.",
	"gui.nochatreports.safety_status.singleplayer": "У грі наодинці або світах у локальній мережі завжди можна безпечно спілкуватись.",
	"gui.nochatreports.safety_status.unintrusive": "Цей сервер дозволяє надсилати непідписані повідомлення, на які неможливо поскаржитися. Якщо на сервері не встановлений плагін який запобігає скарги на повідомлення - немодифіковані клієнти все ще підписуватимуть повідомлення, і будуть показувати непідписані повідомлення як \"Не підписано\" або не показуватимуть їх, якщо \"Показувати тільки підписані повідомлення\" увімкнено в налаштуваннях.",
	"gui.nochatreports.safety_status.insecure": "Цей сервер на даний момент вимагає підписування на усіх повідомленнях. Усі підписані повідомлення є потенційним доказом, який може бути використано проти вас у скарзі.",
	"gui.nochatreports.safety_status.insecure_signing": "Ви увімкнули підписування, що робить ваші повідомлення потенційним доказом, який може бути використано проти вас у скарзі.",
	"gui.nochatreports.safety_status.realms": "Це сервер Realms. Окрім того, що тут неможливо запобігти підписування повідомлень, але Mojang ще й використовує автоматичне фільтрування повідомлень для ідентифікування \"онлайн загроз\", і можливе підняття їх до огляду людиною, незважаючи на думку власника сервера Realm. Ваша єдина надія - шифрування повідомлень.",
	"gui.nochatreports.safety_status.unknown": "No Chat Reports ще не впевнений про безпечність цього сервера. Спробуйте надіслати повідомлення для повторного оцінювання.",
	"gui.nochatreports.safety_status.undefined": "No Chat Reports не зміг оцінити безпечність цього сервера. Це не має статися, будь ласка повідомте про це розробнику модифікації.",
	"gui.nochatreports.signing_status.allowed_realms": "Підписування повідомлень завжди увімкнено у Realms тому, що воно завжди необхідно і відключати його не має сенсу.",
	"gui.nochatreports.signing_status.allowed": "Підписування повідомлень увімкнено цю сесію.",
	"gui.nochatreports.signing_status.allowed_session": "Підписування повідомлень увімкнено цю сесію, але буде вимкнено у наступний раз.",
	"gui.nochatreports.signing_status.disabled": "Підписування повідомлень вимкнено цю сесію.",
	"gui.nochatreports.signing_status.disabled_allowance_pending": "Підписування повідомлень вимкнено цю сесію, але буде увімкнено коли ви надішлете наступне повідомлення.",
	"gui.nochatreports.signing_status.disabled_offline": "Підписування повідомлень вимкнено, бо цей сервер працює у офлайн-режимі.",
	"gui.nochatreports.reload_config_tooltip": "Перезавантажити конфігурацію No Chat Reports. Використовувати обережно.",
	"gui.nochatreports.verified_server": "§a§lБезпечний сервер§r\nМи змогли підтвердити, що цей сервер встановив No Chat Reports, або видаляє підписи повідомлень іншим відомим способом. Можливо безпечно спілкуватись.",
	"gui.nochatreports.ncr_toggle_tooltip": "§lNo Chat Reports:§r %1$s\nПеремкнути більшість функціоналу модифікації зі сторони клієнта. Це може бути потрібно для деяких серверів Paper/Velocity, бо відомо що вони можуть викликати проблеми з модифікацією.\nДеякі не-мережеві речі, як шифрування, зміни до стану безпеки чату і видалення попередження \"Неможливо перевірити повідомлення\" все ще будуть працювати; їх можна окремо вимкнути у конфігурації.",
	"gui.nochatreports.ncr_state_on": "§a§lУвімкнено§r",
	"gui.nochatreports.ncr_state_off": "§c§lВимкнено§r",
	"tag.nochatreports.encrypted": "Зашифровано використовуючи %1$s",
	"tag.nochatreports.encrypted_original": "Нерозшифроване: %1$s",
	"gui.nochatreports.encryption_tooltip": "§lШифрування:§r %1$s\nКлацніть правою кнопкою миші для конфігурації.\n\nПоки шифрування увімкнено, ви можете запобігти його використання на це повідомлення, утримуючи %2$s при надсиланні.",
	"gui.nochatreports.encryption_tooltip_invalid": "§lШифрування:§r %1$s\n§cНевірна конфігурація. Натисніть, щоб змінити.",
	"gui.nochatreports.encryption_state_on": "§a§lУвімкнено§r",
	"gui.nochatreports.encryption_state_off": "§c§lВимкнено§r",
	"gui.nochatreports.encryption_warning.header": "Про шифрування",
	"gui.nochatreports.encryption_warning.contents": "Можливо зашифрувати свої повідомлення за допомогою секретного ключа. Тільки люди з доступом до ключа зможуть їх розшифрувати. No Chat Reports буде автоматично розшифровувати повідомлення, якщо запроваджено правильний ключ і функцію увімкнено.\nАле, пам'ятайте що шифрування не є \"магічним\" рішенням. Модератори серверів все ще можуть покарати вас за відправлення спотвореної нісенітниці у чаті. До того ж, рекомендовано згенерувати свій ключ шифрування і передати його іншим гравцям через безпечний канал зв'язку. Натисніть \"Дізнатися більше\", щоб дізнатися як і коли треба використовувати шифрування.",
	"gui.nochatreports.encryption_warning.check": "Більше не показувати",
	"gui.nochatreports.encryption_warning.learn_more": "Дізнатися більше",
	"gui.nochatreports.encryption_config.header": "Налаштування шифрування",
	"gui.nochatreports.encryption_config.key_desc": "§lКлюч шифрування§r\nКлюч який буде використовуватися для шифрування і розшифрування ваших повідомлень. Його формат залежить від використовуваного алгоритму; для AES це буде 128 біт двійкових даних кодованих у Base64.",
	"gui.nochatreports.encryption_config.passphrase_desc": "§lПароль шифрування§r\nЗамість випадкового ключа, можливо створити його з паролю. Якщо ви це використовуєте - обирайте надійний пароль. Не усі алгоритми підтримують їх.",
	"gui.nochatreports.encryption_config.validation_ok": "Перевірка ключа: §a§lПройдено",
	"gui.nochatreports.encryption_config.validation_failed": "Перевірка ключа: §c§lПровалено",
	"gui.nochatreports.encryption_config.dice_tooltip": "Згенерувати новий випадковий ключ згідно з обраним алгоритмом шифрування.",
	"gui.nochatreports.encryption_config.pass_not_allowed": "<не підтримується>",
	"gui.nochatreports.encryption_config.algorithm": "Алгоритм: %1$s",
	"gui.nochatreports.encryption_config.default_key": "<стандартний: %1$s>",
	"gui.nochatreports.encryption_config.encrypt_public": "Шифрувати публічні повідомлення",
	"algorithm.nochatreports.aes_cfb8_base64.name": "AES/CFB8+Base64R",
	"algorithm.nochatreports.aes_cfb8_base64": "§lAES/CFB8+Base64R§r\nСтандартний алгоритм симетричного шифрування. Використовує 128-бітні ключі, вивід кодується спеціальною версією Base64 для можливості передачі через чат Minecraft. З мінусів - повідомлення збільшуватимуться майже на 30%, і сервер може відрізати їх, якщо вони занадто довгі.",
	"algorithm.nochatreports.aes_gcm_base64.name": "AES/GCM+Base64R",
	"algorithm.nochatreports.aes_gcm_base64": "§lAES/GCM+Base64R§r\nБільше безпеки в обмін на великий приріст розміру повідомлень (12 байт для вектору ініціалізації і 12 байт для тегу автентифікації, і кодування Base64 зверху). Обирайте, якщо безпека для вас дорожча за все.",
	"algorithm.nochatreports.aes_ecb_base64.name": "AES/ECB+Base64R",
	"algorithm.nochatreports.aes_ecb_base64": "§lAES/ECB+Base64R§r\nНабагато менше безпеки ніж режим CFB, але зберігає декілька байтів, бо не вимагає вектор ініціалізації. Все ще краще ніж Цезар.",
	"algorithm.nochatreports.caesar.name": "Цезар",
	"algorithm.nochatreports.caesar": "§lCaesar§r\nШифр-жарт. Використовуючи його, ви просто сподіваєтесь що ніхто навіть не спробує розшифрувати ваші повідомлення. Іноді це може бути так, тому безпека цього методу залежить від вашої моделі загроз.\nКлюч має бути числом від 1 до 1024. Зсув робиться використовуючи код символу, замість алфавіту, щоб підтримувати будь-яку мову.",
	"nochatreports.connect.nokey_rejected": "Сервер відмовив з'єднання без ключа підписування повідомлень.",
	"nochatreports.connect.await": "Очікується повторне з'єднання: %1$s секунд...",
	"gui.nochatreports.realms_warning.header": "Увага: Realms",
	"gui.nochatreports.realms_warning.contents": "Сервери Realms не приватні. Власники Realm не можуть вимкнути скарги на повідомлення і Mojang використовує автоматичне фільтрування повідомлень для ідентифікування \"онлайн загроз\", і можливе підняття їх до огляду людиною. Якщо виявлено, що ви порушили стандарти спільноти Minecraft - навіть якщо ніхто у чаті не був ображений - вас буде заблоковано, тимчасово або назавжди, з усіх серверів багато-осібної гри. Ваша єдина надія - шифрування повідомлень.",
	"gui.nochatreports.realms_warning.check": "Більше не показувати",
	"gui.nochatreports.realms_warning.learn_more": "Дізнатися більше",
	"gui.nochatreports.signing_required.header": "Увага: Вимагається підписування повідомлень.",
	"gui.nochatreports.signing_required.contents": "Цей сервер вимагає підписування усіх повідомлень, що значить що на них можливо поскаржитись Mojang, і це може заблокувати вас з усіх серверів багато-осібної гри. Скоріше за все, власник сервера залишив \"enforce-secure-profile\" увімкненим у server.properties, що є стандартом з 1.19.1.\n\nНатисніть \"Дозволити підписування\", щоб увімкнути підписування повідомлень на цю сесію. Ви також можете використовувати кнопку стану безпеки у вікні чату, щоб обрати режим підписування для цього сервера.",
	"gui.nochatreports.signing_required.allow_signing": "Дозволити підписування",
	"gui.nochatreports.signing_required.cancel": "Ігнорувати",
	"gui.nochatreports.signing_required.check": "Більше не показувати у цій сесії",
	"chat.nochatreports.disabled.signing_requested": "Сервер відмовився прийняти непідписане повідомлення. Ви можете увімкнути підписування чату, змінивши режим підписування або пройшовши вікно діалогу.",
	"gui.nochatreports.signing_mode": "§lРежим підписування: %1$s",
	"gui.nochatreports.signing_mode.default": "Стандартний (%1$s)",
	"gui.nochatreports.signing_mode.always": "Завжди",
	"gui.nochatreports.signing_mode.never": "Ніколи",
	"gui.nochatreports.signing_mode.never_forced": "Неможливо увімкнути",
	"gui.nochatreports.signing_mode.prompt": "Запитати",
	"gui.nochatreports.signing_mode.on_demand": "При вимозі",
	"gui.nochatreports.signing_mode.always.tooltip": "Цей режим автоматично увімкне підписування повідомлень як тільки ви з'єднаєтесь з сервером, ідентично до поведінки немодифікованого клієнту.",
	"gui.nochatreports.signing_mode.never.tooltip": "У цьому режимі, повідомлення ніколи не підписуються і усі запити серверу увімкнути це будуть проігноровані.",
	"gui.nochatreports.signing_mode.never_forced.tooltip": "Цей режим вказує, що ваші повідомлення взагалі неможливо підписати, бо ви використовуєте офлайн обліковий запис, або клієнту не вдалося отримати ключі підписування з сервісів Mojang.",
	"gui.nochatreports.signing_mode.prompt.tooltip": "У цьому режимі, повідомлення не підписуватимуться, але якщо сервер це вимагає, вам буде показано вікно діалогу де ви можете увімкнути його на цю сесію.",
	"gui.nochatreports.signing_mode.on_demand.tooltip": "Схоже на режим запиту, але замість вікна діалогу, підписування буде увімкнено як тільки сервер це запросить.",

	"configuration.NoChatReports.config": "No Chat Reports",
	"configuration.NoChatReports.category.client": "Клієнт",
	"option.NoChatReports.enableMod": "Увімкнути модифікацію",
	"option.NoChatReports.enableMod.tooltip": "Відповідає за увімкнення більшості функціоналу модифікації зі сторони клієнта. Вимагає повторне з'єднання до сервера, якщо змінюється під час сесії.",
	"option.NoChatReports.showNCRButton": "Показувати кнопку NCR",
	"option.NoChatReports.showNCRButton.tooltip": "Додає кнопку у меню багато-осібної гри, яка перемикає більшість функціоналу модифікації зі сторони клієнта.",
	"option.NoChatReports.defaultSigningMode": "Стандартний режим підписування",
	"option.NoChatReports.defaultSigningMode.tooltip": "Змінює стандартний режим підписування для серверів які вимагають або дозволяють підписування повідомлень.",
	"option.NoChatReports.showReloadButton": "Показувати кнопку перезавантаження",
	"option.NoChatReports.showReloadButton.tooltip": "Додає кнопку у меню багато-осібної гри, яка перезавантажує конфігурацію.",
	"option.NoChatReports.verifiedIconEnabled": "Значок перевірення увімкнено",
	"option.NoChatReports.verifiedIconEnabled.tooltip": "Дозволяє модифікації показувати спеціальний значок у меню багато-осібної гри для серверів, які використовують No Chat Reports або інші міри проти скарг на повідомлення.",
	"option.NoChatReports.verifiedIconOffsetX": "X-зсув значка перевірення",
	"option.NoChatReports.verifiedIconOffsetX.tooltip": "Вирішає зсув по осі X для значка \"Безпечний сервер\".",
	"option.NoChatReports.verifiedIconOffsetY": "Y-зсув значка перевірення",
	"option.NoChatReports.verifiedIconOffsetY.tooltip": "Вирішає зсув по осі Y для значка \"Безпечний сервер\".",
	"gui.NoChatReports.showEncryptionButtonWarning": "§cНе вимикає шифрування, лише ховає відповідну кнопку!",
	"option.NoChatReports.showEncryptionButton": "Показувати кнопку шифрування",
	"option.NoChatReports.showEncryptionButton.tooltip": "Вимкнення цього лише сховає кнопку шифрування у вікні чату. Пам'ятайте що шифрування не буде вимкнено разом з кнопкою.",
	"option.NoChatReports.showEncryptionIndicators": "Показувати індикатор шифрування",
	"option.NoChatReports.showEncryptionIndicators.tooltip": "Перемикає показ індикаторів шифрування повідомлень у формі фіолетової смужки зліва повідомлення і §5§l(§r§5ȯ§5§l)§r при наведенні cправа повідомлення.",
	"option.NoChatReports.showServerSafety": "Показувати безпечність сервера",
	"option.NoChatReports.showServerSafety.tooltip": "Дозволяє клієнту показувати стан безпеки сервера справа-знизу вікна чату. Наведення на значок показуватиме додаткову інформацію.",
	"option.NoChatReports.showServerSafety.moreInfo": "§bКлацніть тут, щоб прочитати більше про рівні безпеки серверів",
	"option.NoChatReports.hideInsecureMessageIndicators": "Сховати індикатори непідписаних повідомлень",
	"option.NoChatReports.hideInsecureMessageIndicators.tooltip": "Не дає клієнту показувати індикатори непідписаних повідомлень у формі сірої смужки зліва повідомлення.",
	"option.NoChatReports.hideModifiedMessageIndicators": "Сховати індикатори модифікованих повідомлень",
	"option.NoChatReports.hideModifiedMessageIndicators.tooltip": "Не дає клієнту показувати індикатори модифікованих повідомлень у формі сірої смужки зліва повідомлення і §7§l(§r§7?§7§l)§r при наведенні справа повідомлення.",
	"option.NoChatReports.hideSystemMessageIndicators": "Сховати індикатори системних повідомлень",
	"option.NoChatReports.hideSystemMessageIndicators.tooltip": "Не дає клієнту показувати індикатори системних повідомлень у формі сірої смужки зліва повідомлення.",
	"option.NoChatReports.hideWarningToast": "Сховати попередження",
	"option.NoChatReports.hideWarningToast.tooltip": "Ховає попередження, яке показується при з'єднанні з серверами з вимкненим §oenforce-secure-profile§r.",
	"option.NoChatReports.hideSigningRequestMessage": "Сховати повідомлення про вимогу до підписування",
	"option.NoChatReports.hideSigningRequestMessage.tooltip": "Ховає повідомлення яке показується коли сервер вимагає клієнта підписувати повідомлення.",
	"option.NoChatReports.alwaysHideReportButton": "Завжди ховати кнопку скарги",
	"option.NoChatReports.alwaysHideReportButton.tooltip": "Не дає клієнту показувати кнопку скарги у екрані соціальних взаємодій. Зазвичай це вимкнено і модифікація просто робить кнопку неактивною на серверах які мають No Chat Reports, і додає пояснення.",
	"option.NoChatReports.demandOnServer": "Вимагати у сервера",
	"option.NoChatReports.demandOnServer.tooltip": "Не дає клієнту з'єднатися з серверами, які не встановили No Chat Reports.",
	"option.NoChatReports.enableDebugLog": "Увімкнути журнал налагодження",
	"option.NoChatReports.enableDebugLog.tooltip": "Вмикає журналювання деякої інформації для налагодження. Якщо ви не розробник, вам це не потрібно.",
	"option.NoChatReports.disableTelemetry": "Вимкнути телеметрію",
	"option.NoChatReports.disableTelemetry.tooltip": "Дозволяє модифікації вимкнути вбудоване відстеження, так само як модифікація No Telemetry.",
	"configuration.NoChatReports.category.lan": "LAN",
	"option.NoChatReports.demandOnClient": "Вимагати у клієнта",
	"option.NoChatReports.demandOnClient.tooltip": "Сервер вимагатиме усіх клієнтів встановити No Chat Reports для з'єднання.",
	"option.NoChatReports.demandOnClientMessage": "Повідомлення про відмову клієнту",
	"option.NoChatReports.demandOnClientMessage.tooltip": "Це повідомлення показуватиметься клієнту, якщо той намагається з'єднатися з сервером, який не встановив No Chat Reports.",
	"option.NoChatReports.convertToGameMessage": "Перетворювати у системні повідомлення",
	"option.NoChatReports.convertToGameMessage.tooltip": "Сервер перетворюватиме усі повідомлення гравців у системні повідомлення. Такі повідомлення не мають підписів і на них неможливо поскаржитись; на звичайних клієнтах вони показуватимуть сіру смужку зліва повідомлення.",
	"option.NoChatReports.addQueryData": "Додаткові дані запиту",
	"option.NoChatReports.addQueryData.tooltip": "Дозволяє серверу відправити додаткові дані клієнту при оброблені ping-запита. Це потрібно, щоб показувати значок \"Безпечний сервер\" і деякі інші технічні дані."
}
