{
	"modmenu.descriptionTranslation.nochatreports": "Loại bỏ chữ ký mật mã khỏi tin nhắn của người chơi, khiến không thể theo dõi và liên kết chúng với tài khoản Mojang/Microsoft của bạn, cũng như sử dụng tính năng Báo cáo trò chuyện của người chơi.",
	"key.nochatreports.ctrl": "Ctrl",
	"key.nochatreports.cmd": "Cmd",
	"gui.nochatreports.secure_chat": "Tùy chọn này không thể hoạt động với No Chat Reports vì không có chữ ký để xác minh.",
	"gui.nochatreports.no_reporting": "Báo cáo trò chuyện bị vô hiệu hóa trên máy chủ này, nhờ No Chat Reports.",
	"disconnect.nochatreports.client": "Máy chủ này không có No Chat Reports và bạn đã định cấu hình để nó tự yêu cầu trên máy chủ.",
	"gui.nochatreports.safety_status_button.controls": "Nhấp chuột trái để xoay vòng giữa các chế độ ký.",
	"gui.nochatreports.safety_status.secure": "Máy chủ này có No Chat Reports hoặc ngăn không cho tin nhắn của bạn có thể bị báo cáo theo một số cách đã biết khác. Bạn có thể trò chuyện một cách an toàn.",
	"gui.nochatreports.safety_status.singleplayer": "Bạn luôn có thể trò chuyện an toàn trong thế giới chơi đơn và mạng LAN tự lưu trữ.",
	"gui.nochatreports.safety_status.unintrusive": "Máy chủ này cho phép bạn gửi các tin nhắn chưa được ký và không thể báo cáo cho Mojang. Trừ khi một số loại plugin được cài đặt trên máy chủ ngăn báo cáo trò chuyện - máy khách vanilla sẽ vẫn gửi tin nhắn đã ký, hiển thị tin nhắn chưa ký dưới dạng \"Chưa được xác minh\" và không hiển thị chúng nếu \"Chỉ hiển thị trò chuyện an toàn\" được bật trong tùy chọn trò chuyện.",
	"gui.nochatreports.safety_status.insecure": "Máy chủ này hiện yêu cầu ký tất cả các tin nhắn trò chuyện. Tất cả các tin nhắn đã ký là bằng chứng có khả năng buộc tội có thể được sử dụng để chống lại bạn trong báo cáo.",
	"gui.nochatreports.safety_status.insecure_signing": "Bạn đã bật ký trò chuyện, điều này làm cho tất cả các tin nhắn của bạn trở thành bằng chứng có khả năng buộc tội có thể được sử dụng để chống lại bạn trong báo cáo.",
	"gui.nochatreports.safety_status.realms": "Đây là một máy chủ Realm. Không những không có cách nào để ngăn các báo cáo trò chuyện ở đây mà Mojang còn sử dụng tính năng giám sát trò chuyện tự động để xác định \"tác hại trực tuyến\" tiềm ẩn và báo cáo chúng để con người xem xét, cho dù chủ sở hữu của realm có thích hay không. Hy vọng duy nhất của bạn là mã hóa trò chuyện.",
	"gui.nochatreports.safety_status.unknown": "No Chat Reports không chắc chắn về sự an toàn của máy chủ này. Hãy thử gửi một tin nhắn trong cuộc trò chuyện để đánh giá nó.",
	"gui.nochatreports.safety_status.undefined": "No Chat Reports không thể đánh giá sự an toàn của máy chủ này. Điều này sẽ không bao giờ xảy ra, vui lòng báo cáo đó là lỗi cho nhà phát triển mod.",
	"gui.nochatreports.signing_status.allowed_realms": "Tính năng ký trò chuyện luôn được bật trên Realms vì tính năng này luôn được yêu cầu và việc tắt tính năng này sẽ không mang lại lợi ích gì.",
	"gui.nochatreports.signing_status.allowed": "Ký tin nhắn được bật cho phiên này.",
	"gui.nochatreports.signing_status.allowed_session": "Tính năng ký tin nhắn được bật cho phiên này, nhưng nó sẽ bị tắt sau khi bạn tham gia lại.",
	"gui.nochatreports.signing_status.disabled": "Ký tin nhắn bị tắt cho phiên này.",
	"gui.nochatreports.signing_status.disabled_allowance_pending": "Tính năng ký thư bị tắt cho phiên này, nhưng nó sẽ được bật sau khi bạn gửi bất kỳ thư nào.",
	"gui.nochatreports.signing_status.disabled_offline": "Tính năng ký tin nhắn bị tắt vì đây là máy chủ ngoại tuyến.",
	"gui.nochatreports.reload_config_tooltip": "Tải lại cấu hình No Chat Reports. Sử dụng cẩn thận.",
	"gui.nochatreports.verified_server": "§a§lMáy chủ an toàn§r\nChúng tôi có thể xác minh rằng máy chủ này đã cài đặt No Chat Reports hoặc ngăn báo cáo trò chuyện theo một số cách đã biết khác. Bạn có thể trò chuyện ở đó một cách an toàn.",
	"gui.nochatreports.ncr_toggle_tooltip": "§lNo Chat Reports:§r %1$s\nTắt hoặc bật hầu hết chức năng phía máy khách của mod. Bạn có thể phải thực hiện việc này để tham gia một số máy chủ Paper/Velocity, vì chúng được biết là gây ra sự cố với NCR.\nMột số thứ không liên quan đến mạng, chẳng hạn như mã hóa, điều chỉnh trạng thái tin cậy của trò chuyện và xóa toast \"Tin nhắn trò chuyện không thể được xác minh\" vanilla sẽ vẫn hoạt động; chúng có thể bị vô hiệu hóa trong cấu hình riêng lẻ.",
	"gui.nochatreports.ncr_state_on": "§a§Đã bật§r",
	"gui.nochatreports.ncr_state_off": "§c§Đã tắt§r",
	"tag.nochatreports.encrypted": "Đã được mã hóa bằng cách sử dụng: %1$s",
	"tag.nochatreports.encrypted_original": "Chưa được mã hóa: %1$s",
	"gui.nochatreports.encryption_tooltip": "§lMã hoá:§r %1$s\nNhấp chuột phải để định cấu hình.\n\nTrong khi mã hóa được bật, bạn có thể ngăn mã hóa áp dụng cho thư bằng cách giữ %2$s khi gửi.",
	"gui.nochatreports.encryption_tooltip_invalid": "§lMã hóa:§r %1$s\n§cCấu hình không hợp lệ. Bấm để cấu hình.",
	"gui.nochatreports.encryption_state_on": "§a§Đã bật§r",
	"gui.nochatreports.encryption_state_off": "§c§Đã tắt§r",
	"gui.nochatreports.encryption_warning.header": "Giới thiệu về mã hóa",
	"gui.nochatreports.encryption_warning.contents": "Bạn có thể mã hóa tin nhắn của mình bằng khóa bí mật. Chỉ những người biết khóa này mới có thể giải mã chúng. No Chat Reports sẽ tự động giải mã tất cả tin nhắn được mã hóa khi khóa phù hợp được cung cấp và tính năng được bật.\nTuy nhiên, hãy lưu ý rằng mã hóa không phải là một loại giải pháp \"cây đũa thần\". Người điều hành trên máy chủ của bên thứ ba có thể tắt tiếng hoặc cấm bạn gửi nội dung mà họ cho là lộn xộn trong cuộc trò chuyện. Ngoài ra, bạn nên tạo khóa mã hóa tùy chỉnh và chỉ liên lạc nó với những người khác thông qua các kênh bảo mật. Nhấp vào \"Tìm hiểu thêm\" để tìm hiểu thêm về cách thức và thời điểm bạn nên sử dụng mã hóa.",
	"gui.nochatreports.encryption_warning.check": "Không hiển thị lại",
	"gui.nochatreports.encryption_warning.learn_more": "Tìm hiểu thêm",
	"gui.nochatreports.encryption_config.header": "Tuỳ chọn mã hóa",
	"gui.nochatreports.encryption_config.key_desc": "§lKhóa mã hóa§r\nKhóa sẽ được sử dụng để mã hóa và giải mã tin nhắn của bạn. Định dạng của nó phụ thuộc vào thuật toán; đối với AES, nó sẽ là 128 bit dữ liệu nhị phân được mã hóa Base64.",
	"gui.nochatreports.encryption_config.passphrase_desc": "§lCụm mật khẩu mã hóa§r\nThay vì tạo khóa ngẫu nhiên, bạn có thể lấy một khóa từ cụm mật khẩu bạn chọn. Nếu bạn sử dụng cái này - hãy chọn cái mạnh. Không phải tất cả các thuật toán đều hỗ trợ cụm mật khẩu.",
	"gui.nochatreports.encryption_config.validation_ok": "Xác thực khóa: §a§lĐạt",
	"gui.nochatreports.encryption_config.validation_failed": "Xác thực khóa: §c§lChưa đạt",
	"gui.nochatreports.encryption_config.dice_tooltip": "Tạo khóa ngẫu nhiên mới đối với thuật toán mã hóa đã chọn.",
	"gui.nochatreports.encryption_config.pass_not_allowed": "<không được hỗ trợ>",
	"gui.nochatreports.encryption_config.algorithm": "Thuật toán: %1$s",
	"gui.nochatreports.encryption_config.default_key": "<mặc định: %1$s>",
	"gui.nochatreports.encryption_config.encrypt_public": "Mã hóa tin nhắn công khai",
	"algorithm.nochatreports.aes_cfb8_base64.name": "AES/CFB8+Base64R",
	"algorithm.nochatreports.aes_cfb8_base64": "§lAES/CFB8+Base64R§r\nThuật toán mã hóa đối xứng tiêu chuẩn. Sử dụng các phím 128 bit, đầu ra được mã hóa trong phiên bản đặc biệt của Base64 để cho phép chuyển qua trò chuyện của Minecraft. Nhược điểm - tin nhắn sẽ tăng khoảng 30% về độ dài và máy chủ có thể cắt bớt chúng nếu chúng vượt quá giới hạn kích thước.",
	"algorithm.nochatreports.aes_gcm_base64.name": "AES/GCM+Base64R",
	"algorithm.nochatreports.aes_gcm_base64": "§lAES/GCM+Base64R§r\nBảo mật hơn để đổi lấy việc tăng đáng kể kích thước tin nhắn (12 byte cho vectơ khởi tạo và 12 cho thẻ xác thực, mã hóa Base64 ở trên cùng). Chọn nếu bạn coi trọng bảo mật hơn bất cứ điều gì khác.",
	"algorithm.nochatreports.aes_ecb_base64.name": "AES/ECB+Base64R",
	"algorithm.nochatreports.aes_ecb_base64": "§lAES/ECB+Base64R§r\nKém an toàn hơn đáng kể so với chế độ CFB, nhưng giúp bạn tiết kiệm một số byte do không yêu cầu vectơ khởi tạo. Vẫn đánh bại Caesar.",
	"algorithm.nochatreports.caesar.name": "Caesar",
	"algorithm.nochatreports.caesar": "§lCaesar§r\nMật mã meme. Với điều này, về cơ bản, bạn đang hy vọng rằng mọi người sẽ từ bỏ mà không cần cố gắng giải mã tin nhắn của bạn. Điều đó có thể đúng trong nhiều trường hợp, vì vậy khả năng sử dụng nó phụ thuộc vào mô hình mối đe dọa của bạn.\nKhóa phải là số nguyên từ 1 đến 1024. Việc thay đổi được thực hiện theo mã ký tự thay vì theo thứ tự bảng chữ cái để đảm bảo khả năng tương thích với bất kỳ ngôn ngữ nào.",
	"nochatreports.connect.nokey_rejected": "Máy chủ từ chối kết nối mà không có khóa ký trò chuyện.",
	"nochatreports.connect.await": "Đang chờ kết nối lại: %1$s giây...",
	"gui.nochatreports.realms_warning.header": "Cảnh báo: Realm",
	"gui.nochatreports.realms_warning.contents": "Máy chủ Realm không phải là riêng tư. Chủ sở hữu Realm không thể tắt báo cáo trò chuyện và Mojang áp dụng giám sát trò chuyện bổ sung để xác định \"tác hại trực tuyến\" tiềm ẩn và chuyển chúng sang đánh giá của con người. Sau đó, nếu bạn bị phát hiện vi phạm Tiêu chuẩn cộng đồng của Minecraft - ngay cả khi những người tham gia trò chuyện không bị xúc phạm - bạn sẽ bị cấm, tạm thời hoặc vĩnh viễn, khỏi tất cả các dịch vụ nhiều người chơi. Việc sử dụng mã hóa rất được khuyến khích.",
	"gui.nochatreports.realms_warning.check": "Không hiển thị lại",
	"gui.nochatreports.realms_warning.learn_more": "Tìm hiểu thêm",
	"gui.nochatreports.signing_required.header": "Cản báo: Đã yêu cầu ký trò chuyện",
	"gui.nochatreports.signing_required.contents": "Máy chủ nCho phép kýày yêu cầu tất cả các tin nhắn trò chuyện phải được ký, điều đó có nghĩa là chúng có thể được báo cáo cho Mojang, điều này có thể dẫn đến lệnh cấm đối với tất cả các máy chủ nhiều người chơi. Điều này có thể có nghĩa là chủ sở hữu máy chủ đã bật \"enforce-secure-profile\" trong server.properties, đây là mặc định kể từ 1.19.1.\n\nNhấp vào \"Cho phép ký\" để bật ký tin nhắn cho phiên này . Bạn cũng có thể sử dụng nút trạng thái an toàn trong màn hình trò chuyện để chọn chế độ ký cho máy chủ này.",
	"gui.nochatreports.signing_required.allow_signing": "Allow Signing",
	"gui.nochatreports.signing_required.cancel": "Bỏ qua",
	"gui.nochatreports.signing_required.check": "Không hiển thị lại trong phiên này",
	"chat.nochatreports.disabled.signing_requested": "Máy chủ từ chối gửi tin nhắn chưa được ký. Bạn có thể bật ký trò chuyện bằng cách thay đổi chế độ ký hoặc thông qua màn hình nhắc.",
	"gui.nochatreports.signing_mode": "§lChế độ ký: %1$s",
	"gui.nochatreports.signing_mode.default": "Mặc định (%1$s)",
	"gui.nochatreports.signing_mode.always": "Luôn luôn",
	"gui.nochatreports.signing_mode.never": "Không bao giờ",
	"gui.nochatreports.signing_mode.never_forced": "Không thể bật",
	"gui.nochatreports.signing_mode.prompt": "Nhắc",
	"gui.nochatreports.signing_mode.on_demand": "Theo yêu cầu",
	"gui.nochatreports.signing_mode.always.tooltip": "Chế độ này tự động cho phép ký tin nhắn ngay khi bạn vào máy chủ, giống hệt như cách máy khách thường làm.",
	"gui.nochatreports.signing_mode.never.tooltip": "Ở chế độ này, các thư không bao giờ được ký và tất cả các yêu cầu ký của máy chủ đều bị bỏ qua.",
	"gui.nochatreports.signing_mode.never_forced.tooltip": "Chế độ này cho biết rằng thư của bạn hoàn toàn không thể ký được vì bạn đang sử dụng tài khoản ngoại tuyến hoặc ứng dụng khách không thể tìm nạp khóa ký của bạn từ dịch vụ của Mojang.",
	"gui.nochatreports.signing_mode.prompt.tooltip": "Ở chế độ này, thư không được ký theo mặc định, nhưng nếu máy chủ yêu cầu ký - bạn sẽ thấy một màn hình bật lên nơi bạn có thể kích hoạt ký cho một phiên.",
	"gui.nochatreports.signing_mode.on_demand.tooltip": "Tương tự như chế độ nhắc, nhưng thay vì hiển thị màn hình bật lên, ký sẽ chỉ được bật tự động ngay khi máy chủ yêu cầu.",

	"configuration.NoChatReports.config": "No Chat Reports",
	"configuration.NoChatReports.category.client": "Máy khách",
	"option.NoChatReports.enableMod": "Bật mod",
	"option.NoChatReports.enableMod.tooltip": "Chịu trách nhiệm kích hoạt hầu hết các chức năng phía máy khách của mod. Sẽ yêu cầu tham gia lại máy chủ để có hiệu lực nếu bật giữa phiên.",
	"option.NoChatReports.showNCRButton": "Hiện nút NCR",
	"option.NoChatReports.showNCRButton.tooltip": "Thêm một nút chuyển đổi hầu hết chức năng phía máy khách của mod sang menu nhiều người chơi.",
	"option.NoChatReports.defaultSigningMode": "Chế độ ký mặc định",
	"option.NoChatReports.defaultSigningMode.tooltip": "Đặt chế độ ký mặc định cho các máy chủ buộc hoặc cho phép ký trò chuyện.",
	"option.NoChatReports.showReloadButton": "Hiển thị nút tải lại",
	"option.NoChatReports.showReloadButton.tooltip": "Thêm một nút để tải lại cấu hình vào menu nhiều người chơi.",
	"option.NoChatReports.verifiedIconEnabled": "Đã bật biểu tượng đã xác minh",
	"option.NoChatReports.verifiedIconEnabled.tooltip": "Cho phép mod hiển thị biểu tượng đặc biệt trong menu nhiều người chơi cho các máy chủ có No Chat Reports hoặc một số biện pháp báo cáo chống trò chuyện được cài đặt.",
	"option.NoChatReports.verifiedIconOffsetX": "Biểu tượng đã xác minh độ lệch X",
	"option.NoChatReports.verifiedIconOffsetX.tooltip": "Xác định độ lệch trục X để hiển thị biểu tượng \"Máy chủ an toàn\".",
	"option.NoChatReports.verifiedIconOffsetY": "Biểu tượng đã xác minh độ lệch Y",
	"option.NoChatReports.verifiedIconOffsetY.tooltip": "Xác định độ lệch trục Y để hiển thị biểu tượng \"Máy chủ an toàn\".",
	"gui.NoChatReports.showEncryptionButtonWarning": "§cDưới đây không tắt mã hóa, nó chỉ ẩn nút!",
	"option.NoChatReports.showEncryptionButton": "Hiển thị nút mã hóa",
	"option.NoChatReports.showEncryptionButton.tooltip": "Đặt điều này thành false sẽ chỉ ngăn nút mã hóa hiển thị trong màn hình trò chuyện. Hãy lưu ý rằng bản thân mã hóa sẽ không tự động bị tắt cùng với nút.",
	"option.NoChatReports.showEncryptionIndicators": "Hiển thị các chỉ báo mã hóa",
	"option.NoChatReports.showEncryptionIndicators.tooltip": "Chuyển đổi hiển thị các chỉ báo tin nhắn được mã hóa, ở dạng thanh màu tím ở bên trái và §5§l(§r§5ȯ§5§l)§r khi di chuột qua bên phải của tin nhắn trò chuyện.",
	"option.NoChatReports.showServerSafety": "Hiển thị an toàn máy chủ",
	"option.NoChatReports.showServerSafety.tooltip": "Cho phép máy khách hiển thị trạng thái an toàn của máy chủ ở góc dưới cùng bên phải của màn hình trò chuyện. Biểu tượng có thể di chuột qua để biết thêm thông tin.",
	"option.NoChatReports.showServerSafety.moreInfo": "§bNhấp vào đây để đọc thêm về mức độ an toàn của máy chủ",
	"option.NoChatReports.hideInsecureMessageIndicators": "Ẩn các chỉ báo tin nhắn chưa được xác minh",
	"option.NoChatReports.hideInsecureMessageIndicators.tooltip": "Ngăn máy khách hiển thị các chỉ báo tin nhắn chưa được xác minh, ở dạng thanh màu xám ở bên trái tin nhắn trò chuyện.",
	"option.NoChatReports.hideModifiedMessageIndicators": "Ẩn các chỉ báo tin nhắn đã sửa đổi",
	"option.NoChatReports.hideModifiedMessageIndicators.tooltip": "Ngăn máy khách hiển thị các chỉ báo tin nhắn đã sửa đổi, ở dạng thanh màu xám ở bên trái và §7§l(§r§7?§7§l)§r khi di chuột qua bên phải của tin nhắn trò chuyện.",
	"option.NoChatReports.hideSystemMessageIndicators": "Ẩn chỉ báo tin nhắn hệ thống",
	"option.NoChatReports.hideSystemMessageIndicators.tooltip": "Ngăn máy khách hiển thị các chỉ báo tin nhắn hệ thống, ở dạng thanh màu xám ở bên trái tin nhắn trò chuyện.",
	"option.NoChatReports.hideWarningToast": "Ẩn cảnh báo",
	"option.NoChatReports.hideWarningToast.tooltip": "Xóa cảnh báo được hiển thị khi vào máy chủ bị vô hiệu hóa §oenforce-secure-profile§r.",
	"option.NoChatReports.hideSigningRequestMessage": "Ẩn thông báo yêu cầu ký",
	"option.NoChatReports.hideSigningRequestMessage.tooltip": "Ẩn tin nhắn trò chuyện được hiển thị khi máy chủ yêu cầu máy khách ký tin nhắn.",
	"option.NoChatReports.alwaysHideReportButton": "Luôn ẩn nút báo cáo",
	"option.NoChatReports.alwaysHideReportButton.tooltip": "Ngăn không cho máy khách hiển thị nút báo cáo trong màn hình Tương tác xã hội. Điều này bị tắt theo mặc định và mod chỉ đơn giản là làm cho nút không hoạt động trên các máy chủ có cài đặt No Chat Reports, thêm phần giải thích vào chú giải công cụ của nút.",
	"option.NoChatReports.demandOnServer": "Yêu cầu trên máy chủ",
	"option.NoChatReports.demandOnServer.tooltip": "Ngăn máy khách tham gia các máy chủ chưa cài đặt No Chat Reports.",
	"option.NoChatReports.enableDebugLog": "Bật nhật ký gỡ lỗi",
	"option.NoChatReports.enableDebugLog.tooltip": "Cho phép ghi nhật ký thông tin gỡ lỗi nhất định. Điều này thường vô dụng đối với những người không phải là nhà phát triển.",
	"option.NoChatReports.disableTelemetry": "Vô hiệu hóa đo từ xa",
	"option.NoChatReports.disableTelemetry.tooltip": "Cho phép mod tắt tính năng đo từ xa tích hợp, tương tự như cách No Telemetry thực hiện.",
	"configuration.NoChatReports.category.lan": "LAN",
	"option.NoChatReports.demandOnClient": "Yêu cầu máy khách",
	"option.NoChatReports.demandOnClient.tooltip": "Làm cho máy chủ yêu cầu tất cả các máy khách tham gia cài đặt No Chat Reports.",
	"option.NoChatReports.demandOnClientMessage": "Yêu cầu về tin nhắn kick của máy khách",
	"option.NoChatReports.demandOnClientMessage.tooltip": "Thông báo được hiển thị cho khách hàng khi nó cố gắng tham gia máy chủ mà không cài đặt No Chat Reports.",
	"option.NoChatReports.convertToGameMessage": "Chuyển đổi thành tin nhắn trò chơ",
	"option.NoChatReports.convertToGameMessage.tooltip": "Làm cho máy chủ chuyển đổi tất cả tin nhắn của người chơi thành tin nhắn hệ thống. Thông báo hệ thống không có bất kỳ chữ ký nào được đính kèm và không thể được báo cáo; trên các máy khách chưa sửa đổi, chúng sẽ hiển thị với thanh màu xám ở bên trái.",
	"option.NoChatReports.addQueryData": "Thêm dữ liệu truy vấn",
	"option.NoChatReports.addQueryData.tooltip": "Cho phép máy chủ gửi dữ liệu bổ sung cho máy khách khi xử lý lệnh ping. Điều này được sử dụng để hiển thị biểu tượng \"Máy chủ an toàn\", cũng như một số mục đích kỹ thuật khác."
}
